Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: The debugger can tell you various information about the program while it is running.
sv: Felsökaren kan visa dig diverse information om programmet medan det körs.

source: View shared libraries
sv: Visa delade bibliotek

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Info</gui><gui>Shared Libraries</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Information</gui><gui>Delade bibliotek</gui></guiseq>.

source: This opens a window which will list all shared libraries the program has loaded and their locations in memory. It also shows whether each library's symbol table is loaded or not.
sv: Detta öppnar ett fönster som kommer att lista alla delade bibliotek som programmet har läst in och deras platser i minnet. Det visar också huruvida varje biblioteks symboltabell har lästs in eller inte.

source: View signals
sv: Visa signaler

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Info</gui><gui>Kernel signals</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Information</gui><gui>Kärnsignaler</gui></guiseq>.

source: This lists all available signals with a small description and three columns to specify what to do when a signal is received:
sv: Detta listar alla tillgängliga signaler med en liten beskrivning och tre kolumner som anger vad som ska göras då en signal tas emot:

source: Stop
sv: Stoppa

source: The debugger stops the program execution when the program receives this signal.
sv: Felsökaren stoppar programkörningen då programmet tar emot denna signal.

source: Print
sv: Skriv ut

source: The debugger displays the received signal.
sv: Felsökaren visar den mottagna signalen.

source: The debugger passes the signal to the program.
sv: Felsökaren skickar signalen till programmet.

source: The context menu that is displayed when you click the right mouse button has all its items disabled because the corresponding functions are not implemented yet.
sv: Snabbvalsmenyn som visas när du klickar på höger musknapp har alla objekt inaktiverade eftersom motsvarande funktioner inte är implementerade ännu.

source: Examine local variables.
sv: Undersök lokala variabler.

source: Local variables
sv: Lokala variabler

source: Local variables of the current frame (the current function in which the program control is present) are displayed in the <gui>Locals</gui> window. During execution of the program (e.g. during single stepping), local variables will be updated. If any variable value was changed in the last debugging step, its value will be highlighted in red. Variables are presented in a tree form for easy view.
sv: Lokala variabler i den aktuella ramen (den aktuella funktionen i vilken programstyrningen är) visas i fönstret <gui>Lokala variabler</gui>. Under körning av programmet (t.ex. vid enkelstegning) kommer lokala variabler att uppdateras. Om något variabel värde har ändrats sedan det senare felsökningssteget kommer dess värde att markeras i rött. Variabler presenteras i en trädvy för att underlätta överblicken.

source: Listing local variables
sv: Lista lokala variabler

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Locals</gui></guiseq> to open the <gui>Locals</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Lokala variabler</gui></guiseq> för att öppna fönstret <gui>Lokala variabler</gui>.

source: All local variables are displayed in a tree view with children used to represent structure or array members.
sv: Alla lokala variabler visas i en trädvy med barn som representerar struktur- eller arraymedlemmar.

source: Variable
sv: Variabel

source: The name of the variable.
sv: Namnet på variabeln.

source: Value
sv: Värde

source: The variable value.
sv: Variabelns värde.

source: The type of the variable.
sv: Variabelns typ.

source: Changing the value of a variable
sv: Ändra värdet på en variabel

source: In the <gui>Locals</gui> window, select the variable you want to edit and double click in the <gui>Value</gui> column.
sv: I fönstret <gui>Lokala variabler</gui>, markera variabeln du vill redigera och dubbelklicka i kolumnen <gui>Värde</gui>.

source: Type the new value.
sv: Skriv in det nya värdet.

source: Attach to process dialog
sv: Dialogrutan Anslut till process

source: Attach to Process Dialog
sv: Dialogrutan Anslut till process

source: The <gui>Attach to process</gui> dialog allows you to select a currently running process.
sv: Dialogrutan <gui>Anslut till process</gui> låter dig välja en process som körs.

source: <gui>Hide paths</gui>
sv: <gui>Dölj sökvägar</gui>

source: This hides command paths in the process list if checked.
sv: Detta döljer kommandosökvägar i processlistan om ikryssat.

source: <gui>Hide process parameters</gui>
sv: <gui>Dölj processparametrar</gui>

source: This hides the command line arguments in the process list if checked.
sv: Detta döljer kommandoradsargument i processlistan om ikryssat.

source: <gui>Display process tree</gui>
sv: <gui>Visa processträd</gui>

source: If unchecked, the processes are displayed in a list. If checked, the processes are displayed in a tree.
sv: Om inte ikryssat visas processerna i en lista. Om ikryssat visas processerna i ett träd.

source: Start a program with the debugger.
sv: Starta ett program med felsökaren.

source: Debug a program
sv: Felsök ett program

source: Start a program in the debugger
sv: Starta ett program i felsökaren

source: The current program is defined in the <gui>Program Parameters</gui> dialog. See <link xref="run-parameters-dialog"/> for more information. This program can be started in the debugger like this:
sv: Det aktuella programmet är definierat i dialogrutan <gui>Programparametrar</gui>. Se <link xref="run-parameters-dialog"/> för vidare information. Detta program kan startas i felsökaren på detta vis:

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Debug Program</gui></guiseq> or press <keyseq><key>Shift</key><key>F12</key></keyseq>
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Felsök program</gui></guiseq> eller tryck på <keyseq><key>Skift</key><key>F12</key></keyseq>

source: A program can be more difficult to debug if it is highly optimized or if debugging information is missing. Whether optimization and debugging information are enabled, is defined in the configure step. Normally, there is a Debug configuration available, that turns off optimization and includes all debugging information. Anjuta displays a warning if this configuration is not used. See <link xref="autotools-build-configure"/> for more information.
sv: Ett program kan vara svårare att felsöka om det är mycket optimerat eller om felsökningsinformation saknas. Huruvida optimering och felsökningsinformation är aktiverade definieras av konfigurationssteget. Normalt finns det en felsökningskonfiguration som slår av optimering och inkluderar all felsökningsinformation. Anjuta visar en varning om denna konfiguration inte används. Se <link xref="autotools-build-configure"/> för vidare information.

source: Debug an already running application
sv: Felsök ett program som redan kör

source: The debugger can be used on an already running application.
sv: Felsökaren kan användas för ett redan körande program.

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Debug Process...</gui></guiseq> to get a dialog listing all currently running processes.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Felsök process…</gui></guiseq> för att få en dialogruta som listar alla de körande processerna.

source: Select a process in the <gui>Attach to process</gui> dialog and click on <gui>Attach</gui> to start the debugger on this process. See <link xref="debug-process-dialog"/> for more details.
sv: Välj en process i dialogrutan <gui>Anslut till process</gui> och klicka på <gui>Anslut</gui> för att starta felsökaren för denna process. Se <link xref="debug-process-dialog"/> för vidare information.

source: Debug a remote application
sv: Felsök ett fjärrprogram

source: The debugger can be used to debug an application running on another computer connected through a TCP or serial connection.
sv: Felsökaren kan användas för att felsöka ett program som kör på en annan dator ansluten via TCP-anslutning eller seriell anslutning.

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Debug Remote...</gui></guiseq>
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Felsök fjärrmål…</gui></guiseq>

source: Select the type of the connection to the remote application, <gui>Serial Line Connection</gui> or <gui>TCP/IP Connection</gui>.
sv: Välj typen av anslutning till fjärrprogrammet, <gui>Serielinjeanslutning</gui> eller <gui>TCP/IP-anslutning</gui>.

source: For a TCP connection, fill in the <gui>Address</gui> and <gui>Port</gui> fields.
sv: För en TCP-anslutning, fyll i fälten <gui>Adress</gui> och <gui>Port</gui>.

source: For a serial connection, fill in the text box below with the serial device name, for example <cmd>/dev/ttyb</cmd>.
sv: För en seriell anslutning, fyll i textrutan nedan med serieenhetens namn, till exempel <cmd>/dev/ttyb</cmd>.

source: Click on <gui>Connect</gui> to start the debugger and connect to the remote target.
sv: Klicka på <gui>Anslut</gui> för att starta felsökaren och ansluta till fjärrmålet.

source: Stop the debugger
sv: Stoppa felsökaren

source: The debugger and the program can be stopped at any time like this:
sv: Felsökaren och programmet kan stoppas när som helst på detta vis:

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Stop Debugger</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Stoppa felsökare</gui></guiseq>.

source: Examine the stack.
sv: Undersök stacken.

source: List stack frames
sv: Lista stackramar

source: A stack frame is the area of the stack associated to each function call. It lists all functions and their arguments in the sequence they were called. Each stack frame is numbered starting from 0 for the current function. You can only view the stack frames while the debugger is running.
sv: En stackram är delen av stacken som associeras med varje funktionsanrop. Den listar alla funktioner och deras argument i den sekvens de anropats. Varje stackram numreras med början på 0 från den aktuella funktionen. Det är bara medan felsökaren kör som du kan visa stackramarna.

source: Moreover, a program can be composed of several threads. Each thread is executed independently and has its own registers, stack and local variables, but shares all global variables.
sv: Ett program kan dessutom bestå av flera trådar. Varje tråd kör oberoende av alla andra och har sina egna register, stack och lokala variabler, men delar alla globala variabler.

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Stack</gui></guiseq> to open the <gui>Stack</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Stack</gui></guiseq> för att öppna fönstret <gui>Stack</gui>.

source: The stacks are displayed in a tree view having their corresponding thread as parent and displaying the following information:
sv: Stackarna visas i en trädstruktur där deras motsvarande tråd är förälder och innehåller följande information:

source: Active
sv: Aktiv

source: This contains a yellow arrow to represent the active stack frame. By default it is frame 0, the current function. All evaluations and local variables are relative to this active frame. You can change the active stack frame to examine local variables in other functions.
sv: Detta innehåller en gul pil för att representera den aktiva stackramen. Som standard är det ram 0, den aktuella funktionen. Alla utvärderingar och lokala variabler är relativa till denna aktiva ram. Du kan ändra den aktiva stackramen för att undersöka lokala variabler i andra funktioner.

source: Thread
sv: Tråd

source: This is a number corresponding to each thread.
sv: Detta är talet som motsvarar varje tråd.

source: Frame
sv: Ram

source: This is the frame number starting from 0 for the current function. The first function of your program, for example <code>main()</code> in a C program, has the highest number.
sv: Detta är ramnumret med början på 0 för den aktuella funktionen. Den första funktionen i ditt program, till exempel <code>main()</code> i ett C-program, har det högsta numret.

source: File
sv: Fil

source: The name of the file containing the function corresponding to this frame.
sv: Namnet på filen som innehåller funktionen som motsvarar denna ram.

source: Line
sv: Rad

source: The line number of the function corresponding to this frame.
sv: Radnumret för funktionen som motsvarar denna ram.

source: Function
sv: Funktion

source: The name of the function corresponding to this frame.
sv: Namnet på funktionen som motsvarar denna ram.

source: The address of the function corresponding to this frame.
sv: Adressen till funktionen som motsvarar denna ram.

source: Arguments
sv: Argument

source: The function arguments.
sv: Funktionens argument.

source: Change the current stack frame or thread
sv: Ändra aktuell stackram eller tråd

source: In the <gui>Stack</gui> window, select the frame you want.
sv: I fönstret <gui>Stack</gui>, välj ramen du önskar.

source: Right-click and select <gui>Set current frame</gui>.
sv: Högerklicka och välj <gui>Ställ in aktuell ram</gui>.

source: Clicking on a stack frame in the same thread changes only the stack frame, allowing to see other local variables. But doing it in another thread will change both the stack frame and the thread. The register values will be different and the debugger will restart in the selected thread.
sv: Att klicka på en stackram i samma tråd ändrar bara stackramen, och låter dig se andra lokala variabler. Men om du klickar på en stackram i en annan tråd kommer både stackramen och tråden att ändras. Registervärden kommer att vara olika och felsökaren kommer att starta om i den aktuella tråden.

source: View the current function
sv: Visa aktuell funktion

source: Double-click, or right-click and select <gui>View Source</gui>.
sv: Dubbelklicka, eller högerklicka och välj <gui>Visa källa</gui>.

source: Get a stack trace
sv: Erhåll ett stackspår

source: In the <gui>Stack</gui> window, right-click and select <gui>Get stack trace</gui>.
sv: I fönstret <gui>Stack</gui>, högerklicka och välj <gui>Hämta stackspårning</gui>.

source: Stopping and continuing.
sv: Stoppa och fortsätta.

source: Stop and step
sv: Stoppa och stega

source: Like a video editing session, the program can be executed in slow motion with the ability to go forward, pause, stop, and so on. This is essential for tracking program behavior. You cannot go backward yet, though.
sv: Som för en videoredigeringssession kan programmet köras i slow motion med möjlighet att gå framåt, pausa, stoppa och så vidare. Detta är väsentligt för att spåra programbeteende. Du kan dock inte gå bakåt än.

source: Step in
sv: Stega in

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Step In</gui></guiseq> or press <key>F5</key> or click on the <gui>Step In</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Stega in</gui></guiseq> eller tryck <key>F5</key> eller klicka på ikonen <gui>Stega in</gui> i verktygsfältet.

source: Single stepping executes only one statement of the program (from the place where it has stopped) and then returns control. If the statement that is executed contains one function, the debugger tries to step inside the functions (in the sequence in which the functions are executed). Once the statement is executed and control is passed back, you can study your program's state.
sv: Enkelstegning kör endast en sats i programmet (från platsen där det har stannat) och återger därefter kontrollen. Om satsen som körts innehåller en funktion försöker felsökaren att stega in i funktionerna (enligt den sekvens i viken funktionerna körs). När satsen körts och kontrollen återges kan du studera ditt programs tillstånd.

source: If the <gui>Disassembly window</gui> has the focus when this command is selected, it executes only one assembler instruction.
sv: Om fönstret <gui>Disassemblera</gui> har fokus när detta kommando väljs, körs endast en assemblerinstruktion.

source: Step over
sv: Stega över

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Step Over</gui></guiseq> or press <key>F6</key> or click on the <gui>Step Over</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Stega över</gui></guiseq> eller tryck <key>F6</key> eller klicka på ikonen <gui>Stega över</gui> i verktygsfältet.

source: Stepping over is similar to stepping except that it does not stop inside any function in the statement being executed.
sv: Att stega över liknar stegning förutom att den inte stoppar inuti eventuella funktioner i satsen som körs.

source: If the <gui>Disassembly window</gui> has the focus when this command is selected, it executes only one assembler instruction, except if that instruction is a call to a subroutine, in which case the program stops when the subroutine is completed.
sv: Om fönstret <gui>Disassemblera</gui> har fokus när detta kommando väljs, körs endast en assemblerinstruktion, förutom om den instruktionen är ett anrop till en subrutin, i vilket fall programmet stannar när subrutinen är klar.

source: Step out
sv: Stega ut

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Step Out</gui></guiseq> or press <keyseq><key>Shift</key><key>F5</key></keyseq> or click on the <gui>Step Out</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Stega ut</gui></guiseq> eller tryck på <keyseq><key>Skift</key><key>F5</key></keyseq> eller klicka på ikonen <gui>Stega ut</gui> i verktygsfältet.

source: Stepping out executes the current function until it returns to the calling function.
sv: Att stega ut kör den aktuella funktionen tills den returnerar till den anropande funktionen.

source: Run and continue
sv: Kör och fortsätt

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Run/Continue</gui></guiseq> or press <key>F4</key> or click on the <gui>Continue</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Kör/Fortsätt</gui></guiseq> eller tryck på <key>F4</key> eller klicka på ikonen <gui>Fortsätt</gui> i verktygsfältet.

source: This command restarts the program and lets it run until a breakpoint is encountered or the program exits.
sv: Detta kommando startar om programmet och låter det köra tills en brytpunkt påträffas eller programmet avslutar.

source: Run To
sv: Kör till

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Run to Cursor</gui></guiseq> or press <key>F8</key> or click on the <gui>Run to</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Kör till markör</gui></guiseq> eller tryck på <key>F8</key> eller klicka på ikonen <gui>Kör till</gui> i verktygsfältet.

source: This restarts the program and lets it run until the line or the address (if the <gui>Disassembly window</gui> has the focus) at the cursor is reached.
sv: Detta startar om programmet och låter det köra tills raden eller adressen (om fönstret <gui>Disassemblera</gui> har fokus) vid markören nås.

source: Stopping the Program
sv: Stoppa programmet

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Pause Program</gui></guiseq> or click on the <gui>Pause</gui> icon in the toolbar.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Pausa program</gui></guiseq> eller klicka på ikonen <gui>Pausa</gui> i verktygsfältet.

source: This interrupts the program and returns control to the debugger, allowing you to perform debugging tasks, like inspecting data or adding breakpoints.
sv: Detta avbryter programmet och återger kontrollen till felsökaren, vilket låter dig utföra felsökningsarbete, så som att inspektera data eller lägga till brytpunkter.

source: Debugging tips and tricks.
sv: Tips och trick för felsökning.

source: Debugging tips
sv: Felsökningstips

source: Fixing GLib/GTK+ critical errors
sv: Fixa kritiska GLib/GTK+-fel

source: Sometimes it can be difficult to track down where GLib critical errors are occurring, since they do not stop the program. You can set the program to stop as soon as it gets a GLib critical error, by setting the environment variable <sys>G_DEBUG</sys> to the value <sys>fatal_criticals</sys>.
sv: Det kan ibland vara svårt att spåra upp var kritiska GLib-fel uppstår, då dessa inte stannar programmet. Du kan ställa in programmet att stanna så fort ett kritiskt GLib-fel uppstår genom att sätta miljövariabeln <sys>G_DEBUG</sys> till värdet <sys>fatal_criticals</sys>.

source: Open the <link xref="run-parameters-dialog"/> by selecting <guiseq><gui>Run</gui><gui>Program Parameters...</gui></guiseq> from the main menu.
sv: Öppna <link xref="run-parameters-dialog"/> genom att <guiseq><gui>Kör</gui><gui>Programparametrar…</gui></guiseq> från huvudmenyn.

source: Click the plus sign next to <gui>Environment Variables</gui> to expand the list of environment variables.
sv: Klicka på plustecknet intill <gui>Miljövariabler</gui> för att expandera listan över miljövariabler.

source: Click <gui>New</gui> to add a new entry to the list.
sv: Klicka på <gui>Ny</gui> för att lägga till en ny post i listan.

source: Fill in <gui>Name</gui> with <input>G_DEBUG</input> and <gui>Value</gui> with <input>fatal_criticals</input>.
sv: Sätt <gui>Namn</gui> till <input>G_DEBUG</input> och <gui>Värde</gui> till <input>fatal_criticals</input>.

source: Click <gui>Apply</gui> to confirm the changes.
sv: Klicka på <gui>Verkställ</gui> för att bekräfta ändringarna.

source: Run the program with the debugger by selecting <guiseq><gui>Run</gui><gui>Debug Program</gui></guiseq> from the main menu.
sv: Kör programmet med felsökaren genom att välja <guiseq><gui>Kör</gui><gui>Felsök program</gui></guiseq> från huvudmenyn.

source: Use the program until the critical error occurs.
sv: Använd programmet tills det kritiska felet uppstår.

source: When the debugger stops your program, look at the <link xref="debug-stack"/> to check where this error comes from.
sv: När felsökaren stoppar ditt program, kolla på <link xref="debug-stack"/> för att se var felet kommer ifrån.

source: The top function with frame number 0 is in GLib, so you have to look down in the stack. Typically the error originates from the topmost function that belongs to your program.
sv: Funktionen längst upp med ramnummer 0 är i GLib, så du måste kolla längre ner i stacken. Felet brukar normalt uppstå från den översta funktionen som tillhör ditt program.

source: Monitor expressions and variables.
sv: Övervaka uttryck och variabler.

source: Watch expressions
sv: Bevakningsuttryck

source: Watch expressions, or watches for short, are expressions that the debugger evaluates and prints the result of every time the program is stopped; for example, after every <link xref="debug-step">single-step</link> through the program.
sv: Bevakningsuttryck, eller kortare: bevakningar, är uttryck som felsökaren utvärderar och skriver ut resultatet för varje gång programmet stoppas; till exempel efter varje <link xref="debug-step">enkelsteg</link> genom programmet.

source: List watched expressions
sv: Lista bevakningsuttryck
