Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

# _
source: translator-credits
sv: Daniel Nylander <po@danielnylander.se>, 2007 Anders Jonsson <anders.jonsson@norsjovallen.se>, 2017 Sebastian Rasmussen, <sebras@gmail.com>, 2020

source: Help for Anjuta DevStudio.
sv: Hjälp för Anjuta DevStudio.

source: Anjuta logo
sv: Logo för Anjuta

source: Project Management
sv: Projekthantering

source: Coding and code navigation
sv: Kodande och kodnavigering

source: Building Project
sv: Bygga projekt

source: Debugging Program
sv: Felsöka program

source: Reference
sv: Referens

source: Configure and use the integrated editor features
sv: Konfigurera och använd de integrerade redigeringsfunktionerna

source: Autocompletion and calltips
sv: Automatisk komplettering och anropstips

source: Autocompletion
sv: Automatisk komplettering

source: Autocompletion automatically suggests functions and other code symbols after you start typing by trying to match existing symbols with the first characters typed. It will popup a drop-down menu where you can select a match by using the <key>Enter</key> key. Normally this happens automatically after you typed the third (non-whitespace) character but you can also force it by using the <guiseq><gui>Edit</gui><gui>Auto-Complete</gui></guiseq> menu item.
sv: Automatisk komplettering föreslår automatiskt funktioner och andra kodsymboler då du börjat skriva genom att försöka matcha befintliga symboler med de första tecknen som matats in. Detta kommer visa en rullgardinsmeny där du kan välja en matchning med tangenten <key>Retur</key>. Detta händer vanligen automatiskt efter att du matat in det tredje tecknet (ej blanksteg) men du kan också tvinga det genom att använda menyobjektet <guiseq><gui>Redigera</gui><gui>Automatisk komplettering</gui></guiseq>.

source: Anjuta supports autocompletion for code written in C/C++, Vala, Javascript and Python. Note that autocompletion can only work if anjuta knows about the symbols used. If you are using C/C++ libraries that are not configured using <cmd>pkg-config</cmd> and/or not added to the project configuration, anjuta won't be able to find those symbols and autocompletion might not work.
sv: Anjuta stöder automatisk komplettering för kod som skrivits i C/C++, Vala, Javascript och Python. Observera att automatisk komplettering endast fungerar om anjuta känner till de använda symbolerna. Om du använder C/C++-bibliotek som inte konfigurerats med <cmd>pkg-config</cmd> och/eller inte har lagts till i projektets konfiguration kommer inte anjuta kunna hitta dessa symboler och automatisk komplettering kanske inte fungerar.

source: In addition some syntax might be too complex for the integrated parser and it might not be able to detect which completion is required
sv: Dessutom kan viss syntax vara för komplex för den integrerade parsern och den kan kanske inte upptäcka vilken komplettering som krävs

source: Effective coding using calltips
sv: Effektivt kodande med anropstips

source: As it is usually quite hard to remember the signature of every method or function used in a project, the editor will automatically display a small tooltip whenever you type '(' after a function name and show you the signature.
sv: Då det vanligen är rätt svårt att komma ihåg signaturen för varje metod eller funktion som används i ett projekt kommer redigeraren automatiskt att visa en liten inforuta varje gång du skriver ”(” efter ett funktionsnamn och visa dig signaturen.

source: Quickly find the information you need in the API documentation
sv: Hitta snabbt informationen du behöver i API-dokumentationen

source: Using the API reference
sv: Använda API-referensen

source: Browsing the API reference
sv: Bläddra i API-referensen

source: For a quick access to the API reference of libraries, anjuta features an integrated API browser. If not already done it can be activated in the preferences (<guiseq><gui>Edit</gui><gui>Preferences</gui></guiseq>) in <guiseq><gui>General</gui><gui>Plugins</gui></guiseq> by choosing the <app>DevHelp</app> plugin.
sv: För snabb åtkomst till API-referensen för bibliotek har anjuta en integrerad API-bläddrare. Om det inte redan gjorts kan den aktiveras i inställningarna (<guiseq><gui>Redigera</gui><gui>Inställningar</gui></guiseq>) i <guiseq><gui>Allmänt</gui><gui>Insticksmoduler</gui></guiseq> genom att välja <app>DevHelp</app>-insticksmodulen.

source: The API reference has two windows, one for searching for a specific symbol and the browser for viewing the help documents.
sv: API-referensen har två fönster, ett för att söka efter en specifik symbol, och bläddraren för att visa hjälpdokumenten.

source: Jump to the API reference using shortcuts in the editor
sv: Hoppa till API-referensen genom att använda kortkommandon i redigeraren

source: In case you are unsure how a specific function used in existing code works, simply place the cursor on the function name and use <keyseq><key>Shift</key><key>F1</key></keyseq> (or <guiseq><gui>Help</gui><gui>Context-Help</gui></guiseq>) to jump to the documentation.
sv: Om du är osäker på hur en specifik funktion som används i befintlig kod fungerar kan du helt enkelt placera markören på funktionsnamnet och använda <keyseq><key>Skift</key><key>F1</key></keyseq> (eller <guiseq><gui>Hjälp</gui><gui>Sammanhangshjälp</gui></guiseq>) för att hoppa till dokumentationen.

source: Configure and use automatic indentation for a consistent coding style
sv: Konfigurera och använd automatisk indentering för en konsekvent kodningsstil

source: Auto-indentation
sv: Automatisk indentering

source: Configuring and using auto-indentation
sv: Konfigurera och använda automatisk indentering

source: Manual configuration
sv: Manuell konfiguration

source: Automatic indentation is configured in the preferences (<guiseq><gui>Edit</gui><gui>Preferences</gui></guiseq>) in the tab corresponding to the used programming language. The indentation width for several types of statements can be set there.
sv: Automatisk indentering konfigureras i inställningarna (<guiseq><gui>Redigera</gui><gui>Inställningar</gui></guiseq>) i fliken som motsvarar det använda programmeringsspråket. Indenteringsbredden för flera sorters satser kan ställas in där.

source: The big disadvantage of manually configuring indentation is that all developers working on a project must use the same settings or it will result if different styles used in the same files. For a better solution, see the next section.
sv: Den stora nackdelen med att manuellt konfigurera indentering är att alla utvecklare som jobbar på ett projekt måste använda samma inställningar, annars kommer det resultera i att olika stilar används i samma filer. För en bättre lösning, se nästa avsnitt.

source: Unless explicitly changed in the preferences the indentation settings found in the Modeline of a file will be used instead of the configured settings to keep the file consistent.
sv: Om de inte ändras explicit i inställningarna kommer indenteringsinställningarna i en fils lägesrad att användas istället för de konfigurerade inställningarna för att behålla filen konsekvent.

source: Modelines
sv: Lägesrader

source: Modelines are used to help editors to automatically detect the indentation mode which should be used for a particular file. They are especially useful if many developers work on the same project and use different environments.
sv: Lägesrader används för att hjälpa redigerare att automatiskt upptäcka indenteringsläget som ska användas för en specifik fil. De är särskilt användbara om många utvecklare arbetar på samma projekt och använder olika miljöer.

source: Anjuta supports modelines in the two formats used by <app>Vim</app> and <app>Emacs</app>.
sv: Anjuta stöder lägesrader i de två format som används av <app>Vim</app> och <app>Emacs</app>.

source: Indenting blocks of code
sv: Indentera kodblock

source: Normally new lines are appropriately indented automatically but you can indent existing lines or all selected code with the <guiseq><gui>Edit</gui><gui>Auto-Indent</gui></guiseq> menu item.
sv: Vanligen indenteras automatiskt nya rader på korrekt sätt men du kan indentera befintliga rader eller all markerad kod med menyobjektet <guiseq><gui>Redigera</gui><gui>Automatisk indentering</gui></guiseq>.

source: Efficient ways to navigate through source code
sv: Effektiva sätt att navigera genom källkod

source: Code navigation using the symbol browser
sv: Kodnavigering med symbolbläddraren

source: Using the symbol browser
sv: Använda symbolbläddraren

source: The symbol browser allows you to get an overview over the symbols used in your project. Symbols refers to variables, functions/methods and classes here and the exact definition depends on the programming language used.
sv: Symbolbläddraren låter dig få en överblick över symbolerna som används i ditt projekt. Symboler betyder här variabler, funktioner/metoder och klasser, och den exakta definitionen beror på programmeringsspråket som används.

source: The symbol browser has three tabs:
sv: Symbolbläddraren har tre flikar:

source: <gui>File</gui> shows the symbols of the current file in the editor
sv: <gui>Fil</gui> visar symbolerna för aktuell fil i redigeraren

source: <gui>Project</gui> shows all symbols of the project
sv: <gui>Projekt</gui> visar alla symboler i projektet

source: <gui>Search</gui> lets you search the symbols in the project (use <keyseq><key>Ctrl</key><key>L</key></keyseq> to jump directly to the search box)
sv: <gui>Sök</gui> låter dig söka bland symbolerna i projektet (använd <keyseq><key>Ctrl</key><key>L</key></keyseq> för att hoppa direkt till sökrutan)

source: Double click on jumps to the definition of the symbol in the editor.
sv: Dubbelklick hoppar till definitionen för symbolen i redigeraren.

source: Navigating in the editor
sv: Navigera i redigeraren

source: In the <gui>Goto</gui> popup-menu of the editor there two items that help you to quickly navigate through the source code:
sv: I redigerarens poppuppmeny <gui>Gå till</gui> finns det två saker som hjälper dig att snabbt navigera genom källkoden:

source: <gui>Symbol declaration</gui>
sv: <gui>Symboldeklaration</gui>

source: If you want to go back to the position in the editor where you used the shown items in the <gui>Goto</gui> menu you can use the <gui>Previous history</gui> (and <gui>Next history</gui>) items in the same menu.
sv: Om du vill gå tillbaka till positionen i redigeraren där du använde de visade objekten i menyn <gui>Gå till</gui> kan du använda objekten <gui>Föregående historik</gui> (och <gui>Nästa historik</gui>) i samma meny.

source: Autotools project backend.
sv: Bakände för Autotools-projekt.

source: GNU Autotools project backend plugin
sv: Bakändesinstick för GNU Autotools-projekt

source: This is the most common project format on Linux. It has been designed to distribute source code packages on a wide range of Unix-like systems. If you have ever installed a program using <cmd>configure</cmd>, <cmd>make</cmd> and <cmd>make install</cmd>, you probably have already used it as a user.
sv: Det här är det vanligaste projektformatet i Linux. Det har designats för att distribuera källkodspaket över en rad Unix-liknande system. Om du någonsin har installerat ett program med <cmd>configure</cmd>, <cmd>make</cmd> och <cmd>make install</cmd> så har du troligen redan använt det som en användare.

source: It is typically a bit more difficult to use as a developer. However, it is the default backend for <app>Anjuta</app>, which has features that make it easier to use. All the project manager's features are enabled when using it. You should be able to maintain a project using the Autotools backend without writing a line in <file>configure.ac</file> or any <file>Makefile.am</file> files.
sv: Det är vanligen något svårare att använda som en utvecklare. Det är dock standardbakänden för <app>Anjuta</app>, vilket har funktioner som gör det lättare att använda. Alla projekthanterarens funktioner är aktiverade då det används. Du bör kunna underhålla ett projekt med Autotools-bakänden utan att skriva en rad i <file>configure.ac</file> eller några <file>Makefile.am</file>-filer.

source: Autotools files give more information than a makefile, but the backend does not support all the possible tricks. If you find a project that cannot be read correctly, filing a <link href="https://bugzilla.gnome.org/browse.cgi?product=anjuta">bug report</link> will be appreciated. In the meantime, as a workaround, you can use the directory project backend instead. It is much more limited but should find all source files.
sv: Autotools-filer innehåller mer information än en makefile, men bakänden har inte stöd för alla möjliga trick. Om du hittar ett projekt som inte kan läsas korrekt, då är det uppskattat om du skickar in en <link href="https://bugzilla.gnome.org/browse.cgi?product=anjuta">felrapport</link>. Under tiden kan du använda bakänden för katalogprojekt för att kringgå problemet. Den är mycket mer begränsad, men bör hitta alla källkodsfiler.

source: Edit autotools folder properties.
sv: Redigera autotools-katalogegenskaper.

source: Edit an Autotools Folder
sv: Redigera en Autotools-katalog

source: These properties allows you to define common properties for all targets belonging to this folder.
sv: Dessa egenskaper låter dig definiera gemensamma egenskaper för alla mål som tillhör denna mapp.

source: <gui>C compiler flags</gui>
sv: <gui>Flaggor för C-kompilator</gui>

source: The flags to pass to the C compiler if a per target value is not defined.
sv: Flaggorna att skicka till C-kompilatorn om inget värde per mål definierats.

source: <gui>C preprocessor flags</gui>
sv: <gui>Flaggor för C-preprocessor</gui>

source: These flags are passed to every compilation that invokes the C preprocessor. This value is ignored if these flags are defined for the target.
sv: Dessa flaggor skickas till varje kompilering som kör C-preprocessorn. Detta värde ignoreras om dessa flaggor finns definierade för målet.

source: <gui>C++ compiler flags</gui>
sv: <gui>Flaggor för C++-kompilator</gui>

source: The flags to pass to the C++ compiler flags if a per target value is not defined.
sv: Flaggorna att skicka till C++-kompilatorflaggorna om inget värde per mål definierats.

source: <gui>Fortran compiler flags</gui>
sv: <gui>Flaggor för Fortran-kompilator</gui>

source: The flags to pass to the Fortran 9x compiler if a per target value is not defined.
sv: Flaggorna att skicka till Fortran 9x-kompilatorn om inget värde per mål definierats.

source: <gui>Installation directories</gui>
sv: <gui>Installationskataloger</gui>

source: This defines installation directories. It is needed if you want to install files in custom directories.
sv: Detta definierar installationskataloger. Det behövs om du vill installera filer i anpassade kataloger.

source: <gui>Java compiler flags</gui>
sv: <gui>Flaggor för Java-kompilator</gui>

source: The flags to pass to the Java compiler if a per target value is not defined.
sv: Flaggorna att skicka till Java-kompilatorn om inget värde per mål definierats.

source: <gui>Lex/Flex compiler flags</gui>
sv: <gui>Kompilatorflaggor för Lex/Flex</gui>

source: The flags to pass to the scanner generator Lex or Flex if a per target value is not defined.
sv: Flaggorna att skicka till lexikaliseringsprogrammen Lex eller Flex om inget värde per mål definierats.

source: <gui>Linker flags</gui>
sv: <gui>Flaggor för länkare</gui>

source: The flags to pass to the linker if a per target value is not defined.
sv: Flaggorna att skicka till länkaren om inget värde per mål definierats.

source: <gui>Objective C compiler flags</gui>
sv: <gui>Flaggor för Objective C-kompilator</gui>

source: The flags to pass to the Objective C compiler if a per target value is not defined.
sv: Flaggorna att skicka till Objective C-kompilatorn om inget värde per mål definierats.

source: <gui>Vala compiler flags</gui>
sv: <gui>Flaggor för Vala-kompilator</gui>

source: The flags to pass to the Vala compiler if a per target value is not defined.
sv: Flaggorna att skicka till Vala-kompilatorn om inget värde per mål definierats.

source: <gui>Yacc/Bison compiler flags</gui>
sv: <gui>Kompilatorflaggor för Yacc/Bison</gui>

source: The flags to pass to the parser generator Bison or Yacc if a per target value is not defined.
sv: Flaggorna att skicka till parsergeneratorerna Bison eller Yacc om inget värde per mål definierats.

source: Edit autotools project properties.
sv: Redigera autotools-projektegenskaper.

source: Edit Autotools Project Properties
sv: Redigera Autotools-projektegenskaper

source: These are the properties of the root item.
sv: Detta är egenskaperna för rotobjektet.

source: <gui>Backend</gui>
sv: <gui>Bakände</gui>

source: This the project backend used by the project: Autotools. Another backend can be selected by clicking on this button. It can be useful if the current backend has some troubles to parse your project files.
sv: Detta är projektbakänden som används av projektet: Autotools. En annan bakände kan väljas genom att klicka på denna knapp. Det kan vara användbart om den aktuella bakänden har problem med att tolka dina projektfiler.

source: <gui>Name</gui>
sv: <gui>Namn</gui>

source: The name of your project. It can contains space.
sv: Namnet på ditt projekt. Det kan innehålla blanksteg.

source: This is the project version.
sv: Detta är projektversionen.

source: <gui>Bug report URL</gui>
sv: <gui>URL till felrapport</gui>

source: This is an URL allowing to send bug report, by example an email address or a link to a bug tracker. It is optional.
sv: Detta är en URL som möjliggör insändning av felrapporter, t.ex. en e-postadress eller en länk till ett felrapporteringssystem. Detta är valfritt.

source: <gui>Package name</gui>
sv: <gui>Paketnamn</gui>

source: This is the name of distribution package, it shouldn't contain spaces. It is optional.
sv: Detta är namnet på distributionspaketet, det bör inte innehålla blanksteg. Detta är valfritt.

source: This is the home page of the project. It is optional.
sv: Detta är projektets webbsida. Detta är valfritt.

source: In addition, the root item works as a folder and has all its properties. See <link xref="autotools-project-folder-edit"/> to see the list.
sv: Dessutom fungerar rotobjektet som en mapp och har alla dess egenskaper. Se <link xref="autotools-project-folder-edit"/> för att se listan.

source: Edit autotools target properties.
sv: Redigera autotools-målegenskaper.

source: Edit an Autotools Target
sv: Redigera ett Autotools-mål

source: Here is a list of all target properties used in autotools project. Some of them are not available on all targets.
sv: Här är en lista över alla målegenskaper som används i autotools-projekt. Vissa av dem är inte tillgängliga på alla mål.

source: <gui>Build for check only</gui>
sv: <gui>Bygg endast för kontroll</gui>

source: If checked, this target is not installed and has to be built only when running checks.
sv: Om ikryssat kommer detta mål inte att installeras och kan endast byggas när kontroller körs.

source: The flags to pass to the C compiler when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till C-kompilatorn vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: These flags are passed to every compilation that invokes the C preprocessor. This value overrides the one eventually defined in the parent folder.
sv: Dessa flaggor skickas till varje kompilering som kör C-preprocessorn. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: The flags to pass to the C++ compiler flags when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till C++-kompilatorflaggorna vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: <gui>Do not install</gui>
sv: <gui>Installera inte</gui>

source: If checked, this target is not installed. It can be used for utilities used to build other target or programs used only by developers.
sv: Om ikryssat så installeras inte detta mål. Det kan användas för verktyg som används för att bygga andra mål eller program som används endast av utvecklare.

source: <gui>Do not use prefix</gui>
sv: <gui>Använd inte prefix</gui>

source: If checked, do not add prefix to manual page and executable. Such prefix are used to provide alternative of system tools.
sv: Om ikryssat, lägg inte till prefix till manualsida och körbar fil. Sådana prefix används för att ange alternativ till systemverktygen.

source: The flags to pass to the Fortran 9x compiler when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till Fortran 9x-kompilatorn vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: <gui>Include in distribution</gui>
sv: <gui>Inkludera i distribution</gui>

source: If checked, include the target in the distribution package.
sv: Om ikryssad, inkludera målet i distributionspaketet.

source: <gui>Installation directory</gui>
sv: <gui>Installationskatalog</gui>

source: It defines where the target is installed. It is not directly the directory where the files are installed but the name of one of the standard directory variable (bindir, sbindir, libdir, libexecdir, datadir, pkgdatadir, pkglibexecdir, includedir, mandir, infodir, docdir) or a custom variable defined in the folder properties.
sv: Det definierar var målet installeras. Det är inte exakt den katalog där filerna installeras, utan namnet på en av standardkatalogvariablerna (bindir, sbindir, libdir, libexecdir, datadir, pkgdatadir, pkglibexecdir, includedir, mandir, infodir, docdir) eller en anpassad variabel definierad i katalogegenskaperna.

source: The flags to pass to the Java compiler when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till Java-kompilatorn vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: <gui>Keep target path</gui>
sv: <gui>Behåll målsökvägen</gui>

source: If checked, keep the hierarchy of the project directory when installing files.
sv: Om ikryssat, behåll hierarkin från projektkatalogen vid filinstallation.

source: The flags to pass to the scanner generator Lex or Flex when generating target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till lexikaliseringsprogrammen Lex eller Flex vid generering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: <gui>Libraries</gui>
sv: <gui>Bibliotek</gui>

source: Specify additional libraries used by the target. Useful for adding non package libraries. See <link xref="project-manager-library">Add non-packaged libraries</link> page for more details.
sv: Ange ytterligare bibliotek som används av målet. Användbar för att lägga till icke-paketerade bibliotek. Se sidan <link xref="project-manager-library">Lägg till icke-paketerade bibliotek</link> för mer information.

source: The flags to pass to the linker when linking the target. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till länkaren vid länkning av målet. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: <gui>Manual section</gui>
sv: <gui>Manualavsnitt</gui>
