Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: Click on the right mouse button to make the <gui>project manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Install</gui></guiseq> to install all files in the directory containing the currently selected file or target.
sv: Klicka på höger musknapp för att få <gui>projekthanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Installera</gui></guiseq> för att installera alla filer i katalogen som innehåller den markerade filen eller målet.

source: If you install the program in a system directory, you can have to use <cmd>su</cmd> or <cmd>sudo</cmd> to have enough right. See <link xref="autotools-build-preferences-dialog"/> for more information.
sv: Om du installerar programmet i en systemkatalog måste du använda <cmd>su</cmd> eller <cmd>sudo</cmd> för att få tillräcklig behörighet. Se <link xref="autotools-build-preferences-dialog"/> för vidare information.

source: Autotools build plugin
sv: Autotools-byggnadsinstick

source: This plugin is targeted at autotools projects but as they use make it is useful for other kind of projects using make.
sv: Detta instick är inriktat på autotools-projekt men då de använder make är det även användbart för andra typer av projekt som använder make.

source: Make command used
sv: Make-kommando som används

source: Here is a list of the targets used by the plugin. They are implemented in all autotools projects but you need to implement them if you use a custom makefile.
sv: Här är en lista över mål som används av insticket. De finns alla implementerade i alla autotools-projekt, men du måste implementera dem om du använder en anpassad makefil.

source: <cmd>make <var>object_file_name</var></cmd>
sv: <cmd>make <var>objektfilnamn</var></cmd>

source: Use to compile an source file. The object file name is found by replacing the source file extension with the corresponding object extension.
sv: Använd för att kompilera en källkodsfil. Namnet på objektfilen erhålls genom att ersätta källkodsfiländelsen med motsvarande objektfiländelse.

source: Use to build all targets in a directory.
sv: Använd för att bygga alla mål i en katalog.

source: Use to install all targets in a directory.
sv: Använd för att installera alla mål i en katalog.

source: Use to delete all file built in a directory.
sv: Använd för att ta bort alla filer som byggts i en katalog.

source: Use to build a distribution package, called only in the project directory.
sv: Använd för att bygga ett distributionspaket, anropat endast i projektkatalogen.

source: As make comes with default rules allowing it to compile and link a C program without needing a makefile. You can compile a C program from a single source file without a makefile nor a project.
sv: Make kommer med standardregler som låter det kompilera och länka ett C-program utan att behöva en makefil. Du kan kompilera ett C-program från en enstaka källkodsfil utan en makefil eller ett projekt.

source: Autotools build preferences dialog.
sv: Autotools-bygginställningsdialogruta.

source: Autotools Build Preferences Dialog
sv: Autotools-bygginställningsdialogruta

source: The dialog allows you to set global options for building files.
sv: Dialogrutan låter dig ställa in globala alternativ för byggande av filer.

source: <gui>Run several commands at a time</gui>
sv: <gui>Kör flera kommandon samtidigt</gui>

source: <app>make</app> is able to run several compilations at the same time. It decreases build time when having a multi-core processor but could trigger some issues so this can be enabled or disabled with this check box.
sv: <app>make</app> kan köra flera kompileringar samtidigt. Det minskar byggtiden om du har en processor med flera kärnor, men kan utlösa problem så detta kan aktiveras eller inaktiveras med denna kryssruta.

source: <gui>Continue on errors</gui>
sv: <gui>Fortsätt vid fel</gui>

source: By default <app>make</app> stops as soon as it gets an error, it can be faster to continue and get errors for all files in one step. You have to check this check box to get this behavior.
sv: Som standard stannar <app>make</app> så snart ett fel upptäcks, det kan vara snabbare att fortsätta och få fel för alla filer i ett steg. Det finns en kryssruta för att erhålla detta beteende.

source: <gui>Translate messages</gui>
sv: <gui>Översätt meddelanden</gui>

source: By default errors and warnings message are translated. It has two drawbacks though. In order to recognize errors and warnings the translation of <app>Anjuta</app> and the compiler should perfectly match. Moreover, it is often more difficult to find help on the internet when searching translated messages as they are much less common. Unchecking this check box allows to disable translation.
sv: Som standard översätts fel- och varningsmeddelanden. Detta har dock två nackdelar. För att känna igen fel och varningar måste översättningen av <app>Anjuta</app> och kompilatorn matcha perfekt. Dessutom är det ofta svårare att hitta hjälp på internet när du söker efter översatta meddelanden då de är mycket ovanligare. Om du kryssar ur denna kryssruta så inaktiveras översättning.

source: <gui>Highlight build warnings and errors in editor</gui>
sv: <gui>Färgmarkera byggvarningar och fel i redigeraren</gui>

source: Errors and warnings during the build are displayed and highlighted in the message window. By checking this option, they are highlighted in the editor too.
sv: Fel och varningar under bygget visas och markeras i meddelandefönstret. Genom att kryssa i detta alternativ kommer de även att markeras i redigeraren.

source: <gui>Install as root</gui>
sv: <gui>Installera som root</gui>

source: Installing a program needs to copy files into system directories which are often not writable by users. If this check box is checked, you can choose to use <cmd>sudo</cmd> or <cmd>su</cmd> before installing the files to acquire enough right to do it.
sv: Att installera ett program kräver att filer kopieras in i systemkataloger vilka ofta inte är skrivbara av användare. Om denna kryssruta är ikryssad kan du välja att använda <cmd>sudo</cmd> eller <cmd>su</cmd> före installation av filerna för att erhålla tillräckligt med behörighet för att genomföra den.

source: Used to create or edit a breakpoint
sv: Används för att skapa eller redigera brytpunkter

source: Breakpoint Dialog
sv: Brytpunktsdialogruta

source: <gui>Location</gui>
sv: <gui>Plats</gui>

source: This is the position of the breakpoint. For an existing breakpoint, you cannot change this. You can set a breakpoint at a certain line number, or at the beginning of a function. Use one of the following formats:
sv: Detta är platsen för en brytpunkt. Du kan inte ändra denna för en befintlig brytpunkt. Du kan sätta en brytpunkt på ett specifikt radnummer, eller i början av en funktion. Använd ett av följande format:

source: <var>file_name</var>:<var>line_number</var>
sv: <var>filnamn</var>:<var>radnummer</var>

source: <var>function_name</var>
sv: <var>funktionsnamn</var>

source: <var>file_name</var>:<var>function_name</var>
sv: <var>filnamn</var>:<var>funktionsnamn</var>

source: <gui>Condition</gui>
sv: <gui>Villkor</gui>

source: The break condition is an expression which should evaluate to a boolean value <code>TRUE</code> (1) or <code>FALSE</code> (0). Every time the breakpoint is encountered during your program's execution, the break condition will be evaluated. The debugger will break the execution only if the result of the evaluation is <code>TRUE</code>.
sv: Brytpunktsvillkoret är ett uttryck som bör utvärderas till de booleska värdena <code>TRUE</code> (1) eller <code>FALSE</code> (0). Varje gång brytpunkten påträffas vid programmets körning utvärderas villkoret. Felsökaren kommer endast att avbryta körningen om resultatet av utvärderingen är <code>TRUE</code>.

source: If you leave this field blank the condition is always considered <code>TRUE</code>.
sv: Om du lämnar detta fält blankt kommer uttrycket alltid att anses vara <code>TRUE</code>.

source: <gui>Pass Count</gui>
sv: <gui>Överhopp</gui>

source: The debugger can also skip the breakpoint a certain number of times before breaking. If the pass count is not zero, then the debugger will have to encounter the breakpoint this number of times before breaking.
sv: Felsökaren kan också hoppa över brytpunkten ett visst antal gånger innan den bryter. Om antalet överhoppningar inte är noll måste felsökaren påträffa brytpunkten detta antal gånger innan den bryter.

source: The pass count has a higher priority than the condition. Only when the pass count has been reached will the debugger evaluate the condition if it is present and break the program's execution.
sv: Antalet överhoppningar har högre prioritet än villkor. Endast när antalet överhoppningar har uppnåtts kommer felsökaren att utvärdera villkoret om det är inställt och bryta programmets körning.

source: Managing breakpoints.
sv: Hantera brytpunkter.

source: Breakpoints
sv: Brytpunkter

source: Breakpoints are used to stop the execution of the program at a particular point so that the state of the program can be examined at those locations.
sv: Brytpunkter används för att stoppa körningen av programmet på en specifik punkt så att programmets tillstånd kan utforskas på de platserna.

source: Listing breakpoints
sv: Lista brytpunkter

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Breakpoints</gui></guiseq> to open the <gui>Breakpoint</gui> window.
sv: Från <gui>huvudmenyn</gui> välj <guiseq><gui>Visa</gui> <gui>Brytpunkter</gui></guiseq> för att öppna fönstret <gui>Brytpunkt</gui>.

source: This view has the following columns:
sv: Denna vy har följande kolumner:

source: Location
sv: Plats

source: This is the position of the breakpoint in the source file. When the breakpoint is set by the debugger, you can get additional information such as the function containing the breakpoint.
sv: Detta är brytpunktens plats i källkodsfilen. När brytpunkten är satt av felsökaren kan du få ytterligare information så som funktionen som innehåller brytpunkten.

source: Address
sv: Adress

source: This field is filled with the address of the breakpoint when it is set by the debugger.
sv: Detta fält fylls i med adressen för brytpunkten när den sätts av felsökaren.

source: Type
sv: Typ

source: This always displays <gui>breakpoint</gui>. It will be used in a future release supporting different kinds of breakpoints.
sv: Detta visar alltid <gui>brytpunkt</gui>. Det kommer användas i en framtida version som har stöd för olika typer av brytpunkter.

source: Condition
sv: Villkor

source: This is the breakpoint condition. It is empty if no condition is defined.
sv: Detta är brytpunktsvillkoret. Det är tomt om inget villkor är definierat.

source: Pass count
sv: Överhopp

source: When the debugger is not running, this column displays the pass count of the breakpoint, or zero if it is not defined.
sv: När felsökaren inte kör visar denna kolumn antalet överhoppningar för brytpunkten, eller noll om detta inte är definierat.

source: When the debugger is running, if the pass count is zero, this column displays the number of times this breakpoint has been triggered. If the pass count is not zero, both numbers are displayed. The pass count is the second number.
sv: När felsökaren kör, om antalet överhoppningar är noll, då visar denna kolumn antalet gånger brytpunkten har utlösts. Om antalet överhoppningar inte är noll kommer båda antalen att visas. Antalet överhoppningar är då det andra talet.

source: State
sv: Tillstånd

source: This is the state of the breakpoint. It may be
sv: Detta är brytpunktens tillstånd. Den kan vara

source: Pending:
sv: Väntande:

source: the breakpoint is not set in your program.
sv: brytpunkten har inte ställts in i ditt program.

source: the breakpoint is set (its id number is displayed in parentheses).
sv: brytpunkten har ställts in (dess id-nummer visas i parenteser).

source: Temporary:
sv: Temporär:

source: the breakpoint is set but will be deleted if reached.
sv: brytpunkten har ställts in men kommer att tas bort om den nås.

source: All breakpoints are kept across Anjuta sessions even if they correspond to a non-existing locations, for example in a source file of a shared library not loaded yet. In this case their states are set as pending.
sv: Alla brytpunkter behålls mellan Anjuta-sessioner även om de motsvarar icke-existerande platser, till exempel i en källkodsfil för ett delat bibliotek som inte lästs in än. I detta fall kommer deras tillstånd att sättas till väntade.

source: Setting breakpoints
sv: Ställa in brytpunkter

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Add Breakpoint...</gui></guiseq> or right click in the <gui>Breakpoint</gui> window and select <gui>Add Breakpoint...</gui>.
sv: Från <gui>huvudmeny</gui>, välj <guiseq><gui>Felsök</gui> <gui>Lägg till brytpunkt…</gui></guiseq> eller högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Lägg till brytpunkt…</gui>.

source: Fill in the <gui>Location</gui>, which is the position of the breakpoint, and the other fields if desired. If a file is currently opened in the editor, the <gui>Location</gui> defaults to the current line. See <link xref="debug-breakpoint-dialog"/> for more information.
sv: Fyll i <gui>Plats</gui>, vilket är brytpunktens plats, samt de övriga fälten om så önskas. Om en fil är öppen i redigeraren kommer <gui>Plats</gui> att som standard sättas till den aktuella raden. Se <link xref="debug-breakpoint-dialog"/> för vidare information.

source: Another solution is to use the toggle breakpoint function. If there is no breakpoint on the current line, it will add one. Otherwise, it will remove it.
sv: En annan lösning är att använda funktionen växla brytpunkt. Om det inte finns någon brytpunkt på den aktuella raden kommer en sådan att läggas till. Annars kommer den att tas bort.

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Toggle Breakpoint</gui></guiseq> or right click in the <gui>Editor</gui> window and select <gui>Toggle Breakpoint</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Växla brytpunkt</gui></guiseq> eller högerklicka i fönstret <gui>Redigerare</gui> och välj <gui>Växla brytpunkt</gui>.

source: Editing breakpoints
sv: Redigera brytpunkter

source: You can't change the location of a breakpoint; create a new breakpoint instead. However, you can change the break condition or the pass count. To edit a breakpoint:
sv: Du kan inte ändra platsen för en brytpunkt; skapa en ny brytpunkt istället. Du kan dock ändra brytpunktsvillkoret eller antalet överhoppningar. För att redigera en brytpunkt:

source: Select a breakpoint in the <gui>Breakpoint</gui> window.
sv: Välj en brytpunkt i fönstret <gui>Brytpunkt</gui>.

source: Right click in the <gui>Breakpoint</gui> window and select <gui>Edit Breakpoint...</gui>.
sv: Högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Redigera brytpunkt…</gui>.

source: Change the <gui>Condition</gui> or <gui>Pass Count</gui> fields and click on <gui>OK</gui> when you are done. See <link xref="debug-breakpoint-dialog"/> for more information.
sv: Ändra <gui>Villkor</gui>- eller <gui>Körningar</gui>-fälten och klicka på <gui>OK</gui> när du är klar. Se <link xref="debug-breakpoint-dialog"/> för vidare information.

source: Removing breakpoints
sv: Ta bort brytpunkter

source: You can remove a breakpoint using the toggle breakpoint function described above. However, if you want to remove more than one breakpoint or the breakpoint is in a different file than the one you are editing, you can use the breakpoint window:
sv: Du kan ta bort en brytpunkt med hjälp av växla brytpunkt-funktionen som finns beskriven ovan. Men om du vill ta bort mer än en brytpunkt, eller om brytpunkten är i en annan fil än den du redigerar, så kan du använda brytpunktsfönstret:

source: Right click in the <gui>Breakpoint</gui> window and select <gui>Remove Breakpoint</gui>.
sv: Högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Ta bort brytpunkt</gui>.

source: To remove all breakpoints:
sv: För att ta bort alla brytpunkter:

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Remove All Breakpoints</gui></guiseq> or right-click in the <gui>Breakpoint</gui> window and select <gui>Remove All Breakpoints</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Ta bort alla brytpunkter</gui></guiseq> eller högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Ta bort alla brytpunkter</gui>.

source: Enabling and disabling breakpoints
sv: Aktivera och inaktivera brytpunkter

source: Sometimes you might want to disable a breakpoint temporarily instead of deleting it altogether. To disable or re-enable a breakpoint:
sv: Ibland kan du vilja inaktivera en brytpunkt tillfälligt snarare än att ta bort den helt. För att inaktivera eller åter aktivera en brytpunkt:

source: Click on the <gui>Enable</gui> checkmark in the <gui>Breakpoint</gui> window or right click in the <gui>Breakpoint</gui> window and select <gui>Enable Breakpoint</gui> or <gui>Disable Breakpoint</gui>.
sv: Klicka i kryssrutan <gui>Aktivera</gui> i fönstret <gui>Brytpunkt</gui> eller högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Aktivera brytpunkt</gui> eller <gui>Inaktivera brytpunkt</gui>.

source: You can disable all breakpoints using:
sv: Du kan inaktivera alla brytpunkter genom:

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Disable All Breakpoints</gui></guiseq> or right-click in the <gui>Breakpoint</gui> window and select <gui>Disable All Breakpoints</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Inaktivera alla brytpunkter</gui></guiseq> eller högerklicka i fönstret <gui>Brytpunkt</gui> och välj <gui>Inaktivera alla brytpunkter</gui>.

source: Examine CPU information.
sv: Utforska processorinformation.

source: CPU
sv: Processor

source: View CPU registers
sv: Visa processorregister

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Registers</gui></guiseq> to open the <gui>Register</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Register</gui></guiseq> för att öppna fönstret <gui>Register</gui>.

source: Registers whose values have changed since the last stop are in red. It is possible to change the value of any register by clicking in the value column and entering a new value.
sv: Register vars värden har ändrats sedan senaste stoppet är röda. Det är möjligt att ändra värdet för godtyckligt register genom att klicka på värdeskolumnen och mata in ett nytt värde.

source: View memory
sv: Visa minne

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Memory</gui></guiseq> to open the <gui>Memory</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Minne</gui></guiseq> för att öppna fönstret <gui>Minne</gui>.

source: The first column displays memory addresses in hexadecimal, the second displays memory contents in hexadecimal and the last column shows memory contents in ASCII.
sv: Den första kolumnen visar hexadecimala minnesadresser, den andra visar hexadecimalt minnesinnehåll och den sista kolumnen visar minnesinnehållet uttryckt i ASCII.

source: The addressing space of even a 32-bit microprocessor is very large (4 gigabytes), so it is very difficult to go to a particular address with the scrollbar. But you can click the right mouse button and select <gui>Go to address</gui> to get a small edit box where you can enter an address in hexadecimal.
sv: Adressrymden även för en mikroprocessor med 32 bitar är väldigt stor (4 gigabyte), så det är väldigt svårt att gå till en specifik adress med rullningslisten. Men du kan klicka med höger musknapp och välja <gui>Gå till adress</gui> för att visa en liten redigeringsruta där du kan mata in en hexadecimal adress.

source: View Disassembly
sv: Visa disassemblering

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Disassembly</gui></guiseq> to open the <gui>Disassembly</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Disassemblera</gui></guiseq> för att öppna fönstret <gui>Disassemblera</gui>.

source: The first column displays addresses in hexadecimal. In the second column, you can have a label starting at the beginning of the line and ending with a colon or a assembly-language instruction indented by 4 space characters.
sv: Den första kolumnen visar hexadecimala adresser. I den andra kolumnen kan du ha en etikett som inleder vid början av raden och slutar med ett kolon eller en assemblerinstruktion indenterad med 4 blanksteg.

source: The position in the disassembly window will be changed to the program counter value when the program is stopped.
sv: Platsen för disassembleringsfönstret kommer att ändras till programräknaren när programmet stoppas.

source: Use custom debugger command.
sv: Använd ett anpassat felsökningskommando.

source: Custom command
sv: Anpassat kommando

source: You can send a custom command to the debugger like this:
sv: Du kan skicka ett anpassat kommando till felsökaren så här:

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Debugger Command</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Felsökningskommando</gui></guiseq>.

source: Enter your command.
sv: Ange ditt kommando.

source: The output of the command is displayed in the message window used by the debugger.
sv: Utdata för programmet visas i meddelandefönstret som används av felsökaren.

source: The command is sent directly to the debugger without performing any checks. For example, if you set a breakpoint like this, it will not appear in the <gui>Breakpoint</gui> window. It is better to avoid using this command unless you know exactly what you are doing.
sv: Kommandot skickas direkt till felsökaren utan att utföra några kontroller. Om du till exempel sätter en brytpunkt på detta sätt kommer den inte att visas i fönstret <gui>Brytpunkt</gui>. Det är bättre att undvika att använda detta kommando om du inte vet exakt vad du gör.

source: Examine program Data.
sv: Utforska programdata.

source: Examine data
sv: Utforska data

source: Control program execution.
sv: Styr programkörning.

source: Control execution
sv: Styr körning

source: Evaluate expressions and modify variables.
sv: Evaluera uttryck och ändra variabler.

source: Examine expressions
sv: Utforska uttryck

source: Inspect an expression and modify a variable
sv: Inspektera ett uttryck och ändra en variabel

source: While you are debugging a program, you can find out the value of an expression or variable while the program is paused. It is also sometimes useful to change the value of a variable.
sv: Medan du felsöker ett program kan du ta reda på värdet av ett uttryck eller en variabel medan programmet är pausat. Det är ibland också användbart att ändra värdet på en variabel.

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Inspect/Evaluate...</gui></guiseq> or right click in the <gui>Editor</gui> window and select <gui>Inspect/Evaluate...</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Inspektera/Evaluera…</gui></guiseq> eller högerklicka i fönstret <gui>Redigerare</gui> och välj <gui>Inspektera/Evaluera…</gui>.

source: If the expression is a variable name, you can change its value by clicking on the <gui>Value</gui> column and entering a new value.
sv: Om uttrycket är ett variabelnamn kan du ändra dess värde genom att klicka i <gui>Värde</gui>-kolumnen och mata in ett nytt värde.

source: Examine additional program information.
sv: Utforska ytterligare programinformation.

source: Miscellaneous information
sv: Diverse information
