Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: Specify the section of the manual where to add man page. Valid section name are the digits ‘0’ through ‘9’, and the letters ‘l’ and ‘n’.
sv: Ange manualavsnittet där manualsidan ska läggas till. Giltiga avsnittsnamn är siffrorna ”0” till ”9”, samt bokstäverna ”l” och ”n”.

source: The flags to pass to the Objective C compiler when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till Objective C-kompilatorn vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: The flags to pass to the Vala compiler when compiling target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till Vala-kompilatorn vid kompilering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: The flags to pass to the parser generator Bison or Yacc when generating target source files. This value overrides the one eventually defined in the parent folder.
sv: Flaggorna att skicka till parsergeneratorerna Bison eller Yacc vid generering av målkällkodsfiler. Detta värde åsidosätter värdet som eventuellt definierats i föräldrakatalogen.

source: Autotools target type.
sv: Autotools-måltyp.

source: Autotools project type
sv: Autotools-projekttyp

source: There are different types of target available.
sv: Det finns olika typer av mål tillgängliga.

source: Shared Library (Libtool)
sv: Delat bibliotek (Libtool)

source: It represents a library shared by several programs which is linked at run time. It is the most common kind of libraries on Linux. It is called dynamic link library on Windows.
sv: Det representerar ett bibliotek, som delas av flera program, vilket länkas i körtid. Det är den vanligaste typen av bibliotek på Linux. Det kallas för dynamiskt länkbibliotek (DLL) på Windows.

source: It uses the Libtool package. Its name must start with 'lib' and has the '.la' extension.
sv: Det använder Libtool-paketet. Dess namn måste starta med ”lib” och ha ändelsen ”.la”.

source: Module (Libtool)
sv: Modul (Libtool)

source: It represents a library, often named a plugin, linked at run time explicitly by the program itself. It is used to only load the code corresponding to the used features.
sv: Det representerar ett bibliotek, ofta kallat instick, som explicit länkas vid körtid av programmet själv. Det används endast för att läsa in kod som motsvarar den använda funktionen.

source: It uses the Libtool package. Its name does not need the 'lib' prefix but must have the '.la' extension.
sv: Det använder Libtool-paketet. Dess namn behöver inte ha ”lib”-prefixet men måste ha ändelsen ”.la”.

source: Static Library (Libtool)
sv: Statiskt bibliotek (Libtool)

source: It represents a library linked with the program at compile time. Only the function used are kept inside the generated executable.
sv: Det representerar ett bibliotek som länkas med programmet vid kompileringstid. Endast de använda funktionerna sparas inuti den genererade körbara filen.

source: It uses the Libtool package. Its name must start with 'lib' and has the '.a' extension.
sv: Det använder Libtool-paketet. Dess namn måste starta med ”lib” och ha ändelsen ”.a”.

source: It represents compiled program by example from C source files. All children represent the source files compiled to generate the program.
sv: Det representerar ett kompilerat program till exempel från C-källkodsfiler. Alla barn representerar källkodsfiler som kompileras för att generera programmet.

source: Python module
sv: Python-modul

source: It represents a program written in Python.
sv: Det representerar ett program skrivet i Python.

source: Java module
sv: Java-modul

source: It represents a program written in Java.
sv: Det representerar ett program skrivet i Java.

source: LISP module
sv: Lisp-modul

source: It represents a program written in LISP.
sv: Det representerar ett program skrivet i Lisp.

source: Header files
sv: Headerfiler

source: This target allows you to group header files and define where they have to be installed.
sv: Detta mål låter dig gruppera headerfiler och definiera var de ska installeras.

source: Man documentation
sv: Man-dokumentation

source: It groups man pages needed by the project.
sv: Det grupperar manualsidor som behövs av projektet.

source: Info documentation
sv: Info-dokumentation

source: It groups info page needed by the project.
sv: Det grupperar infosidor som behövs av projektet.

source: Miscellaneous Data
sv: Diverse data

source: It groups data files which needed by the project like pictures, ui description, settings files...
sv: Det grupperar datafiler som behövs av projektet, så som bilder, gränssnittsbeskrivningar, inställningsfiler…

source: Script
sv: Skript

source: It represents program those are scripts. Those scripts are only installed in the specified directory. If scripts are generated additional rules are needed.
sv: Det representerar program som är skript. Dessa skript installeras endast i den angivna katalogen. Om skripten är genererade behövs ytterligare regler.

source: Build targets or project.
sv: Bygg mål eller projekt.

source: Build targets
sv: Bygg mål

source: A target is a file created from source files. Typically, it is a program or a library, but it could also be documentation if the documentation needs processing, for example.
sv: Ett mål är en fil som skapas från källkodsfiler. Detta är typiskt ett program eller ett bibliotek, men kan också vara dokumentation om dokumentationen till exempel behöver bearbetas.

source: The build command compiles all needed source files, and possibly links them with some other files, like libraries, in order to create the target. If some source files are already compiled and haven't been modified, they are not be recompiled, in order to save time. There are several ways to trigger a build.
sv: Byggkommandot kompilerar alla källkodsfiler som behövs och länkar dem eventuellt med några andra filer, så som bibliotek, för att skapa målet. Om några källkodsfiler redan är kompilerade och inte har modifierats kommer de, för att spara tid, inte att kompileras om. Det finns flera sätt på vilket ett bygge kan utlösas.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Build</gui></guiseq> or press <key>F7</key> to build all targets in the same directory as the currently opened file.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Bygg</gui></guiseq> eller tryck på <key>F7</key> för att bygga alla mål i samma katalog som den öppnade filen.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Build Project</gui></guiseq> or press <keyseq><key>Shift</key><key>F7</key></keyseq> to build the complete project. All subdirectories are built recursively.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygg</gui> <gui>Bygg projekt</gui></guiseq> eller tryck på <keyseq><key>Skift</key><key>F7</key></keyseq> för att bygga hela projektet. Alla underkataloger byggs rekursivt.

source: From the <gui>file manager pane</gui>, select a file or a directory.
sv: Från <gui>filhanterarpanelen</gui>, välj en fil eller en katalog.

source: Click on the right mouse button to make the <gui>file manager context menu</gui> appear and select <guiseq><gui>Build</gui><gui>Build</gui></guiseq> to build all targets in the directory currently selected or the parent directory of the currently selected file.
sv: Klicka med höger musknapp för att få <gui>filhanterarsnabbvalsmenyn</gui> att dyka upp och välj <guiseq><gui>Bygge</gui><gui>Bygg</gui></guiseq> för att bygga alla mål i den markerade katalogen eller föräldrakatalogen för den markerade filen.

source: From the <gui>project manager pane</gui>, select a source file or a target.
sv: Från <gui>projekthanterarpanelen</gui> välj en källkodsfil eller ett mål.

source: Click on the right mouse button to make the <gui>project manager context menu</gui> appear and select <guiseq><gui>Build</gui><gui>Build</gui></guiseq> to build all targets in the directory containing the currently selected file or target.
sv: Klicka med höger musknapp för att få <gui>projekthanterarsnabbvalsmenyn</gui> att dyka upp och välj <guiseq><gui>Bygge</gui><gui>Bygg</gui></guiseq> för att bygga alla mål i katalogen som innehåller den markerade filen eller målet.

source: Remove built files.
sv: Ta bort byggda filer.

source: Clean targets
sv: Töm mål

source: It can be useful to delete all files created by the build process. For example, if all dependencies are not taken into account and a modified file does not trigger a recompiling as it should, deleting all files will fix this. There are several ways to do this
sv: Det kan vara användbart att ta bort alla filer som skapats av byggprocessen. Om alla beroenden till exempel inte tagits i beaktande och en modifierad fil inte utlöser en omkompilering som den borde, så kommer borttagning av alla filer att fixa detta. Det finns flera sätt att göra det på

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Clean</gui></guiseq> to delete all files built in the same directory as the current edited file.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Töm</gui></guiseq> för att ta bort alla filer som byggts i samma katalog som den redigerade filen.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Clean Project</gui></guiseq> to delete all project built files,
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Töm projektet</gui></guiseq> för att ta bort alla filer byggda i projektet.

source: Click on the right mouse button to make the <gui>file manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Clean</gui></guiseq> to delete all files built in the directory currently selected or the parent directory of the currently selected file.
sv: Klicka på höger musknapp för att få <gui>filhanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Töm</gui></guiseq> för att ta bort alla byggda filer i den markerade katalogen eller föräldrakatalogen för den markerade filen.

source: Click on the right mouse button to make the <gui>project manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Clean</gui></guiseq> to delete all built files in the directory containing the currently selected file or target.
sv: Klicka på höger musknapp för att få <gui>projekthanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Töm</gui></guiseq> för att ta bort alla byggda filer i katalogen som innehåller den markerade filen eller målet.

source: Compile files.
sv: Kompilera filer.

source: Compile files
sv: Kompilera filer

source: Most programming languages allow you to compile an individual source file. It reads the file, checks for errors and convert into an intermediate object file. Most errors happens in this step, so it is useful to compile a file after modifying it to check for errors. There are several ways to do it.
sv: De flesta programmeringsspråk låter dig kompilera en individuell källkodsfil. Det läser filen, letar efter fel och konverterar den till en temporär objektfil. De flesta fel händer i detta steg, så det är användbart att kompilera en fil efter att ha modifierat den för att leta efter fel. Det finns flera sätt att göra det på.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Compile</gui></guiseq> or press <key>F9</key> to compile the current edited file.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Kompilera</gui></guiseq> eller tryck på <key>F9</key> för att kompilera den redigerade filen.

source: From the <gui>file manager pane</gui>, select a file.
sv: Från <gui>filhanterarpanelen</gui>, välj en fil.

source: Click on the right mouse button to make the <gui>file manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Compile</gui></guiseq> to compile the file currently selected in the <gui>file manager pane</gui>.
sv: Klicka på höger musknapp för att få <gui>filhanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Kompilera</gui></guiseq> för att kompilera filen markerad i <gui>filhanterarpanelen</gui>.

source: From the <gui>project manager pane</gui>, select a source file.
sv: Från <gui>projekthanterarpanelen</gui>, välj en källkodsfil.

source: Click on the right mouse button to make the <gui>project manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Compile</gui></guiseq> to compile the file currently selected in the <gui>project manager pane</gui>.
sv: Klicka på höger musknapp för att få <gui>projekthanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Kompilera</gui></guiseq> att kompilera filen markerad i <gui>projekthanterarpanelen</gui>.

source: You do not need to save your file before compiling it, it will be done automatically by <app>Anjuta</app> if needed.
sv: Du behöver inte spara din fil före du kompilerar den, det görs automatiskt av <app>Anjuta</app> om det behövs.

source: Autotools configure dialog
sv: Autotools-konfigurationsdialog

source: Autotools Configure Dialog
sv: Autotools-konfigurationsdialog

source: The <gui>Configure</gui> dialog allows you to set the following options and configure the project.
sv: <gui>Konfigurations</gui>-dialogrutan låter dig ställa in följande alternativ och konfigurerar projektet.

source: <gui>Regenerate Project</gui>
sv: <gui>Generera om projektet</gui>

source: If checked, the project will be completely regenerated, else only the configure step is done. <app>Anjuta</app> automatically checks this check box when needed so you can leave it in its current state.
sv: Om ikryssat kommer projektet att helt genereras om, annars kommer konfigurationssteget att utföras. <app>Anjuta</app> kryssar automatiskt i denna kryssruta när det behövs så du kan lämna den i dess aktuella tillstånd.

source: <gui>Configuration</gui>
sv: <gui>Konfiguration</gui>

source: You can have several configurations having their own options and build directory, this text box allows to name them. Typically you have already defined a Default configuration, a Debug configuration making programs easier to debug (keeping intermediate variables and code ordering) and an Optimized configuration generating faster programs but increasing build time. You can define additional custom configurations.
sv: Du kan har flera konfigurationer som var och en har sina egna alternativ och byggkatalog, denna textruta låter dig namnge dem. Vanligtvis har du redan några konfigurationer definierade: en standardkonfiguration, en felsökningskonfiguration som gör program enklare att felsöka (behåller mellanliggande variabler och kodordning) samt en optimerad konfiguration som genererar snabbare program men förlänger byggtiden. Du kan definiera ytterligare anpassade konfigurationer.

source: <gui>Build Directory</gui>
sv: <gui>Byggkatalog</gui>

source: Select here the build directory. It can be the project directory or a subdirectory. This is particularly useful when switching between different configurations to avoid rebuilding the whole project.
sv: Välj byggkatalogen här. Det kan vara projektkatalogen eller en underkatalog. Detta är särskilt användbart när du växlar mellan olika konfigurationer för att undvika att bygga om hela projektet.

source: With autotools, you cannot have one configuration using a different directory if you already have one configuration using the project directory. You need to remove it first.
sv: Med autotools kan du inte låta en konfiguration använda en annan katalog om du redan låtit en konfiguration använda projektkatalogen. Du måste ta bort den först.

source: Some autotools project cannot be built outside the project directory. You can still use different configurations but they all have to use the project directory and everything will be recompiled on each change of the configuration.
sv: Vissa autotools-projekt kan inte byggas utanför projektkatalogen. Du kan fortfarande använda olika konfigurationer, men de måste alla använda projektkatalogen och allting kommer att byggas om vid varje ändring av konfigurationen.

source: <gui>Configure Options</gui>
sv: <gui>Konfigurationsalternativ</gui>

source: This text box list all command line arguments used by the configure step. All arguments are separated by spaces and must be quoted if they contains a space. Each configuration fills this text box with default values that you can modify.
sv: Denna textruta listar alla kommandoradsargument som används av konfigurationssteget. Alla argument är separerade av blanksteg och måste citeras om de innehåller ett blanksteg. Varje konfiguration fyller i denna textruta med standardvärden som du kan modifiera.

source: Each autotools project supports a common list of arguments but can have specify arguments. You can have a list of all accepted arguments by running <cmd>configure --help</cmd> on the command line. You need to have configured your project at least one time to have the <cmd>configure</cmd> script.
sv: Varje autotools-projekt har stöd för en lista över gemensamma argument, men kan ha specifika argument. Du kan erhålla en lista över alla accepterade argument genom att köra <cmd>configure --help</cmd> på kommandoraden. Du måste ha konfigurerat ditt projekt åtminstone en gång för att <cmd>configure</cmd>-skriptet ska finnas.

source: Configure an autotools project and manage configurations.
sv: Konfigurera ett autotools-projekt och hantera konfigurationer.

source: Configure a project
sv: Konfigurera ett projekt

source: Before compiling and building files, an autotools project has to be configured. This step is needed to set global options, to check that all required libraries and programs are installed on your system and to generate appropriate build scripts.
sv: Innan du kompilerar och bygger filer måste ett autotools-projekt konfigureras. Detta steg behövs för att ställa in globala alternativ, kontrollera att bibliotek och program som krävs är installerade på ditt system och för att generera lämpliga byggskript.

source: Configure the project
sv: Konfigurera projektet

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Configure Project...</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Konfigurera projekt…</gui></guiseq>.

source: Keep the default configuration, select a new configuration or create a new one. You can inspect and modify all configuration options. See <link xref="autotools-build-configure-dialog"/> for more information.
sv: Behåll standardkonfigurationen, välj en ny konfiguration eller skapa en ny. Du kan granska och modifiera alla konfigurationsalternativ. Se <link xref="autotools-build-configure-dialog"/> för mer information.

source: Click on <gui>Execute</gui> to configure the project.
sv: Klicka på <gui>Kör</gui> för att konfigurera projektet.

source: The configuration could fail if some libraries or programs are not installed or do not have the right version. The error message tell you what is missing.
sv: Konfigurationen kan misslyckas om några bibliotek eller program inte finns installerade eller inte är rätt version. Felmeddelandet kommer berätta vad som saknas.

source: Change the configuration
sv: Ändra konfigurationen

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Select Configuration</gui><gui>Another configuration</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Välj konfiguration</gui><gui>Annan konfiguration</gui></guiseq>.

source: If the project has not been already configured, it will be automatically configured before building any file.
sv: Om projektet inte redan har konfigurerats kommer det att konfigureras automatiskt innan någon fil byggs.

source: Remove configuration
sv: Ta bort konfiguration

source: It is a like cleaning the project but it removes even more files. You need to re-configure your project to build it afterward.
sv: Det är som att tömma projektet, men det tar bort ännu fler filer. Du måste omkonfigurera ditt projekt för att bygga det igen efteråt.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Remove Configuration</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Ta bort konfiguration</gui></guiseq>.

source: Create a distribution package.
sv: Skapa ett distributionspaket.

source: Create a distribution package
sv: Skapa ett distributionspaket

source: The standard way to distribute a autotools project is as a compressed tar archive containing all source files. The user will have to decompress it, then compile and install it on his system using the command sequence <cmd>configure</cmd>, <cmd>make</cmd> and <cmd>make install</cmd>.
sv: Standardsättet på vilket ett autotools-projekt distribueras är som ett komprimerat tar-arkiv som innehåller alla källkodsfiler. Användaren måste dekomprimera det, sedan kompilera och installera det på sitt system genom kommandosekvensen <cmd>configure</cmd>, <cmd>make</cmd> och <cmd>make install</cmd>.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Build Tarball</gui></guiseq> to create a source distribution package.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Bygg tar-arkiv</gui></guiseq> för att skapa ett källdistributionspaket.

source: Install targets or project.
sv: Installera mål eller projekt.

source: Install targets
sv: Installera mål

source: Unless your project is very simple, it needs some data files like user interface description files. These files are typically copied in standard directories and read from there. It means that you cannot run your program from the build directory. You need to install it in order to copy all these files in the final place, by example in a subdirectory of <file>/usr/local</file>.
sv: Om ditt projekt inte är väldigt enkelt kommer det att behöva några datafiler, så som beskrivningsfiler för användargränssnittet. Dessa filer kopieras vanligen in i standardkataloger och läses därifrån. Det innebär att du inte kan köra ditt program från byggkatalogen. Du måste installera det för att kopiera alla dessa filer till deras slutgiltiga plats, till exempel i en underkatalog till <file>/usr/local</file>.

source: There are several possibilities to install targets or a project.
sv: Det finns flera möjligheter att installera mål eller ett projekt.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Install</gui></guiseq> to install all files in the same directory as the current edited file.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Installera</gui></guiseq> för att installera alla filer i samma katalog som den redigerade filen.

source: From the <gui>main menu</gui>, select <guiseq><gui>Build</gui> <gui>Install Project</gui></guiseq> to install all project files,
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Bygge</gui> <gui>Installera projekt</gui></guiseq> för att installera alla projektfiler.

source: Click on the right mouse button to make the <gui>file manager context menu</gui> appears and select <guiseq><gui>Build</gui><gui>Install</gui></guiseq> to install all files in the directory currently selected or the parent directory of the currently selected file.
sv: Klicka på höger musknapp för att få <gui>filhanterarsnabbvalsmenyn</gui> att visas och välj <guiseq><gui>Bygge</gui><gui>Installera</gui></guiseq> för att installera alla filer i den markerade katalogen eller föräldrakatalogen för den markerade filen.
