Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: If the header files are installed in a standard location (<file>/usr/include</file>) you don't have to set this. If not, you need to add <input>-I<var>include_path</var></input> in the <gui>C preprocessor flags</gui> property if you are using <app>gcc</app> as your compiler. You can add several paths separated with spaces. These options will be used for all targets inside this directory.
sv: Om headerfilerna finns installerade på en standardplats (<file>/usr/include</file>) behöver du inte ställa in detta. Om inte måste du lägga till <input>-I<var>inklusionssökväg</var></input> i egenskapen <gui>Flaggor för C-preprocessor</gui> om du använder <app>gcc</app> som din kompilator. Du kan lägga till flera sökvägar separerade med blanksteg. Dessa alternativ kommer att användas för alla mål i denna katalog.

source: You might have to expand the <gui>More options</gui> button to see this. Click on the <gui>Apply</gui> button when you are done.
sv: Du kanske måste expandera knappen <gui>Fler inställningar</gui> för att se detta. Klicka på knappen <gui>Verkställ</gui> när du är klar.

source: Next, you need to add the library to a target. Select the target where you want to add the library in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Properties</gui>.
sv: Därefter måste du lägga till biblioteket till målet. Välj målet där du vill lägga till biblioteket i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Egenskaper</gui>.

source: You need to set the <gui>Linker flags</gui> property, adding <input>-l<var>library_name</var></input> if your compiler is <app>gcc</app>. <var>library_name</var> is the name of the library file without the <file>lib</file> prefix and without the <file>.a</file> or <file>.so</file> extension.
sv: Du måste ställa in egenskapen <gui>Flaggor för länkare</gui> genom att lägga till <input>-l<var>biblioteksnamn</var></input> om din kompilator är <app>gcc</app>. <var>biblioteksnamn</var> är namnet på biblioteksfilen utan prefixet <file>lib</file> och utan <file>.a</file>- eller <file>.so</file>-filändelsen.

source: If the library is in not in a standard directory, <app>gcc</app> can look in additional directories with the option <input>-L<var>library_path</var></input>.
sv: Om biblioteket inte finns i en standardkatalog kan <app>gcc</app> leta i ytterligare kataloger med flaggan <input>-L<var>bibliotekssökväg</var></input>.

source: Add or remove libraries to project targets.
sv: Lägg till eller ta bort bibliotek från projektmål.

source: Manage Libraries
sv: Hantera bibliotek

source: Remove a custom library from a target.
sv: Ta bort ett anpassat bibliotek från ett mål.

source: Remove a Custom Library
sv: Ta bort ett anpassat bibliotek

source: Select the target that has the library you want to remove in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Properties</gui>.
sv: Välj målet som har biblioteket du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Egenskaper</gui>.

source: Remove the library from the <gui>C preprocessor flags</gui> and <gui>Linker flags</gui> properties. Click on the <gui>Apply</gui> button to write the changes to the project files.
sv: Ta bort biblioteket från egenskaperna <gui>Flaggor för C-preprocessor</gui> och <gui>Flaggor för länkare</gui>. Klicka på knappen <gui>Verkställ</gui> för att skriva ändringarna till projektfilerna.

source: Add a set of libraries to a target.
sv: Lägg till en uppsättning bibliotek till ett mål.

source: Add packaged libraries
sv: Lägg till paketerade bibliotek

source: On Linux, most libraries are distributed with additional data stored in a <app>pkg-config</app> file. This file contains information like the other libraries needed, the C compiler and the linker flags needed to use that library. This file, the header files and the library files themselves is called a package.
sv: I Linux distribueras de flesta bibliotek med ytterligare data lagrat i <app>pkg-config</app>. Denna fil innehåller information så som andra bibliotek som behövs, flaggorna för C-kompilatorn och länkaren som behövs för att använda biblioteket. Denna fil, headerfilerna och biblioteksfilerna i sig kallas för ett paket.

source: Select the program where you want to add the new library in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Add Library</gui>.
sv: Välj programmet där du vill lägga till det nya biblioteket i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Lägg till bibliotek</gui>.

source: Or from the <gui>main menu</gui>, select <guiseq><gui>Project</gui> <gui>Add Library...</gui></guiseq>.
sv: Eller från <gui>huvudmenyn</gui>, välj <guiseq><gui>Projekt</gui><gui>Lägg till bibliotek…</gui></guiseq>.

source: You need to select the target where you want to add the library in the <gui>target button</gui> above.
sv: Du måste välja målet där du vill lägga till biblioteket i <gui>målknappen</gui> ovan.

source: A library cannot be added directly to a target. You can add only a module displayed in the <gui>module view</gui> below. If you select a library inside a module, the parent module will be added.
sv: Ett bibliotek kan inte läggas till direkt till ett mål. Du kan endast lägga till en modul som visas i <gui>modulvyn</gui> nedan. Om du väljer ett bibliotek inuti en modul kommer föräldramodulen att läggas till.

source: If the library you want is not displayed in the <gui>module view</gui>, you need to add it as a module first. Click on the button <gui>New Library</gui> and follow the explanation <link xref="project-manager-module-new">here</link>.
sv: Om biblioteket du vill ha inte visas i <gui>modulvyn</gui> måste du först lägga till det som en modul. Klicka på knappen <gui>Nytt bibliotek</gui> och följ förklaringen <link xref="project-manager-module-new">här</link>.

source: After creating a new module, you have to wait a few seconds while the project files are reloaded to see the new module in the list.
sv: Efter att du skapa en ny modul måste du vänta ett par sekunder medan projektfilerna läses in på nytt för att se modulen i listan.

source: When you are done, click on the <gui>Add</gui> button to add the selected module to the target.
sv: När du är klar, klicka på knappen <gui>Lägg till</gui> för att lägga till den valda modulen till målet.

source: Groups libraries in a module.
sv: Grupperar bibliotek i en modul.

source: Add a Module
sv: Lägg till en modul

source: Packages cannot be added directly to a program but have to be grouped in a module.
sv: Paket kan inte läggas till direkt till ett program utan måste grupperas i en modul.

source: Select a program in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear, and select <gui>Add Library</gui>.
sv: Välj ett program i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Lägg till bibliotek</gui>.

source: On the <gui>Add Library</gui> dialog, click on the <gui>New Library</gui> button.
sv: I dialogrutan <gui>Lägg till bibliotek</gui>, klicka på knappen <gui>Nytt bibliotek</gui>.

source: You will get a list of all the packaged libraries installed on your system. You can check one or more libraries.
sv: Du kommer att få en lista över alla paketerade bibliotek installerade på ditt system. Du kan kryssa för ett eller flera bibliotek.

source: If the library you want does not appear here:
sv: Om biblioteket du vill ha inte visas här:

source: Perhaps it is not installed on your system. Launch the application you use to install new programs and search for the library name. The package you need often has a "dev" or "devel" suffix and should include header files and a <app>pkg-config</app> file with a <file>.pc</file> extension.
sv: Kanske finns det inte finns installerat på ditt system. Starta programmet du använder för att installera nya program och sök efter biblioteksnamnet. Paketet du behöver har ofta ett ”dev”- eller ”devel”-suffix och bör inkludera headerfiler samt en <app>pkg-config</app>-fil med en <file>.pc</file>-filändelse.

source: It could be that the library is not packaged, it is often the case for libraries not developed on Linux. See the chapter <link xref="project-manager-library-add"/> explaining how to use them.
sv: Det kan vara fallet att biblioteket inte är paketerat, det är ofta faller för bibliotek som inte utvecklas på Linux. Se kapitlet <link xref="project-manager-library-add"/> som förklarar hur man använder dem.

source: After selecting one library, a module name will be automatically generated but you can change it. You can select an already existing module name to add a new library to it and to all targets already using it.
sv: Efter att du valt ett bibliotek kommer ett modulnamn att genereras automatiskt, men du kan ändra det. Du kan välja ett redan befintligt modulnamn för att lägga till ett nytt bibliotek till det och till alla mål som redan använder det.

source: When you are done, click on the <gui>Add</gui> button to create the new module with the selected libraries. You need to add a new module to at least one target to really use it.
sv: När du är klar, klicka på knappen <gui>Lägg till</gui> för att skapa den nya modulen med de valda biblioteken. Du måste lägga till en ny modul till åtminstone ett mål för att verkligen använda det.

source: Remove a set of libraries from a target.
sv: Ta bort en uppsättning bibliotek från ett mål.

source: Remove a Module
sv: Ta bort en modul

source: Select the library you want to remove in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear, and select <gui>Remove</gui>.
sv: Välj biblioteket du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Ta bort</gui>.

source: Confirm the removal. This library will be removed from the target.
sv: Bekräfta borttagningen. Detta bibliotek kommer att tas bort från målet.

source: Remove a library from a module.
sv: Ta bort ett bibliotek från en modul.

source: Remove a Package
sv: Ta bort ett paket

source: Select the package you want to remove in the <gui>project view</gui> , click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Remove</gui>.
sv: Välj paketet du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Ta bort</gui>.

source: Confirm the removal. This package will be removed from the project file.
sv: Bekräfta borttagningen. Detta paket kommer att tas bort från projektfilen.

source: Project manager.
sv: Projekthanterare.

source: Project manager plugin
sv: Projekthanterarinstick

source: <app>Anjuta</app> supports several already existing project formats through plugin backends. The main one is the autotools format commonly used on Linux.
sv: <app>Anjuta</app> har stöd för flera befintliga projektformat via bakändesinstick. Huvudformatet är autotools-formatet som ofta används i Linux.

source: The project backend to use is chosen when creating or importing a new project in <app>Anjuta</app>. It is displayed in the properties of the project root node and can be changed at any time.
sv: Projektbakänden som ska användas väljs när du skapar eller importerar ett nytt projekt i <app>Anjuta</app>. Den visas bland egenskaperna för projektets rotnod och kan ändras när som helst.

source: Whatever the underlying backend, the graphical interface is the same but some functions might be disabled.
sv: Oavsett den underliggande bakänden är det grafiska gränssnittet detsamma, men vissa funktioner kan vara inaktiverade.

source: Project Backend Plugin
sv: Bakändesinstick för projekt

source: Edit project properties.
sv: Redigera projektegenskaper.

source: Edit a Project
sv: Redigera ett projekt

source: Add existing files to a project.
sv: Lägg till befintliga filer till ett projekt.

source: Add Files
sv: Lägg till filer

source: Select the target where you want to add the new source files in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Add Source File</gui>.
sv: Välj målet där du vill lägga till den nya källkodsfilen i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Lägg till källkodsfil</gui>.

source: Or from the <gui>main menu</gui>, select <guiseq><gui>Project</gui> <gui>Add Source File...</gui></guiseq>
sv: Eller från <gui>huvudmenyn</gui>, välj <guiseq><gui>Projekt</gui><gui>Lägg till källkodsfil…</gui></guiseq>

source: You can select another target in the top <gui>target chooser button</gui>.
sv: Du kan välja ett annat mål längst upp med <gui>målväljarknappen</gui>.

source: In the file chooser below, select the files you want to add. Then click on the <gui>Add</gui> button to add those files to your project. You can select several files at the same time keeping <key>Ctrl</key> key pressed or using the <key>Shift</key> to select a range of files.
sv: I filväljaren nedan, välj filerna du vill lägga till. Klicka sedan på knappen <gui>Lägg till</gui> för att lägga till de filerna till ditt projekt. Du kan markera flera filer samtidigt genom att hålla nere <key>Ctrl</key>-tangenten eller ett intervall av filer med <key>Skift</key>-tangenten.

source: You can add files in sub-directories of the project. Most project formats require the files to be under the project directory. Added source files outside the project directory are automatically copied inside to fulfill this requirement.
sv: Du kan lägga till filer i projektets underkataloger. De flesta projektformat kräver att filerna ska vara under projektkatalogen. Källkodsfiler utanför projektkatalogen som läggs till kopieras automatiskt in i projektkatalogen för att uppfylla detta krav.

source: Add or remove files from a project.
sv: Lägg till eller ta bort filer från ett projekt.

source: Manage Files
sv: Hantera filer

source: Remove files from a project.
sv: Ta bort filer från ett projekt.

source: Remove Files
sv: Ta bort filer

source: Select the file you want to remove in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Remove</gui>.
sv: Välj filen du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Ta bort</gui>.

source: Confirm the removal. The file will only be removed from the project, not from your disk.
sv: Bekräfta borttagningen. Filen kommer endast att tas bort från projektet, inte från din disk.

source: You can select several files at the same time by keeping the <key>Ctrl</key> key pressed or select a range using the <key>Shift</key> key.
sv: Du kan välja flera filer på samma gång genom att hålla nere <key>Ctrl</key>-tangenten eller välja ett intervall med <key>Skift</key>-tangenten.

source: Add a target to a project.
sv: Lägg till ett mål till ett projekt.

source: Add a Target
sv: Lägg till ett mål

source: A target groups files together and defines their use. It is used to represent a program, with all its source files as its children or only group data files those should be installed at the same place.
sv: Ett mål grupperar flera filer tillsammans och definierar deras användning. Det används för att representera ett program med alla dess källkodsfiler som barn eller endast gruppera datafiler som ska installeras på samma plats.

source: Select the directory where you want to add the new target in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>New Target</gui>.
sv: Välj katalogen där du vill lägga till det nya målet i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Nytt mål</gui>.

source: Or from the <gui>main menu</gui>, select <guiseq><gui>Project</gui> <gui>New Target...</gui></guiseq>.
sv: Eller från <gui>huvudmenyn</gui>, välj <guiseq><gui>Projekt</gui><gui>Nytt mål…</gui></guiseq>.

source: You can select another directory in the bottom <gui>directory tree view</gui>.
sv: Du kan välja en annan katalog längst ner i <gui>katalogträdsvyn</gui>.

source: Enter a target name and select the type of the target in the drop-down list below. Depending on your project backend, various types of target are possible, see at the bottom.
sv: Skriv in ett målnamn och välj typen av mål i rullgardinslistan undertill. Beroende på din projektbakände är olika typer av mål möjliga, se längst ner.

source: Target names are typically restricted to letters, digits and the underscore, so it's safer to avoid other characters.
sv: Målnamnen är vanligtvis begränsade till bokstäver, siffror och understreck, så det är säkrare att undvika andra tecken.

source: When you have chosen the target name, type and parent, click on the <gui>Add</gui> button to create this new target.
sv: När du har valt målnamnet, typen och föräldern, klicka på knappen <gui>Lägg till</gui> för att skapa detta nya mål.

source: Add, edit or remove targets from a project.
sv: Lägg till, redigera eller ta bort mål från ett projekt.

source: Manage Targets
sv: Hantera mål

source: Remove a target from a project.
sv: Ta bort ett mål från ett projekt.

source: Remove a Target
sv: Ta bort ett mål

source: Select the target you want to remove in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Remove</gui>.
sv: Välj målet som du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Ta bort</gui>.

source: Confirm the removal. The target and all its properties will be removed from the project file. All its files stay untouched on your hard disk.
sv: Bekräfta borttagningen. Målet och alla dess egenskaper kommer att tas bort från projektfilen. Alla dess filer lämnas orörda på din hårddisk.

source: Display project's content.
sv: Visa projektets innehåll.

source: View a Project
sv: Visa ett projekt

source: A project is represented by a tree, the root item corresponds to the project while children represent programs, libraries, directories and source files. Each item can have properties allowing to set more details like project version, compiler flags or installation directories. These item are divided in several categories, depending on the backend not all are available:
sv: Ett projekt representeras av ett träd, där rotobjektet motsvarar projektet medan dess barn representerar program, bibliotek, kataloger och källkodsfiler. Varje objekt kan ha egenskaper som möjliggör inställning av ytterligare detaljer, så som projektversion, kompilatorflaggor eller installationskataloger. Dessa objekt delas in i flera kategorier; beroende på bakände är inte nödvändigtvis alla tillgängliga:

source: Root
sv: Rot

source: There is only one node of this kind. It represents the project itself. It is the place where you can set project wide properties like the project name or the project version.
sv: Det finns endast en nod av denna typ. Den representerar projektet i sig. Det är platsen på vilken du kan ställa in egenskaper för hela projektet, så som namn eller projektversion.

source: Module
sv: Modul

source: This is a set of packages used in autotools project. They appear as children of the root node to represent all modules defined and as children of each target using them. For more details, see <link xref="project-manager-module-new"/>.
sv: Detta är en samling paket som används i autotools-projekt. De syns som barn till rotnoden för att representera alla moduler som definierats och som barn till varje mål som använder dem. För vidare information, se <link xref="project-manager-module-new"/>.

source: Package
sv: Paket

source: This is a packaged library used in autotools project. They appear as children of each module. For more details, see <link xref="project-manager-library"/>.
sv: Detta är ett paketerat bibliotek som används i autotools-projekt. De syns som barn till varje modul. För vidare information, se <link xref="project-manager-library"/>.

source: Folder
sv: Mapp

source: This is used to group targets allowing to set common properties. They are often implemented by sub directories. For more details, see <link xref="project-manager-folder"/>.
sv: Detta används för att gruppera mål vilket möjliggör att sätta gemensamma egenskaper. De implementeras ofta som underkataloger. För mer information se <link xref="project-manager-folder"/>.

source: Target
sv: Mål

source: It groups files and define how they are used. There are several kinds of targets, by example program, library or data, corresponding to different use of the child files. They often represent generated project files like compiled programs or libraries. For more details see <link xref="project-manager-target"/>.
sv: Det grupperar filer och definierar hur de används. Det finns flera typer av mål, till exempel program, bibliotek eller data, motsvarande olika användningar av barnfilerna. De representerar ofta genererade projektfiler så som kompilerade program eller bibliotek. För vidare information, se <link xref="project-manager-target"/>.

source: You can drag and drop targets at the beginning of the project tree view to create a shortcut allowing to access them more easily. By default all program targets are already put here.
sv: Du kan dra och släppa mål vid början av projektets trädvy för att skapa en genväg vilket låter dig nå dem enklare. Som standard har alla programmål redan placerats här.

source: Source
sv: Källa

source: Each source file is represented by a item in the project view. The use of each file depends on its parent target. All children of a program target are compiled to generate it. While children of a data target are only copied to a directory when the project is installed. For more details see <link xref="project-manager-source"/>.
sv: Varje ny källkodsfil representeras av ett objekt i projektvyn. Användningen av varje fil beror på dess föräldramål. Alla barn till ett programmål kompileras för att generera dem. Barn till ett datamål kopieras å andra sidan endast till en katalog när projektet installeras. För mer information se <link xref="project-manager-source"/>.

source: Create a new project from scratch.
sv: Skapa ett nytt projekt från grunden.

source: Create a Project
sv: Skapa ett projekt

source: New projects are created from templates. <app>Anjuta</app> will ask you for various information, like the type of the project, its name and more.
sv: Nya projekt skapas från mallar. <app>Anjuta</app> kommer att fråga dig om diverse saker, så som projekttyp, dess namn och så vidare.

source: From the <gui>main menu</gui>, select <guiseq><gui>File</gui> <gui>New</gui><gui>Project</gui></guiseq>.
sv: Från <gui>huvudmenyn</gui>. välj <guiseq><gui>Arkiv</gui><gui>Nytt</gui><gui>Projekt</gui></guiseq>.

source: Or from the drop-down list of the <gui>New</gui> button in the <gui>top tool bar</gui>, select <gui>Project</gui> to start the project wizard.
sv: Eller från rullgardinslistan från knappen <gui>Nytt</gui> i <gui>övre verktygsfältet</gui>, välj <gui>Projekt</gui> för att starta projektguiden.
