Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: Select the icon representing the type of the project you want to create and click on <gui>Forward</gui>.
sv: Välj ikonen som representerar typen av projekt du vill skapa och klicka på <gui>Framåt</gui>.

source: Leave the mouse over a project icon for a second and a small pop-up message will appear showing more information about this type of project.
sv: Lämna musen ovanpå en projektikon en liten stund så kommer ett litet poppuppmeddelande att visas med mer information om denna typ av projekt.

source: Depending on the selected project type, you will have to enter different information. When you are done, click on <gui>Forward</gui>.
sv: Beroende på den valda projekttypen kommer du att behöva mata in olika information. När du är klar, klicka på <gui>Framåt</gui>.

source: All informations are grouped in pages, typically you will have to fill two or three pages. You can go back at any time using the button <gui>Back</gui>.
sv: All information grupperas per sida, vanligtvis måste du fylla i två eller tre sidor. Du kan gå tillbaka när som helst med knappen <gui>Bakåt</gui>.

source: Keep the mouse over the button or typing area for a second to get a small pop-up message with more details about the corresponding setting.
sv: Håll musen ovanpå en knapp eller ett inmatningsområde för att få ett litet poppuppmeddelande med ytterligare detaljer om motsvarande inställning.

source: After filling out all the information pages, you will get a summary page listing the main information about your project. Nothing has been written to your disk yet at this point. Click on <gui>Apply</gui> to save the project and open it in <app>Anjuta</app>.
sv: Efter att du fyllt i all information på sidorna kommer du att få se en sammanställningssida om huvudinformationen om ditt projekt. Ingenting har skrivit till din disk ännu. Klicka på <gui>Verkställ</gui> för att spara projektet och öppna det i <app>Anjuta</app>.

source: Each project type corresponds to a template. <app>Anjuta</app> already includes several templates but you can add custom ones and even write your own.
sv: Varje projekttyp motsvarar en mall. <app>Anjuta</app> inkluderar redan flera mallar men du kan lägga till anpassade mallar eller till och med skriva dina egna.

source: Project wizard template.
sv: Guide för projektmall.

source: Project wizard template
sv: Guide för projektmall

source: A project template is composed of a bunch of files which can be processed by a powerful template processing engine called <app>autogen</app>. A project template file has a <file>.wiz</file> extension, and describes all the project properties and files needed.
sv: En projektmall består av en samling filer som kan hanteras av den kraftfulla mallhanteringsmotorn <app>autogen</app>. En projektmall har en <file>.wiz</file>-ändelse och beskriver alla projektegenskaperna och filerna som behövs.

source: This <file>.wiz</file> file looks like a XML file and is documented <link href="http://library.gnome.org/devel/libanjuta/stable/project-wizard-format.html">here</link>.
sv: Denna <file>.wiz</file>-fil ser ut som en XML-fil och finns dokumenterad <link href="http://library.gnome.org/devel/libanjuta/stable/project-wizard-format.html">här</link>.

source: Run parameters dialog
sv: Dialogrutan körparametrar

source: Run Parameters Dialog
sv: Dialogrutan körparametrar

source: The <gui>run parameter</gui> dialog allows you to define the current program and several parameters.
sv: Dialogrutan <gui>körparametrar</gui> låter dig definiera det aktuella programmet och flera parametrar.

source: This is the program that will be executed if you run a program with or without the debugger. The drop-down list allows you to select programs created by the current project, but you can click on the <gui>Browse</gui> button to choose any other program.
sv: Detta är programmet som kommer att köras om du kör ett program med eller utan felsökaren. Rullgardinslistan låter dig välja bland programmen som skapas av det aktuella projektet, men du kan klicka på knappen <gui>Bläddra</gui> för att välja ett annat program.

source: <gui>Arguments</gui>
sv: <gui>Argument</gui>

source: These are the command line arguments used by your program. The drop-down list keeps an history of the last arguments used.
sv: Detta är kommandoradsargumenten som används av ditt program. Rullgardinslistan behåller historiken över de senast använda argumenten.

source: <gui>Working Directory</gui>
sv: <gui>Arbetskatalog</gui>

source: The working directory is the current directory when your program will be run.
sv: Arbetskatalogen är den aktuella katalogen när ditt program körs.

source: <gui>Environment Variables</gui>
sv: <gui>Miljövariabler</gui>

source: You can click on the drop-down section, to display all environment variables that will be accessible by your program. By default, it includes all the current environment variables, they are displayed in light gray.
sv: Du kan klicka på rullgardinsavsnitt för att visa alla miljövariabler som kommer att vara tillgängliga för ditt program. Som standard inkluderar det alla aktuella miljövariabler som listas i ljusgrått.

source: You can click on the <gui>New</gui> button to add a new environment variable.
sv: Du kan klicka på knappen <gui>Ny</gui> för att lägga till en ny miljövariabel.

source: You can click on the <gui>Edit</gui> button to change the value of the selected environment variable.
sv: Du kan klicka på knappen <gui>Redigera</gui> för att ändra värdet på den markerade miljövariabeln.

source: You can click on the <gui>Delete</gui> button to remove the selected environment variable.
sv: Du kan klicka på knappen <gui>Ta bort</gui> för att ta bort den markerade miljövariabeln.

source: When a variable has not the same value as in the current environment, it is displayed in black.
sv: När en variabel inte har samma värde som i den aktuella miljön kommer den att visas i svart.

source: <gui>Run in Terminal</gui>
sv: <gui>Kör i terminal</gui>

source: This has to be checked to run the program in a terminal allowing you to provide inputs and see its outputs using the standard Unix streams. It is not necessary for programs having a graphical interface.
sv: Detta måste vara ikryssat för att köra programmet i en terminal som låter dig tillhandahålla inmatning och se dess utmatning via Unix standardströmmar. Det är inte nödvändigt för program att ha ett grafiskt gränssnitt.

source: Start a program without the debugger.
sv: Starta ett program utan felsökaren.

source: Run a program
sv: Kör ett program

source: If <app>Anjuta</app> is used to start a program it checks that it is up to date and builds it if needed.
sv: Om <app>Anjuta</app> används för att starta ett program så kontrollerar det att det är uppdaterat och bygger det om så krävs.

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Run</gui></guiseq> or press <key>F3</key> to execute the current program.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Kör</gui></guiseq> eller tryck på <key>F3</key> för att köra det aktuella programmet.

source: The current program and several parameters can be set on the <gui>parameter</gui> dialog. See <link xref="run-parameters-dialog"/> for more information.
sv: Det aktuella programmet och flera parametrar kan ställas in i <gui>parameter</gui>-dialogrutan. Se <link xref="run-parameters-dialog"/> för vidare information.

source: From the <gui>main menu</gui>, select <guiseq><gui>Run</gui> <gui>Program Parameters...</gui></guiseq> to display the dialog.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Kör</gui> <gui>Programparametrar…</gui></guiseq> för att visa dialogrutan.

source: If your program needs data files, you probably have to install it at least one time before running it. See <link xref="autotools-build-install"/> for more information.
sv: Om ditt program behöver datafiler måste du antagligen installera det minst en gång innan du kör det. Se <link xref="autotools-build-install"/> för mer information.

source: All windows and dialogs.
sv: Alla fönster och dialoger.

source: Windows and dialogs
sv: Fönster och dialoger
