Repository: GNOME/anjuta
Catalog: manuals/anjuta-manual/*/*.po
Languages: sv

source: From the <gui>main menu</gui>, select <guiseq><gui>View</gui> <gui>Watches</gui></guiseq> to open the <gui>Watches</gui> window.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Visa</gui> <gui>Bevakningar</gui></guiseq> för att öppna fönstret <gui>Bevakningar</gui>.

source: Like local variables, all watch expressions are displayed in a tree with children used to represent structure or array members.
sv: Precis som lokala variabler visas alla bevakningsuttryck i ett träd där barn representerar struktur- eller arraymedlemmar.

source: The name of the variable or the expression.
sv: Namnet på variabeln eller uttrycket.

source: The variable or expression value.
sv: Variabelns eller uttryckets värde.

source: The type of the variable or of the expression result.
sv: Variabelns eller uttrycksresultatets typ.

source: Update watches
sv: Uppdatera bevakning

source: Watch expressions can be updated automatically as soon as the program is stopped or on user request.
sv: Bevakningsuttryck kan uppdateras automatiskt så snart programmet stoppats eller då användaren begär det.

source: To set a watch expression to update automatically:
sv: För att ställa in ett bevakningsuttryck att uppdateras automatiskt:

source: In the <gui>Watches</gui> window, select the watch you want to update automatically. Right-click and check that <gui>Automatic Update</gui> if checked. If not, select it.
sv: I fönstret <gui>Bevakningar</gui>, välj bevakningen som du vill uppdatera automatiskt. Högerklicka och kontrollera om <gui>Automatisk uppdatering</gui> är ikryssat. Om inte, kryssa i det.

source: To update a watch expression manually:
sv: För att uppdatera ett bevakningsuttryck manuellt:

source: In the <gui>Watches</gui> window, right click and select <gui>Update Watch</gui> to update the selected watch.
sv: I fönstret <gui>Bevakningar</gui>, högerklicka och välj <gui>Uppdatera bevakning</gui> för att uppdatera den markerade bevakningen.

source: To update all watch expressions manually at once:
sv: För att på en gång uppdatera alla bevakningsuttryck manuellt:

source: In the <gui>Watches</gui> window, right click and select <gui>Update all</gui> to update all watches at the same time.
sv: I fönstret <gui>Bevakningar</gui>, högerklicka och välj <gui>Uppdatera alla</gui> för att uppdatera alla bevakningar på samma gång.

source: Add a watch on an expression
sv: Lägg till en bevakning av ett uttryck

source: To add an expression to the watch list:
sv: För att lägga till ett uttryck till bevakningslistan:

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Add Watch...</gui></guiseq> or in the <gui>Watches</gui> window, right-click and select <gui>Add Watch...</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Lägg till bevakning…</gui></guiseq> eller i fönstret <gui>Bevakningar</gui>, högerklicka och välj <gui>Lägg till bevakning…</gui>.

source: Enter the expression to watch. Check <gui>Automatic Update</gui> if you want the expression to be evaluated each time the program is stopped.
sv: Skriv in uttrycket att bevaka. Kryssa i <gui>Automatisk uppdatering</gui> om du vill att uttrycket ska utvärderas varje gång programmet stoppas.

source: An expression can be evaluated and then added as a watch like this:
sv: Ett uttryck kan utvärderas och sedan läggas till som en bevakning så här:

source: From the <gui>main menu</gui>, select <guiseq><gui>Debug</gui> <gui>Inspect/Evaluate</gui></guiseq> or right click in the <gui>Editor</gui> window and select <gui>Inspect/Evaluate</gui>.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Felsök</gui> <gui>Inspektera/Evaluera</gui></guiseq> eller högerklicka i fönstret <gui>Redigerare</gui> och välj <gui>Inspektera/Evaluera</gui>.

source: Click on <gui>Add</gui> button to add this expression to the watches list.
sv: Klicka på knappen <gui>Lägg till</gui> för att lägga till detta uttryck till bevakningslistan.

source: Remove a watch
sv: Ta bort en bevakning

source: You can remove an expression from the watches list.
sv: Du kan ta bort ett uttryck från bevakningslistan.

source: In the <gui>Watches</gui> window, select the watch you want to remove, then right-click and select <gui>Remove Watch</gui>.
sv: I fönstret <gui>Bevakningar</gui>, välj bevakningen som du vill ta bort, högerklicka och välj <gui>Ta bort bevakning</gui>.

source: All watches can be removed at the same time.
sv: Alla bevakningar kan tas bort på samma gång.

source: In the <gui>Watches</gui> window, right-click and select <gui>Remove all</gui>.
sv: I fönstret <gui>Bevakningar</gui>, högerklicka och välj <gui>Ta bort alla</gui>.

source: If a watch expression corresponds to a variable, you can change its value.
sv: Om ett bevakningsuttryck motsvarar en variabel kan du ändra dess värde.

source: In the <gui>Watches</gui> window, select the variable you want to edit and double click in the <gui>Value</gui> column.
sv: I fönstret <gui>Bevakningar</gui>, välj variabeln som du vill redigera och dubbelklicka i kolumnen <gui>Värde</gui>.

source: Enter the new value.
sv: Ange det nya värdet.

source: Directory project backend.
sv: Bakände för katalogprojekt.

source: Directory project backend plugin
sv: Bakändesinstick för katalogprojekt

source: This is the simplest project backend. There is no project file. It works like a file viewer, considering all files matching typical source extensions (for example <file>.c</file>, <file>.py</file>) to be source files. Directories are kept in order to group source files but there is no target.
sv: Detta är den enklaste projektbakänden. Det finns ingen projektfil. Den fungerar som en filvisare, behandlar alla filer som matchar vanliga källändelser (till exempel <file>.c</file>, <file>.py</file>) som om de är källkodsfiler. Kataloger behålls för att gruppera källkodsfiler, men det finns inget mål.

source: This backend is a useful workaround if your project does not have a corresponding backend in <app>Anjuta</app> or if the appropriate backend does not fully support your project.
sv: Denna bakände är en användbar lösning om ditt projekt inte har en motsvarande bakände i <app>Anjuta</app> eller om den lämpliga bakänden inte har fullt stöd för ditt projekt.

source: It is not possible to add or change anything with a project using this backend. But if you create a source file in the project directory, with the right extension, it will be added automatically.
sv: Det är inte möjligt att lägga till eller ändra något i ett projekt som använder denna bakände. Men om du skapar en källkodsfil med rätt filändelse i projektkatalogen, kommer den att läggas till automatiskt.

source: All help topics.
sv: Alla hjälpämnen.

source: Introduction
sv: Introduktion

source: Introduction to <app>Anjuta</app> Integrated Development Environment
sv: Introduktion till den integrerade utvecklingsmiljön <app>Anjuta</app>

source: <app>Anjuta</app> is a versatile Integrated Development Environment (IDE) for the GNOME desktop. It features a number of advanced programming facilities including project management, application wizards, interactive debugging, integrated Glade UI designer, integrated Devhelp API help, class generator, powerful source editor, symbols browsing, Git support, C/C++, Python and Vala support and more.
sv: <app>Anjuta</app> är en mångsidig integrerad utvecklingsmiljö (IDE) för GNOME-skrivbordet. Den har ett antal avancerade programmeringshjälpmedel inklusive projekthantering, programguider, interaktiv felsökning, integrerad Glade UI-designer, integrerad Devhelp API-hjälp, klassgenerator, kraftfull källkodsredigerare, symbolbläddrare, Git-stöd, C/C++-, Python- samt Vala-stöd med mera.

source: <app>Anjuta</app> has a flexible and advanced docking system that allows you to lay out all the views in whatever way you like. You can drag and drop the views using drag bars and rearrange the layout.
sv: <app>Anjuta</app> har ett flexibelt och avancerat dockningssystem som låter dig placera alla vyer där du vill ha dem. Du kan dra och släppa vyerna med hjälp av draghandtag och omarrangera layouten.

source: <app>Anjuta</app> has been designed to be simple to operate yet powerful enough to fulfill all your programming needs. We have added many new features to <app>Anjuta</app> over the course of its development. Our focus is on delivering power and usability at the same time and making your software development enjoyable without overloading your senses. We intend to continue improving and stabilizing <app>Anjuta</app> to give you the best IDE experience possible.
sv: <app>Anjuta</app> har designats för att vara enkelt att använda, men samtidigt kraftfullt nog för att uppfylla alla dina programmeringsbehov. Vi har lagt till många nya funktioner i <app>Anjuta</app> under dess utveckling. Vårt fokus är på att leverera kraftfullhet och användbarhet på samma gång samt göra din programutveckling njutbar utan att överväldiga dig. Vi avser att fortsätta förbättra och stabilisera <app>Anjuta</app> för att ge dig den bästa möjliga IDE-upplevelsen.

source: We hope you will have a good time using <app>Anjuta</app>. If not, please help us make it better by reporting bugs and suggestions - this will help to improve the software, as well as helping the open source community.
sv: Vi hoppas att du kommer att ha det trevligt när du använder <app>Anjuta</app>. Om inte, hjälp oss att göra det bättre genom att skicka in felrapporter och förslag — detta kommer att hjälpa till att förbättra programvaran, och hjälpa öppen källkods-gemenskapen.

source: The following screenshot illustrates some of the things you will find in <app>Anjuta</app>.
sv: Följande skärmbild illustrerar några av de saker du kommer att hitta i <app>Anjuta</app>.

source: <app>Anjuta</app> in action
sv: <app>Anjuta</app> under användning

source: <app>Anjuta</app> main window
sv: Huvudfönstret för <app>Anjuta</app>

source: Supported Emacs modelines features.
sv: Funktioner som stöds i lägesrader för Emacs.

source: Emacs modelines
sv: Emacs-lägesrader

source: Such modeline is a comment in the first line of the file or the second one if the first contains a shebang (#!). It is composed by a list of variable names followed by <code>:</code> and a value, separated by <code>;</code> and surrounded by <code>-*-</code>.
sv: Sådana lägesrader i en kommentar på första raden i filen eller den andra om den första innehåller en shebang (#!). Den består av en lista av variabelnamn följda av <code>:</code> samt ett värde, separerade med <code>;</code> och omgärdade av <code>-*-</code>.

source: A typical <app>Emacs</app> modeline looks like this:
sv: En typisk <app>Emacs</app>-lägesrad ser ut så här:

source: Anjuta supports only the following variables.
sv: Anjuta stöder endast följande variabler.

source: Set to <code>t</code> to use tabulation for indentation or <code>nil</code> to use spaces.
sv: Sätt till <code>t</code> för att använda tabulering som indentering eller <code>nil</code> för att använda blanksteg.

source: Number of space characters corresponding to one tabulation character.
sv: Antal blanksteg som motsvarar ett tabbtecken.

source: Number of space characters used to indent C code.
sv: Antal blanksteg som används för att indentera C-kod.

source: Supported Vim modelines features.
sv: Funktioner som stöds i lägesrader för Vim.

source: Vim modelines
sv: Lägesrader för Vim

source: This modeline is a line in the 5 first of the 5 last of the file containing <code>vim:</code> followed by at least one space and a list of variable names with an optional value after <code>=</code> separated by space or <code>:</code>.
sv: Denna lägesrad är en rad bland de 5 första eller de 5 sista raderna i filen som innehåller <code>vim:</code> åtföljt av åtminstone ett blanksteg och en lista över variabelnamn med ett valfritt värde efter <code>=</code> separerade av blanksteg eller <code>:</code>.

source: A typical <app>Vim</app> modeline looks like this:
sv: En typisk <app>Vim</app>-lägesrad ser ut så här:

source: Anjuta support only the following variables.
sv: Anjuta stöder endast följande variabler.

source: Use spaces for indentation.
sv: Använd blanksteg för indentering.

source: Use tabulation for indentation.
sv: Använd tabbar för indentering.

source: Makefile project backend.
sv: Bakände för Makefile-projekt.

source: Makefile project backend plugin
sv: Bakändesinstick för Makefile-projekt

source: A makefile is probably the most common way to build software on all kinds of platforms. A makefile contains a list or rules describing which commands have to be run in order to generate a target from a list of dependencies. When building a program, the target is an object file and the dependencies are the source files. The target of one rule can be a dependency of another one, allowing several rules to be chained in order to make a final target.
sv: En makefil är förmodligen det vanligaste sättet att bygga programvara på för alla typer av plattformar. En makefil innehåller en lista av regler som beskriver vilka kommandon som måste köras för att generera ett mål från en lista av beroenden. När ett program byggs är målet en objektfil och beroendena är källkodsfilerna. Målet för en regel kan vara ett beroende för en annan, vilket möjliggör att flera regler kan kedjas ihop för att skapa ett slutgiltigt mål.

source: It is a low-level, general tool, making it difficult to find all source files and targets of a project. So <app>Anjuta</app> has limited support for makefiles, reading only one makefile in the top project directory and extracting source files and targets.
sv: Det är ett generellt lågnivåverktyg som gör det svårt att hitta alla källkodsfiler och mål för ett projekt. Så <app>Anjuta</app> har begränsat stöd för makefiler och kan endast läsa in en makefil i toppen av projektkatalogen och extrahera källkodsfiler och mål.

source: If the project backend is not able to find all the source files, you can try to use the directory backend instead. It does not recognize any targets but should get all source files.
sv: Om projektbakänden inte kan hitta alla källkodsfiler kan du prova att använda katalogbakänden istället. Den känner inte igen mål, men bör hitta alla källkodsfiler.

source: Changing properties, or adding or removing targets and source files are disabled with this backend, as automatically editing the makefile is not implemented. It has to be changed by hand using the text editor. When the makefile is saved, it is automatically reloaded though.
sv: Att ändra egenskaper, eller lägga till och ta bort mål och källkodsfiler är inaktiverat med denna bakände så automatisk redigering av makefilen inte är implementerat. Den måste ändras för hand med hjälp av textredigeraren. När makefilen sparats kommer den dock att läsas in på nytt.

source: Import an existing project.
sv: Importera ett befintligt projekt.

source: Import a Project
sv: Importera ett projekt

source: <app>Anjuta</app> does not have its own project format. It loads projects using already existing formats, like makefile or autotools, and does not require that other developers use it. Anjuta's own settings are stored in a file with the <file>.anjuta</file> extension and a hidden directory created in the project directory. To use a project in <app>Anjuta</app> and create these settings files, you will need to import the project. This will not modify any project files.
sv: <app>Anjuta</app> har inget eget projektformat. Det läser in projekt som använder redan existerande format, så som makefiler eller autotools, och kräver inte att utvecklaren använder det. Anjutas egna inställningar sparas i en fil med filändelsen <file>.anjuta</file> och en dold katalog skapas i projektkatalogen. För att använda ett projekt i <app>Anjuta</app> och skapa dessa inställningsfiler måste du importera projektet. Detta kommer inte att modifiera några projektfiler.

source: From the <gui>main menu</gui>, select <guiseq><gui>File</gui> <gui>New</gui><gui>Project from Existing Sources</gui></guiseq> or <gui>Project from Existing Sources</gui> from the drop-down list of the <gui>New</gui> button in the <gui>top tool bar</gui> to start the project wizard.
sv: Från <gui>huvudmenyn</gui>, välj <guiseq><gui>Arkiv</gui><gui>Nytt</gui><gui>Projekt från befintlig källkod</gui></guiseq> eller <gui>Projekt från befintlig källkod</gui> från rullgardinslistan från knappen <gui>Ny</gui> i det <gui>övre verktygsfältet</gui> för att starta projektguiden.

source: Select <gui>Import from folder</gui> if the project is already present on your computer, then select the project directory.
sv: Välj <gui>Importera från mapp</gui> om projektet redan finns på din dator, välj sedan projektkatalogen.

source: Or Select <gui>Import from version control system</gui> if the project needs to be checked out from a server. Then select the version control system, the server address and the destination directory on your computer.
sv: Eller välj <gui>Importera från versionshanteringssystem</gui> om projektet måste checkas ut från en server. Välj sedan versionshanteringssystemet, serveradressen och målkatalogen på din dator.

source: After selecting an existing project, the <gui>Project name</gui> text box should be filled with the name of the project's directory, but you can change it. When it's done, click on the <gui>Import</gui> button to download the project if needed and create the files needed by <app>Anjuta</app>.
sv: Efter att du valt ett befintligt projekt bör textrutan <gui>Projektnamn</gui> ha fyllts i med namnet på projektets katalog, men du kan ändra det. När det är klart, klicka på knappen <gui>Importera</gui> för att hämta ner projektet om det behövs och skapa filerna som <app>Anjuta</app> behöver.

source: <app>Anjuta</app> tries to automatically find the project backend used by your project. But if several backends are possible, you will get a dialog asking you to choose a project backend plugin. Read the project backend description to find out which one to choose.
sv: <app>Anjuta</app> försöker att automatiskt hitta projektbakänden som används av ditt projekt. Men om flera bakändar kan användas kommer du att få se en dialogruta där du kan välja bakändesinstick för projektet. Läs beskrivningarna för projektbakändarna för ta reda på vilken du bör välja.

source: Add a folder to a project.
sv: Lägg till en mapp till ett projekt.

source: Add a Folder
sv: Lägg till en mapp

source: A folder allows you to group several target allowing to set common properties for all of them. It often corresponds to a directory.
sv: En mapp låter dig gruppera flera mål vilket låter dig ställa in gemensamma egenskaper för allihop. Den motsvarar ofta en katalog.

source: Select the group or the project where you want to add the new group in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Add Group</gui>.
sv: Markera gruppen eller projektet där du vill lägga till den nya gruppen i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Lägg till grupp</gui>.

source: Or from the <gui>main menu</gui>, select <guiseq><gui>Project</gui> <gui>Add Group</gui></guiseq>.
sv: Eller från <gui>huvudmenyn</gui>, välj <guiseq><gui>Projekt</gui><gui>Lägg till grupp</gui></guiseq>.

source: Enter a new group name.
sv: Ange ett nytt gruppnamn.

source: Groups names are typically restricted to letters, digits and the underscore, so it's safer to avoid other characters.
sv: Gruppnamn är vanligtvis begränsade till bokstäver, siffror och understreck, så det är säkrare att undvika andra tecken.

source: You can select another group in the bottom <gui>group tree view</gui>.
sv: Du kan välja en annan grupp längst ner i <gui>gruppträdsvyn</gui>.

source: When you have chosen the parent and enter the name, click on the <gui>Add</gui> button to add the group to your project.
sv: När du har valt föräldern och skrivit in namnet, klicka på knappen <gui>Lägg till</gui> för att lägga till gruppen till ditt projekt.

source: Add, edit or remove folders from a project.
sv: Lägg till, redigera eller ta bort mappar från ett projekt.

source: Manage Folders
sv: Hantera mappar

source: Remove folders from a project.
sv: Ta bort mappar från ett projekt.

source: Remove Folder
sv: Ta bort mapp

source: Select the folder you want to remove in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Remove</gui>.
sv: Välj mappen du vill ta bort i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Ta bort</gui>.

source: Confirm the removal. This will only remove the folder from the project files without removing any files or directories from your disk.
sv: Bekräfta borttagandet. Detta kommer endast ta bort mappen från projektfilerna utan att ta bort några filer eller kataloger från din disk.

source: Add a custom library to a target.
sv: Lägg till ett anpassat bibliotek till ett mål.

source: Add a Custom Library
sv: Lägg till ett anpassat bibliotek

source: It is easier to use a packaged library, which is common on Linux, so check if it is the case <link xref="project-manager-module-new">here</link>. But else you can still use the library as explained below.
sv: Det är enklare att använda ett paketerat bibliotek vilket är vanligt på Linux, så kontrollera om det är fallet <link xref="project-manager-module-new">här</link>. I annat fall kan du fortfarande använda biblioteket enligt förklaringen nedan.

source: In order to use a library in C, you need to tell the compiler where the header files are, and tell the linker where to find the needed libraries. The issue is that your program will not compile on another computer if the header and the libraries are elsewhere.
sv: För att använda ett bibliotek i C måste du berätta för kompilatorn var headerfilerna finns och berätta för länkaren var den kan hitta biblioteken som behövs. Problemet är att ditt program inte kommer att kunna kompileras på en annan dator om headerfilerna och biblioteken finns någon annanstans.

source: Select the directory containing the program where you want to add the library in the <gui>project view</gui>, click on the right mouse button to make the <gui>project context menu</gui> appear and select <gui>Properties</gui>.
sv: Välj katalogen som innehåller programmet där du vill lägga till biblioteket i <gui>projektvyn</gui>, klicka på höger musknapp för att få <gui>projektsnabbvalsmenyn</gui> att visas och välj <gui>Egenskaper</gui>.

source: Or from the <gui>main menu</gui>, select <guiseq><gui>Project</gui> <gui>Properties</gui></guiseq>. By default, it edits the properties of the currently selected item in the project view. You can select a different item in the drop-down list button.
sv: Eller från <gui>huvudmenyn</gui>, välj <guiseq><gui>Projekt</gui><gui>Egenskaper</gui></guiseq>. Som standard kommer det att redigera egenskaperna för det markerade objektet i projektvyn. Du kan välja ett annat objekt via rullgardinslistknappen.
