Repository: GNOME/anjuta
Catalog: manuals/anjuta-build-tutorial/*/*.po
Languages: sv

source: Programs compiled from sources are installed by default in <filename class="directory"> /usr/local</filename>. If you want to install (or uninstall) a program in such system directory, you normally need to log as root using <userinput>su</userinput> or <userinput>sudo</userinput> before running <userinput>make install</userinput>.
sv: Program som kompileras från källkod installeras som standard i <filename class="directory"> /usr/local</filename>. Om du vill installera (eller avinstallera) ett program i en sådan systemkatalog behöver du vanligen logga in som root med <userinput>su</userinput> eller <userinput>sudo</userinput> innan du kör <userinput>make install</userinput>.

source: Using <application>Autotools</application>
sv: Med <application>Autotools</application>

source: If you want to build your program on another system, using <application>make</application> only could be quite difficult. The C compiler could be different. Some common C functions could be missing, have another name, declared in a different header and so on. This can be handled by enabling difference piece of code in your sources using preprocessor directive #if, #ifdef and others. But the user will have to define himself all these tuning which is not easy as there is a lots of systems with a lots of variations.
sv: Om du vill bygga ditt program på ett annat system skulle det kunna vara ganska svårt att använda bara <application>make</application>. C-kompilatorn skulle kunna vara en annan. Några vanliga C-funktioner kan saknas, ha ett annat namn, deklareras i en annan headerfil och så vidare. Detta kan hanteras genom att aktivera olika delar kod i dina källor genom preprocessordirektiven #if, #ifdef med flera. Men användaren kommer själv behöva definiera all denna justering vilket inte är lätt då det finns många system med stor variation.

source: Free softwares are mainly distributed as sources. It is crucial to be able to recompile them on various system without much technical knowledge. <application>Autotools</application> is designed to solve this and you probably have already use it using the magic combination <userinput> "./configure; make; make install"</userinput>. You may have noticed that many files are involved in this build process; globally all that stuff seems very complicated. So what's happening when you compile such software ?
sv: Fri programvara distribueras främst som källkod. Det är av kritisk vikt att kunna kompilera om dem på olika system utan alltför mycket teknisk kunskap. <application>Autotools</application> är designat för att lösa detta och du har förmodligen redan använt det genom den magiska kombinationen <userinput> "./configure; make; make install"</userinput>. Du kan ha upptäckt att många filer involveras i denna byggprocess, globalt verkar allt det väldigt komplicerat. Så vad händer när du kompilerar sådan programvara?

source: Input files
sv: Inmatningsfiler

source: An <application>Autotools</application> project comes at least with a configure script, named <filename>configure</filename>, and a makefile template named <filename>Makefile.in</filename>. There is normally, one <filename>Makefile.in</filename> in each directory of the project. There are several other files used by an <application>Autotools</application> project but they are not stricly necessary or are generated automatically.
sv: Ett <application>Autotools</application>-projekt kommer åtminstone med ett konfigurationsskript, med namnet <filename>configure</filename>, och en makefil-mall med namnet <filename>Makefile.in</filename>. Det finns vanligen en <filename>Makefile.in</filename> i varje katalog i projektet. Det finns flera andra filer som används av ett <application>Autotools</application>-projekt men de är inte absolut nödvändiga eller genereras automatiskt.

source: If you look inside these files, you will see that they are quite complex. Do not worry, these files are generated by <application>Autotools</application> from other templates easier to write as explained in <xref linkend="create-autotools"/>. For the moment, we do not care, we consider these files exist as it is the case when you get a source package.
sv: Om du tar en titt i dessa filer så kommer du att se att de är ganska komplexa. Var inte orolig, dessa filer genereras av <application>Autotools</application> från andra mallar som är lättare att skriva, som beskrivet i <xref linkend="create-autotools"/>. För tillfället bryr vi oss inte, vi utgår från att dessa filer existerar då det är fallet då du får tag på ett källpaket.

source: Configure
sv: Konfigurera

source: In fact, you don't need <application>Autotools</application> to build an autotools package, <application>configure</application> is a shell script running on the most basic shell: <filename>sh</filename>. It probes your system checking each characteristic and writes makefiles from the templates.
sv: Du behöver faktiskt inte <application>Autotools</application> för att bygga ett autotools-paket, <application>configure</application> är ett skalskript som kör i det mest grundläggande skalet: <filename>sh</filename>. Det sonderar ditt system och kontrollerar varje karakteristik och skriver makefiler från mallarna.

source: In order to build a project using a library, you need more information about it, so additional files. For a library used in a C program, you need the corresponding header files. This has to be installed on your system and is typically found in a so called development package. By example for the library <application>libxml2</application>, there are two packages:
sv: För att bygga ett paket med ett bibliotek behöver du mer information om det, alltså ytterligare filer. För ett bibliotek som används i ett C-program behöver du motsvarande headerfiler. Dessa måste vara installerade på ditt system och hittas vanligen i ett så kallat utvecklingspaket. För biblioteket <application>libxml2</application> finns det exempelvis två paket:

source: <filename>libxml2</filename> necessary to run a program using it and installed automatically as a dependency of such program.
sv: <filename>libxml2</filename> som är nödvändigt för att köra ett program som använder det, och det installeras automatiskt som ett beroende för ett sådant paket.

source: <filename>libxml2-devel</filename> necessary to build a program using it. If you don't have it <application>configure</application> will display an error message.
sv: <filename>libxml2</filename> som är nödvändigt för att bygga ett program som använder det. Om du inte har det kommer <application>configure</application> visa ett felmeddelande.

source: Configure process
sv: Konfigurationsprocessen

source: <application>configure</application> creates all files in the directory where it is called. This directory is the <emphasis>build directory</emphasis>. If you run it from the source directory, using <userinput>./configure</userinput>, the build directory will be the same.
sv: <application>configure</application> skapar alla filer i katalogen där det anropas. Denna katalog är <emphasis>byggkatalogen</emphasis>. Om du kör det från källkatalogen med <userinput>./configure</userinput>, så kommer byggkatalogen vara densamma.

source: <application>configure</application> accepts several options in the command line. They are used to install the files in different directories, to disable some parts of the project in order to get a smaller executable or if you haven't one needed library or force a value for some <application>make</application> variable (see <xref linkend="build-make-vars"/>). You can get a list of them by running <userinput>configure --help</userinput>. Here is a list of the most common ones:
sv: <application>configure</application> accepterar flera flaggor på kommandoraden. De används för att installera filerna i olika kataloger, för att inaktivera vissa delar av projektet för att få en mindre exekverbar fil eller om du saknar något bibliotek som behövs eller för att tvinga ett värde för någon <application>make</application>-variabel (se <xref linkend="build-make-vars"/>). Du kan se en lista över dem genom att köra <userinput>configure --help</userinput>. Här är en lista över de vanligaste:

source: List all available options
sv: Lista alla tillgängliga flaggor

source: <parameter>--host <replaceable>host</replaceable></parameter>
sv: <parameter>--host <replaceable>värd</replaceable></parameter>

source: Compile to run on another system (cross compilation)
sv: Kompilera för att köra på ett annat system (korskompilering)

source: <parameter>--prefix <replaceable>dir</replaceable></parameter>
sv: <parameter>--prefix <replaceable>kat</replaceable></parameter>

source: Select the root directory for installing the project, default /usr/local
sv: Välj rotkatalogen för att installera projektet, standard är /usr/local

source: <application>configure</application> generates a few additional files which are less important. <filename>config.log</filename> is a log file useful when something goes wrong to get more details. <filename>config.status</filename> is another shell script, it can be run to restore the current configuration. <filename>config.h</filename> is a header file generated like <filename>Makefile</filename> from a template <filename>config.h.in</filename> if it exists.
sv: <application>configure</application> genererar några ytterligare filer som är mindre viktiga. <filename>config.log</filename> är en loggfil som är användbar när något går fel för att få mer detaljer. <filename>config.status</filename> är ett annat skalskript, det kan köras för att återställa aktuell konfiguration. <filename>config.h</filename> är en headerfil som liksom <filename>Makefile</filename> genereras från en mall <filename>config.h.in</filename> om den existerar.

source: The makefiles generated by <application>configure</application> are quite complex but are standard makefiles. They define all standard targets needed by GNU standard.
sv: Makefilerna som genereras av <application>configure</application> är ganska komplexa men är vanliga makefiler. De definierar alla standardmål som behövs enligt GNU-standard.

source: <userinput>make</userinput> or <userinput>make all</userinput> builds the program.
sv: <userinput>make</userinput> eller <userinput>make all</userinput> bygger programmet.

source: <userinput>make install</userinput> installs the program.
sv: <userinput>make install</userinput> installerar programmet.

source: <userinput>make distclean</userinput> removes all files generated by <application>configure</application>, to let the project in the state it was when unpacking the distribution package.
sv: <userinput>make distclean</userinput> tar bort alla filer som genereras av <application>configure</application>, för att föra projektet till tillståndet det var i då distributionspaketet packades upp.

source: Using <application>Anjuta</application>
sv: Med <application>Anjuta</application>

source: Now, we will see the <application>Anjuta</application> interface allowing you to run all these commands without using the command line.
sv: Nu kommer vi att se att <application>Anjuta</application>-gränssnittet låter dig köra alla dessa kommandon utan att använda kommandoraden.

source: As <application>Anjuta</application> is using <application>Autotools</application>, the first step is similar, you need to run configure. Select <menuchoice><guisubmenu>Build</guisubmenu> <guimenuitem>Configure Project...</guimenuitem></menuchoice>, to get the following dialog:
sv: Eftersom <application>Anjuta</application> använder <application>Autotools</application> så är det första steget liknande, du behöver köra configure. Välj <menuchoice><guisubmenu>Bygg</guisubmenu> <guimenuitem>Konfigurera projekt…</guimenuitem></menuchoice> för att få följande dialogruta:

source: Configure dialog
sv: Konfigurationsdialog

source: The <guilabel>Regenerate project</guilabel> checkbox will not be described now as it is related to project creation (see in <xref linkend="create-autotools-generate"/>).
sv: Kryssrutan <guilabel>Generera om projektet</guilabel> kommer inte beskrivas nu då den är relaterad till projektskapande (se <xref linkend="create-autotools-generate"/>).

source: The <guilabel>Configuration</guilabel> field is an user name used to reference this particular configuration to switch between different ones later. For <application>Anjuta</application> each configuration corresponds to one build directory and a set of configure options. <application>Anjuta</application> already provides some default configurations that you can select here.
sv: Fältet <guilabel>Konfiguration</guilabel> är ett namn användare använder för att referera till denna speciella konfiguration och kunna växla mellan olika sådana senare. För <application>Anjuta</application> motsvarar varje konfiguration en byggkatalog och en uppsättning konfigurationsflaggor. <application>Anjuta</application> tillhandahåller redan några standardkonfigurationer som du kan välja här.

source: It is recommended to use the Debug configuration for debugging. It will compile your program with all optimizations disabled. When optimizations are enabled, some variables and functions are removed, you will not be able to see them with the debugger. Moreover some lines in your source code are re-ordered, so some steps will go backward.
sv: Det rekommenderas att använda konfigurationen Felsök för felsökning. Den kommer kompilera dina program med alla optimeringar inaktiverade. Då optimeringar är aktiverade tas vissa variabler och funktioner bort, och du kommer inte kunna se dem med felsökaren. Dessutom arrangeras vissa rader i din källkod om, så några steg kommer att gå baklänges.

source: The <guilabel>Build Directory</guilabel> field allow to select the directory used to build the project. It must be different for each configuration.
sv: Fältet <guilabel>Byggkatalog</guilabel> låter dig välja katalogen som används för att bygga projektet. Den måste vara olika för varje konfiguration.

source: If you build the project in the source directory (leaving the <guilabel>Build Directory</guilabel> field empty), you cannot create a new configuration. It is a limitation of <application>Autotools</application>. You need to select <menuchoice><guisubmenu>Build</guisubmenu> <guimenuitem>Remove Configuration</guimenuitem></menuchoice> that will run <userinput>make distclean</userinput> in the source directory first.
sv: Om du bygger projektet i källkatalogen (och lämnar fältet <guilabel>Byggkatalog</guilabel> tomt), så kan du inte skapa en ny konfiguration. Det är en begränsning i <application>Autotools</application>. Du behöver först välja <menuchoice><guisubmenu>Bygg</guisubmenu> <guimenuitem>Ta bort konfiguration</guimenuitem></menuchoice> som kommer köra <userinput>make distclean</userinput> i källkatalogen.

source: The <guilabel>Configure Options</guilabel> field allow passing different options to the configure script.
sv: Fältet <guilabel>Konfigurationsflaggor</guilabel> låter dig skicka olika flaggor till configure-skriptet.

source: Clicking on <guibutton>Execute</guibutton> will run the configure script. All the output will appears in the message view of <application>Anjuta</application>. If the script runs without error, it will enable all other entries in the <guisubmenu>Build</guisubmenu> menu.
sv: Att klicka på <guibutton>Kör</guibutton> kommer köra configure-skriptet. Alla utdata kommer hamna i meddelandevyn för <application>Anjuta</application>. Om skriptet körs utan fel kommer det aktivera alla andra poster i <guisubmenu>Bygg</guisubmenu>-menyn.

source: Menu items
sv: Menyobjekt

source: The build operations in <application>Anjuta</application>, rely on <application>make</application> only like <application>Autotools</application>. It is working for non <application>Autotools</application> project too. The compile command is even working with only a C source file because <application>make</application> has some builtin rules to compile them. Here is the correspondence between the <application>Anjuta</application> menu item and <application>make</application> commands.
sv: Byggåtgärderna i <application>Anjuta</application> förlitar sig endast på <application>make</application>, som <application>Autotools</application>. Det fungerar även för projekt som inte använder <application>Autotools</application>. Kompilationskommandot fungerar även med bara en C-källkodsfil eftersom <application>make</application> har några inbyggda regler för att kompilera dem. Här är motsvarigheterna mellan <application>Anjuta</application>-menyobjekt och <application>make</application>-kommandon.

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Compile</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Kompilera</guimenu></menuchoice>

source: make <replaceable>current_file</replaceable>
sv: make <replaceable>aktuell_fil</replaceable>

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Build</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Bygg</guimenu></menuchoice>

source: cd <userinput>current_file_directory</userinput>; make
sv: cd <userinput>aktuell_filkatalog</userinput>; make

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Build Project</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Bygg projekt</guimenu></menuchoice>

source: cd <userinput>project_directory</userinput>; make
sv: cd <userinput>projektkatalog</userinput>; make

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Build Tarball</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Bygg tar-arkiv</guimenu></menuchoice>

source: cd <userinput>project_directory</userinput>; make dist
sv: cd <userinput>projektkatalog</userinput>; make dist

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Install</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Installera</guimenu></menuchoice>

source: cd <userinput>current_file_directory</userinput>; make install
sv: cd <userinput>aktuell_filkatalog</userinput>; make install

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Install Project</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Installera projekt</guimenu></menuchoice>

source: cd <userinput>project_directory</userinput>; make install
sv: cd <userinput>projektkatalog</userinput>; make install

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Clean</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Töm</guimenu></menuchoice>

source: cd <userinput>current_file_directory</userinput>; make clean
sv: cd <userinput>aktuell_filkatalog</userinput>; make clean

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Clean Project</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Töm projektet</guimenu></menuchoice>

source: cd <userinput>project_directory</userinput>; make clean
sv: cd <userinput>projektkatalog</userinput>; make clean

source: <menuchoice><guisubmenu>Build</guisubmenu><guimenu>Remove Configuration</guimenu></menuchoice>
sv: <menuchoice><guisubmenu>Bygg</guisubmenu><guimenu>Ta bort konfiguration</guimenu></menuchoice>

source: cd <userinput>project_directory</userinput>; make distclean
sv: cd <userinput>projektkatalog</userinput>; make distclean

source: The last menu entry not described above ,<menuchoice><guisubmenu>Build</guisubmenu> <guimenuitem>Select Configuration</guimenuitem></menuchoice>, allows you to switch easily between different configurations and so between different build directories.
sv: Den sista menyobjektet vilket inte beskrivs ovan, <menuchoice><guisubmenu>Bygg</guisubmenu> <guimenuitem>Välj konfiguration</guimenuitem></menuchoice>, låter dig lätt växla mellan olika konfigurationer och därmed mellan olika byggkataloger.

source: Options
sv: Alternativ

source: A few common build options are available in the preferences page that you can get by selecting <menuchoice><guisubmenu>Edit</guisubmenu> <guimenuitem>Preferences</guimenuitem><guimenuitem>Build autotools</guimenuitem> </menuchoice>.
sv: Några få vanliga byggflaggor finns tillgängliga i inställningssidan som du kan komma till genom att välja <menuchoice><guisubmenu>Redigera</guisubmenu> <guimenuitem>Inställningar</guimenuitem><guimenuitem>Bygg Autotools</guimenuitem> </menuchoice>.

source: Build preferences
sv: Bygginställningar

source: Creating a project
sv: Skapa ett projekt

source: This chapter explains how to create a new project. Like the previous, it starts with <application>Autotools</application> before looking at <application>Anjuta</application>.
sv: Detta kapitel förklarar hur du skapar ett nytt projekt. Som det tidigare startar det med <application>Autotools</application> innan det tar en titt på <application>Anjuta</application>.

source: In the first chapter, we have not really used the <application>Autotools</application>. It is not need to compile a project from the sources. But all files in the build process are not written by hand but generated from templates using <application>Autotools</application>.
sv: I det första kapitlet har vi egentligen inte just använt <application>Autotools</application> något. Det behövs inte för att kompilera ett projekt från källkoden. Men filerna i byggprocessen är inte handskrivna, utan genererade från mallar som använder <application>Autotools</application>.

source: <application>Autotools</application> is composed of several tools: <filename>aclocal</filename>, <filename>autoconf</filename>, <filename>automake</filename> and other that we will not see here, belonging to two packages: <application>Automake</application> and <application>Autoconf</application>.
sv: <application>Autotools</application> består av flera verktyg: <filename>aclocal</filename>, <filename>autoconf</filename>, <filename>automake</filename> med flera som vi inte kommer att titta på här, vilka hör till två paket: <application>Automake</application> och <application>Autoconf</application>.

source: <application>Autoconf</application> is used to generate the configure script, from a template named <filename>configure.ac</filename>. The configure script will check all characteristics of the host system and generate the makefiles from Makefile.in templates.
sv: <application>Autoconf</application> används för att generera configure-skriptet, från en mall med namnet <filename>configure.ac</filename>. configure-skriptet kommer kontrollera värdsystemets karakteristik och generera makefilerna från Makefile.in-mallar.

source: <application>Automake</application> is used to generate complete Makefile.in templates, following GNU standards from very simple Makefile.am templates.
sv: <application>Automake</application> används för att generera fullständiga Makefile.in-mallar, enligt GNU-standarder från väldigt enkla Makefile.am-mallar.

source: <application>Autotools</application> process
sv: <application>Autotools</application>-processen

source: Now let's see a minimal example to start grasping the relationships between the various files.
sv: Låt oss nu se ett minimalt exempel för att börja förstå relationerna mellan de olika filerna.

source: Write sources
sv: Skriv källor

source: Create an empty directory called <filename>tut_prog</filename> and enter in it.
sv: Skapa en tom katalog med namnet <filename>tut_prog</filename> och gå in i den.

source: In this new directory, create a new file named <filename>main.c</filename> containing:
sv: Skapa i denna nya katalog en ny fil med namnet <filename>main.c</filename> som innehåller:

source: #include &lt;stdio.h&gt; int main() { printf("Hello world!\n"); return 0; }
sv: #include &lt;stdio.h&gt; int main() { printf("Hej världen!\n"); return 0; }
