Repository: GNOME/anjuta
Catalog: manuals/anjuta-build-tutorial/*/*.po
Languages: sv

source: #include &lt;libxml/parser.h&gt; #include &lt;stdio.h&gt; int main() { xmlDocPtr doc; doc = xmlParseFile ("testfile.xml"); if (doc == NULL) { printf ("Document not parsed successfully. \n"); return -1; } else { printf ("Document parsed successfully.\n"); xmlFreeDoc(doc); return 0; } }
sv: #include &lt;libxml/parser.h&gt; #include &lt;stdio.h&gt; int main() { xmlDocPtr doc; doc = xmlParseFile ("testfil.xml"); if (doc == NULL) { printf ("Lyckades inte tolka dokumentet. \n"); return -1; } else { printf ("Dokumentet tolkades.\n"); xmlFreeDoc(doc); return 0; } }

source: Our goal is now to compile it and make it work correctly. For that purpose, we must tell <application>GCC</application> two things: where to find libxml/parser.h (that is to say, give <application>GCC</application> the right include path) and what library (i.e. shared object) it should link our project against. There are several ways to do that, I will start with the easiest.
sv: Vårt mål är nu att kompilera det och få det att fungera korrekt. För det syftet måste vi säga till <application>GCC</application> två saker: var libxml/parser.h kan hittas (det vill säga, ge <application>GCC</application> rätt inkluderingssökväg) och vilket bibliotek (d.v.s. delat objekt) det ska länka vårt projekt mot. Det finns flera sätta att göra det, jag kommer starta med det lättaste.

source: With pkg-config
sv: Med pkg-config

source: <application>pkg-config</application> is tools for developers providing a unified interface for querying installed libraries with their version and all options needed to compile and link it. It comes with an <application>Autoconf</application> macro named PKG_CHECK_MODULES allowing to check the existence of the library and set all necessary flags.
sv: <application>pkg-config</application> är utvecklarverktyg som tillhandahåller ett unifierat gränssnitt för förfrågningar till installerade bibliotek med deras version och alla flaggor som krävs för att kompilera och länka det. Det kommer med ett <application>Autoconf</application>-makro med namnet PKG_CHECK_MODULES vilket låter dig kontrollera bibliotekets existens och ställa in alla nödvändiga flaggor.

source: Add the following line in <filename>configure.ac</filename>.
sv: Lägg till följande rad i <filename>configure.ac</filename>.

source: This macro will check the existence of <application>libxml2</application> with a version higher or equal to 2.4 and create 2 variable XML_CFLAGS and XML_LIBS containing respectively, the flags for the C compiler and the linker. <userinput>XML</userinput> is an user defined name. <userinput>libxml-2.0</userinput> is the name of the library. You can run <userinput>pkg-config --list-all</userinput> to get a list of all installed libraries.
sv: Detta makro kommer kontrollera om <application>libxml2</application> finns och har version högre eller lika med 2.4 samt skapa två variabler XML_CFLAGS och XML_LIBS som innehåller flaggorna för C-kompilatorn respektive länkaren. <userinput>XML</userinput> är ett användardefinierat namn. <userinput>libxml-2.0</userinput> är namnet på biblioteket. Du kan köra <userinput>pkg-config --list-all</userinput> för att få en lista över alla installerade bibliotek.

source: Add the following lines in <filename>Makefile.am</filename>.
sv: Lägg till följande rader i <filename>Makefile.am</filename>.

source: This will use the options found by <application>configure</application> when the macro PKG_CHECK_MODULES is executed for compiling your program.
sv: Detta kommer använda flaggorna som hittas av <application>configure</application> när makrot PKG_CHECK_MODULES exekveras för att kompilera ditt program.

source: That's all. You can run <userinput>make</userinput> again.
sv: Det var allt. Du kan köra <userinput>make</userinput> igen.

source: There is no need to rerun <application>Autoconf</application> or <application>Automake</application> because the Makefile generated by it already contains some rules to do it.
sv: Det finns inget behov av att köra <application>Autoconf</application> eller <application>Automake</application> igen, för den Makefile som genererades av det innehåller redan några regler för att göra det.

source: When installed, each library supporting pkg-config copy a small text file, with .pc extension, in a system directory; normally <filename>/usr/lib/pkgconfig</filename>. If you install a library from source it will be by default in <filename>/usr/local/lib/pkgconfig</filename>. You can ask <application>pkg-config</application> to search in this directory too, by defining the environment variable <userinput> PKG_CONFIG_PATH=/usr/local/lib/pkgconfig</userinput>.
sv: När det installeras kopierar varje bibliotek som stöder pkg-config en liten textfil med filändelsen .pc till en systemkatalog, vanligen <filename>/usr/lib/pkgconfig</filename>. Om du installerar ett bibliotek från källkod kommer den som standard finnas i <filename>/usr/local/lib/pkgconfig</filename>. Du kan be <application>pkg-config</application> att söka även i denna katalog genom att definiera miljövariabeln <userinput> PKG_CONFIG_PATH=/usr/local/lib/pkgconfig</userinput>.

source: With an <application>Autoconf</application> macro
sv: Med ett <application>Autoconf</application>-makro

source: Check if the library author shipped a <application>M4</application> macro, and use it if present. It is a text file named like the library with a .m4 extension often installed in <filename>/usr/share/aclocal</filename>.
sv: Se om bibliotekets författare skickade med ett <application>M4</application>-makro, och använd det om det finns. Det är en textfil med samma namn som biblioteket med filändelsen .m4, ofta installerad i <filename>/usr/share/aclocal</filename>.

source: If your library is a basic one, it might be checked by the standard <application>Autoconf</application> macros (see the list <ulink type="http" url="http://sources.redhat.com/autobook/autobook/autobook_283.html#SEC283"> here</ulink>).
sv: Om ditt bibliotek är enkelt kan det kanske kontrolleras med standardmakrona för <application>Autoconf</application> (se listan <ulink type="http" url="http://sources.redhat.com/autobook/autobook/autobook_283.html#SEC283"> här</ulink>).

source: Perhaps the <application>M4</application> macro you need has already be programmed by someone else. Look at the contributions <ulink type="http" url="http://www.gnu.org/software/ac-archive/">here</ulink>.
sv: Kanske har <application>M4</application>-makrot du behöver redan programmerats av någon annan. Se på bidragen <ulink type="http" url="http://www.gnu.org/software/ac-archive/">här</ulink>.

source: If all that fail, go deeper in <application>M4</application>, make your own macro, and donate it to the library's author!
sv: Om allt detta misslyckas kan fördjupa dig i <application>M4</application>, skriva ditt eget makro, och skänka det till bibliotekets författare!

source: If the library does not support <application>pkg-config</application>: it does not appear in the list returned by <userinput>pkg-config --list-all</userinput>. You need a <application>Autoconf</application> macro: <_:itemizedlist-1/>
sv: Om biblioteket inte stöder <application>pkg-config</application>: det kommer inte dyka upp i listan som returneras av <userinput>pkg-config --list-all</userinput>. Du behöver ett <application>Autoconf</application>-makro: <_:itemizedlist-1/>

source: When, you have this macro, you can copy it in <filename>/usr/share/aclocal</filename>, so <application>aclocal</application> will find it. Then, you just need to look in the macro file to see how to use it. <application>libxml2</application> installs a macro named AM_PATH_XML2 which is in <filename>/usr/share/aclocal/libxml.m4</filename>.
sv: När du har detta makro kan du kopiera det till <filename>/usr/share/aclocal</filename> så att <application>aclocal</application> kommer hitta det. Sedan behöver du bara titta i makrofilen för att se hur du ska använda det. <application>libxml2</application> installerar ett makro med namnet AM_PATH_XML2 som är i <filename>/usr/share/aclocal/libxml.m4</filename>.

source: This macro will check the existence of the library with a version higher or equal to 2.4 and create 2 variable XML_CPPFLAGS and XML_LIBS containing respectively, the flags for the C compiler and the linker. You get these information from the comments in the macro file.
sv: Detta makro kommer kontrollera om biblioteket finns och har version högre eller lika med 2.4 samt skapa två variabler XML_CPPFLAGS och XML_LIBS som innehåller flaggorna för C-kompilatorn respektive länkaren. Du får denna information från kommentarerna i makrofilen.

source: This will use the options found by configure for compiling your program. Note that the macro defined XML_CPPFLAGS instead of XML_CFLAGS with <application>pkg-config</application>. Using CPPFLAGS makes more sense, because these flags are used by the C preprocessor, most of the time only to setup the path of the include files.
sv: Detta kommer använda flaggorna som hittas av configure för att kompilera ditt program. Observera att makrot definierade XML_CPPFLAGS istället för XML_CFLAGS med <application>pkg-config</application>. Att använda CPPFLAGS är vettigare, då dessa flaggor används av C-preprocessorn, för det mesta bara för att konfigurera sökvägen för inkluderingsfilerna.

source: That's all. You can run <userinput>make</userinput> again. The generated <filename>Makefile</filename> is almost the same.
sv: Det var allt. Du kan köra <userinput>make</userinput> igen. Din genererade <filename>Makefile</filename> är nästan densamma.

source: With hardcoded library path
sv: Med hårdkodad bibliotekssökväg

source: It is the approach one could naturally have: let's give <application>GCC</application> the stuff it needs directly ! On my system, <filename>libxml/parser.h</filename> is in <filename class="directory">/usr/include/libxml2</filename>, and the shared object is 'libxml.so', located in <filename>/usr/lib</filename>. (I will assume it's all the same for you).
sv: Det är det tillvägagångssätt man naturligt skulle kunna komma till: vi ger <application>GCC</application> allt det behöver direkt! På mitt system är <filename>libxml/parser.h</filename> i <filename class="directory">/usr/include/libxml2</filename>, och det delade objektet är ”libxml.so”, vilket finns i <filename>/usr/lib</filename>. (Jag kommer anta att detsamma gäller för dig).

source: There is no need to change <filename>configure.ac</filename> because you don't check anything and just assume that all host system will have the right library in the same place than you.
sv: Det finns inget behov av att köra <filename>configure.ac</filename> för du kontrollerar inte något och antar bara att alla värdsystem kommer ha rätt bibliotek på samma plats som du.

source: You can run <userinput>make</userinput> and it should work if you have the same system than me.
sv: Du kan köra <userinput>make</userinput> så bör det fungera om du har samma system som mig.

source: It is not portable to various linuxes: perhaps on other distribution the include path is different.
sv: Det är inte porterbart till olika linuxsystem: i andra distributioner kan inkluderingssökvägen vara annorlunda.

source: If the next versions of libxml have different paths, or different needed libraries, we will need to update the project.
sv: Om kommande versioner av libxml använder andra sökvägar, eller behöver andra bibliotek, så kommer vi behöva uppdatera projektet.

source: We don't test whether the system of the packager/user has the library.
sv: Vi testar inte huruvida paketerarens/användarens system har biblioteket.

source: We cannot check the version of the <application>libxml2</application> we use.
sv: Vi kan inte kontrollera versionen av <application>libxml2</application> som vi använder.

source: I have described this here to show that it is possible to do simple thing using <application>Autotools</application>. But this approach has several drawbacks: <_:itemizedlist-1/>
sv: Jag har beskrivit detta här för att visa att det är möjligt att göra enkla saker med <application>Autotools</application>. Men detta tillvägagångssätt har flera nackdelar: <_:itemizedlist-1/>

source: With <application>Anjuta</application> adding a library supporting <application>pkg-config</application> can be almost done without the keyboard.
sv: Med <application>Anjuta</application> kan tillägg av ett bibliotek som stöder <application>pkg-config</application> nästan göras utan tangentbordet.

source: Open the file <filename>main.c</filename> of the <application>Anjuta</application> project created in the previous chapter. Replace it with the following text:
sv: Öppna filen <filename>main.c</filename> för <application>Anjuta</application>-projektet som skapades i det föregående kapitlet. Ersätt den med följande text:

source: Select <menuchoice><guisubmenu>Project</guisubmenu> <guimenuitem>Properties</guimenuitem><guilabel>Packages</guilabel></menuchoice>, to get the package properties dialog.
sv: Välj <menuchoice><guisubmenu>Projekt</guisubmenu> <guimenuitem>Egenskaper</guimenuitem><guilabel>Paket</guilabel></menuchoice> för att få fram paketegenskapsdialogen.

source: Click on <guibutton>Add module</guibutton> button and Enter a name in the <guilabel>Module/Package</guilabel> column, "XML" by example.
sv: Klicka på knappen <guibutton>Lägg till modul</guibutton> och ange ett namn i kolumnen <guilabel>Modul/Paket</guilabel>, exempelvis ”XML”.

source: Click on <guibutton>Add Package</guibutton> button that should be enabled now. You get the a dialog where you can select the library that you want to use. This dialog list all libraries supporting <application>pkg-config</application>. Select <userinput>libxml-2.0</userinput>. Then click on <guibutton>Add</guibutton> button.
sv: Klicka på knappen <guibutton>Lägg till paket</guibutton> som nu bör vara aktiverad. Du kommer då visas en dialogruta där du kan välja biblioteket som du vill använda. Denna dialogruta listar alla bibliotek som stöder <application>pkg-config</application>. Välj <userinput>libxml-2.0</userinput>. Klicka sedan på knappen <guibutton>Lägg till</guibutton>.

source: The package properties dialog should look like the following:
sv: Paketegenskapsdialogen bör se ut som följande:

source: Project package properties dialog
sv: Paketegenskapsdialog för projekt

source: The module XML contains one library named libxml-2.0. You can define a minimum version required by clicking in the version column and writing <userinput>&gt;= 2.4</userinput>. All this operation add the necessary lines in the file <filename>configure.ac</filename>.
sv: Modulen XML innehåller ett bibliotek med namnet libxml-2.0. Du kan definiera en lägsta version som krävs genom att klicka i versionskolumnen och skriva <userinput>&gt;= 2.4</userinput>. Denna åtgärd lägger till de nödvändiga raderna i filen <filename>configure.ac</filename>.

source: Close the dialog and select <menuchoice><guisubmenu>Project</guisubmenu> <guimenuitem>Refresh</guimenuitem></menuchoice>. This should not be needed but is necessary with the current version of <application>Anjuta</application>. This bug has already been reported (#541694) and will be fixed soon
sv: Stäng dialogrutan och välj <menuchoice><guisubmenu>Projekt</guisubmenu> <guimenuitem>Uppdatera</guimenuitem></menuchoice>. Detta borde inte behövas men är nödvändigt med aktuell version av <application>Anjuta</application>. Detta fel har rapporterats (#541694) och kommer snart fixas

source: In the project view, select the project target tutprog and click on right button to get a context menu and select Properties. You will get the target properties dialog.
sv: Välj i projektvyn projektmålet tutprog och klicka på högerknappen för att få en snabbvalsmeny och välj Egenskaper. Du kommer att få se målegenskapsdialogen.

source: This dialog will list all modules available in your project, just check the XML module. This will modify the file <filename>Makefile.am</filename> to use the right library.
sv: Denna dialogruta kommer lista alla moduler som finns i ditt projekt, se bara XML-modulen. Detta kommer ändra filen <filename>Makefile.am</filename> så att den använder rätt bibliotek.

source: Target properties dialog
sv: Målegenskapsdialogen

source: Click on <guibutton>Close</guibutton> and that's all. You can select <menuchoice><guisubmenu>Build</guisubmenu> <guimenuitem>Build</guimenuitem></menuchoice> to rebuild your project.
sv: Klicka på <guibutton>Stäng</guibutton> så är det klart. Du kan välja <menuchoice><guisubmenu>Bygg</guisubmenu> <guimenuitem>Bygg</guimenuitem></menuchoice> för att bygga ditt projekt på nytt.

source: Without pkg-config
sv: Utan pkg-config

source: <application>Anjuta</application> has no real support for library not using <application>pkg-config</application>. You need to edit the <filename>configure.ac</filename> directly to add all necessary macros. For passing flags to each target you can select the <guibutton>Advanced</guibutton> button in the target properties dialog.
sv: <application>Anjuta</application> har inget riktigt stöd för bibliotek som inte använder <application>pkg-config</application>. Du behöver redigera <filename>configure.ac</filename> direkt för att lägga till alla nödvändiga makron. För att skicka flaggor till varje mål kan du välja knappen <guibutton>Avancerat</guibutton> i målegenskapsdialogen.

source: Resources
sv: Resurser

source: Here are some links to reference documents dealing with <application>Autotools</application> in general and <application>Autoconf</application> and <application>Automake</application> in particular.
sv: Här är några länkar till referensdokument som hanterar <application>Autotools</application> i allmänhet och <application>Autoconf</application> och <application>Automake</application> i synnerhet.

source: English
sv: Engelska

source: First, you can take a look at the <ulink type="http" url="http://www.gnu.org/software/autoconf/manual/autoconf.html"> Autoconf</ulink>, <ulink type="http" url="http://www.gnu.org/software/automake/manual/automake.html"> Automake</ulink>, <ulink type="http" url="http://www.gnu.org/software/libtool/manual/libtool.html"> Libtool</ulink>, <ulink type="http" url="http://www.gnu.org/software/make/manual/make.html"> make</ulink> and <ulink type="http" url="http://www.gnu.org/software/m4/manual/m4.html"> M4</ulink> manuals.
sv: Först kan du ta en titt på handböckerna för <ulink type="http" url="http://www.gnu.org/software/autoconf/manual/autoconf.html"> Autoconf</ulink>, <ulink type="http" url="http://www.gnu.org/software/automake/manual/automake.html"> Automake</ulink>, <ulink type="http" url="http://www.gnu.org/software/libtool/manual/libtool.html"> Libtool</ulink>, <ulink type="http" url="http://www.gnu.org/software/make/manual/make.html"> make</ulink> och <ulink type="http" url="http://www.gnu.org/software/m4/manual/m4.html"> M4</ulink>.

source: The <ulink type="http" url="http://sources.redhat.com/autobook/autobook/autobook_toc.html"> Autobook</ulink> explains in details how the <application>Autotools</application> work.
sv: <ulink type="http" url="http://sources.redhat.com/autobook/autobook/autobook_toc.html">Autobook</ulink> förklarar i detalj hur <application>Autotools</application> fungerar.

source: Amongst the various GNU development tools you are told about, <ulink type="http" url="http://autotoolset.sourceforge.net/tutorial.html"> here</ulink> are <application>Autoconf</application> and <application>Automake</application>.
sv: Bland de olika GNU-utvecklingsverktygen du får höra om så finns <application>Autoconf</application> och <application>Automake</application> <ulink type="http" url="http://autotoolset.sourceforge.net/tutorial.html"> här</ulink>.

source: <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Here</ulink> and <ulink url="http://seul.org/docs/autotut/">here</ulink> are two other tutorials about <application>Autotools</application>.
sv: <ulink url="http://www.lrde.epita.fr/~adl/autotools.html">Här</ulink> och <ulink url="http://seul.org/docs/autotut/">här</ulink> finns två andra handledningar om <application>Autotools</application>.

source: French
sv: Franska

source: <ulink type="http" url="http://www.infres.enst.fr/~dax/polys/configure/slide1.html"> Here</ulink> are some slides by a teacher from Ecole Nationale Supérieure des Télecoms about the <application>Autotools</application>.
sv: <ulink type="http" url="http://www.infres.enst.fr/~dax/polys/configure/slide1.html"> Här</ulink> finns några bildspel av en lärare på Ecole Nationale Supérieure des Télecoms om <application>Autotools</application>.

source: Japanese
sv: Japanska

source: <ulink type="http" url="http://larse-gtk.hp.infoseek.co.jp/automake.html"> A tutorial about <application>Autoconf</application> and <application>Automake</application> </ulink>.
sv: <ulink type="http" url="http://larse-gtk.hp.infoseek.co.jp/automake.html"> En handledning om <application>Autoconf</application> och <application>Automake</application> </ulink>.

source: This tutorial uses <application>Autoconf 2.61 (November 2006)</application> and <application>Automake 1.10.1 (January 2008)</application>. Some of these documentations uses older versions. the syntaxes could have changed quite a bit. These old syntaxes usually still work and are used in old project. It is useful to know them but it is a bad idea to use them in a new project.
sv: Denna handledning använder <application>Autoconf 2.61 (November 2006)</application> och <application>Automake 1.10.1 (Januari 2008)</application>. Vissa av dessa dokument använder äldre versioner. Syntax kan ha förändrats en hel del. Dessa gamla syntaxer fungerar vanligen fortfarande och används i gamla projekt. Det är användbart att känna till dem men en dålig idé att använda dem i ett nytt projekt.
