Repository: GNOME/anjuta
Catalog: manuals/anjuta-build-tutorial/*/*.po
Languages: sv

source: Run <application>Autoconf</application>
sv: Kör <application>Autokonfiguration</application>

source: Write the following in a file named <filename>configure.ac</filename>:
sv: Skriv följande i en fil med namnet <filename>configure.ac</filename>:

source: The configure template script could be named <filename>configure.in</filename>. It is the name used in older version (before 2001) of <application>Autoconf</application>. Nevertheless, it is recommended to use <filename>configure.ac</filename> because the <filename>.in</filename> extension is already used by files processed by <application>configure</application> and generated by <application>Automake</application>: <filename>Makefile.in</filename> and <application>autoheader</application>: <filename>config.h.in</filename>.
sv: Konfigurationsmallskriptet kan ges namnet <filename>configure.in</filename>. Det är namnet som används i den äldre versionen (innan 2001) av <application>Autoconf</application>. Det rekommenderas dock att använda <filename>configure.ac</filename> eftersom filändelsen <filename>.in</filename> redan används av filer som bearbetas av <application>configure</application> och genereras av <application>Automake</application>: <filename>Makefile.in</filename> och <application>autoheader</application>: <filename>config.h.in</filename>.

source: AC_INIT, AM_INIT_AUTOMAKE, etc... are <application>M4</application> macros. <application>M4</application> is a macro expanding software used by <application>Autotools</application>; we don't need to know about it. When <application>Autoconf</application> will process this configure.in, the macros will be expanded and we will get a fresh huge configure script.
sv: AC_INIT, AM_INIT_AUTOMAKE o.s.v. är <application>M4</application>-makron. <application>M4</application> är makroexpansionsprogramvara som används av <application>Autotools</application>, vi behöver inte känna till den närmare. När <application>Autoconf</application> bearbetar denna configure.in kommer makrona att expanderas och vi kommer att få ett helt nytt, enormt configure-skript.

source: Is the first mandatory macro. We need to indicate the name of the project and its version.
sv: Är det första obligatoriska makrot. Vi behöver ange projektets namn och version.

source: Initialize environment for <application>Automake</application>. It is needed in all projects using <application>Automake</application>.
sv: Initiera miljön för <application>Automake</application>. Det behövs i alla projekt som använder <application>Automake</application>.

source: Determine the C compiler to use.
sv: Avgör C-kompilatorn att använda.

source: Create each file by copying the corresponding template file (with .in extension) and substituting the output variable values.
sv: Skapa varje fil genom att kopiera motsvarande mallfil (med filändelsen .in) och ersätt värdena för utmatningsvariablerna.

source: Marks the end of the configure template.
sv: Markerar slutet av configure-mallen.

source: The use of some macros has changed between different versions of <application>Autoconf</application>:
sv: Användningen av vissa makron har ändrats mellan olika versioner av <application>Autoconf</application>:

source: The package name and version was defined as arguments of AM_INIT_AUTOMAKE instead of AC_INIT.
sv: Paketets namn och version definierades som argument för AM_INIT_AUTOMAKE istället för AC_INIT.

source: AC_OUTPUT was getting the list of generated files instead of using the additional macro AC_CONFIG_FILES.
sv: AC_OUTPUT fick listan över genererade filer istället för att använda det ytterligare makrot AC_CONFIG_FILES.

source: <application>Autoconf</application> only knows its own macros but read additional ones in a file named <filename>aclocal.m4</filename>. These macros are used to extend <application>Autoconf</application>, it includes <application>Automake</application> macro (starting with AM_) and other third party macros. For instance, if you develop a library called foo, you might want to write an AC_CHECK_FOR_FOO macro so that developers using your library can check for its presence using <application>Autoconf</application>.
sv: <application>Autoconf</application> känner bara till sina egna makron men läser ytterligare sådana i en fil med namnet <filename>aclocal.m4</filename>. Dessa makron används för att utöka <application>Autoconf</application>, och innehåller <application>Automake</application>-makron (börjar med AM_) och andra makron från tredje part. Om du exempelvis skapar ett bibliotek med namnet foo kan du vilja skriva ett makro AC_CHECK_FOR_FOO så att utvecklare som använder ditt bibliotek kan kontrollera om det finns med <application>Autoconf</application>.

source: <application>aclocal</application> scans <filename>configure.ac</filename> and create an <filename>aclocal.m4</filename> file which contains the macros mentioned in <filename>configure.ac</filename>. <application>aclocal</application> is part of the <application>Automake</application> package and search by default in <application>Automake</application> macros and in a system path typically <filename>/usr/share/aclocal</filename>.
sv: <application>aclocal</application> läser av <filename>configure.ac</filename> och skapar en fil <filename>aclocal.m4</filename> som innehåller de makron som nämns i <filename>configure.ac</filename>. <application>aclocal</application> är en del av <application>Automake</application>-paketet och söker som standard i <application>Automake</application>-makron och i en systemsökväg, vanligen <filename>/usr/share/aclocal</filename>.

source: Launch <userinput>aclocal</userinput>. It will create a new file named <filename>aclocal.m4</filename> in the current directory.
sv: Kör <userinput>aclocal</userinput>. Det kommer skapa en fil med namnet <filename>aclocal.m4</filename> i aktuell katalog.

source: Launch <userinput>autoconf</userinput>. It will create the configure script <filename>configure</filename>.
sv: Kör <userinput>autoconf</userinput>. Det kommer skapa konfigurationsskriptet <filename>configure</filename>.

source: On my system, I actually get an extra directory called <filename>autom4te.cache</filename>. That is for <application>Autoconf</application> internal purposes. You do not need to care about it.
sv: På mitt system får jag faktiskt en extra katalog med namnet <filename>autom4te.cache</filename>. Den är för interna <application>Autoconf</application>-syften. Du behöver inte bry dig om den.

source: Run <application>Automake</application>
sv: Kör <application>Automake</application>

source: Write the following in a file named <filename>Makefile.am</filename>:
sv: Skriv följande i en fil med namnet <filename>Makefile.am</filename>:

source: In Makefile.am are the very essential data needed to build the project: the target program, called tut_prog, will be put in a $prefix/bin/ directory; to build it we need main.c. Note that we don't specify <emphasis>how</emphasis> that will be built: <application>Automake</application> will figure it out. We haven't even mentioned the compiler in this pre-makefile.
sv: I Makefile.am finns de väsentliga data som behövs för att bygga projektet: målprogrammet som kallas tut_prog kommer läggas i en katalog $prefix/bin/; för att bygga det behöver vi main.c. Observera att vi inte specificerar <emphasis>hur</emphasis> det kommer byggas: <application>Automake</application> kommer räkna ut det. Vi har inte ens nämnt kompilatorn i denna för-makefil.

source: Makefile.am will be processed by <application>Automake</application>; the result will be a Makefile.in. This Makefile.in is close to being a real makefile, but it contains variable names which will be replaced when the configure script will run, resulting in a real makefile (called Makefile). For instance, <filename>configure</filename> will write in the final Makefile what compiler to use (it is the compiler it found using the AC_PROG_CC macro).
sv: Makefile.am kommer behandlas av <application>Automake</application>, resultatet kommer vara en Makefile.in. Denna Makefile.in är närapå en riktig makefil, men den innehåller variabelnamn som kommer ersättas när konfigurationsskriptet kommer köras, vilket resulterar i en riktig makefil (med namnet Makefile). Exempelvis kommer <filename>configure</filename> skriva i den slutgiltiga makefilen vilken kompilator som ska användas (det är kompilatorn det hittade med makrot AC_PROG_CC).

source: Run the command <userinput>automake --add-missing --foreign</userinput>. It will create a new file named <filename>Makefile.in</filename> as expected. Moreover, due to the switch <parameter>--add-missing</parameter> you get a few links to scripts necessary for building the project: <filename>depcomp</filename>, <filename>install.sh</filename> and <filename>missing</filename>. The other option <parameter>--foreign</parameter> tells to <application>Automake</application> that you don't want to follow GNU standard and you don't need mandatory documentation files: <filename>INSTALL</filename>, <filename>NEWS</filename>, <filename>README</filename>, <filename>AUTHORS</filename>, <filename>ChangeLog</filename> and <filename>COPYING</filename>. I have used it here to keep the number of created file to a minimum but else it is a good idea to provide these files, you can start with empty files.
sv: Kör kommandot <userinput>automake --add-missing --foreign</userinput>. Det kommer som väntat skapa en ny fil med namnet <filename>Makefile.in</filename>. Du kommer vidare på grund av flaggan <parameter>--add-missing</parameter> få några länkar till skript som är nödvändiga för att bygga projektet: <filename>depcomp</filename>, <filename>install.sh</filename> och <filename>missing</filename>. Den andra flaggan <parameter>--foreign</parameter> säger till <application>Automake</application> att du inte vill följa GNU-standarden och att du inte behöver obligatoriska dokumentationsfiler: <filename>INSTALL</filename>, <filename>NEWS</filename>, <filename>README</filename>, <filename>AUTHORS</filename>, <filename>ChangeLog</filename> och <filename>COPYING</filename>. Jag har använt detta här för att minimera antalet skapade filer men annars är det en god idé att tillhandahålla dessa filer, du kan starta med tomma filer.

source: Build project
sv: Bygg projekt

source: Run now the new configure script: <userinput>./configure</userinput>. You get the following output and it create the makefile for your program.
sv: Kör nu det nya konfigurationsskriptet: <userinput>./configure</userinput>. Du får följande utmatning och det skapar makefilen för ditt program.

source: Run now <userinput>make</userinput>, to build your program. You get the following output and a new tut_prog executable
sv: Kör nu <userinput>make</userinput> för att bygga ditt program. Du får följande utmatning och en ny exekverbar fil tut_prog

source: Now, if you can write in <filename>/usr/local/bin</filename>, run <userinput>make install</userinput> to install your program. Else you need to log as root before or use <application>sudo</application> and run <userinput>sudo make install</userinput>. You should get.
sv: Om du kan skriva i <filename>/usr/local/bin</filename> kan du nu köra <userinput>make install</userinput> för att installera ditt program. Annars behöver du logga in som root först eller använda <application>sudo</application> och köra <userinput>sudo make install</userinput>. Du bör då få:

source: Then, if <filename>/user/local/bin</filename> is in your path, you can run your program from everywhere.
sv: Sedan kan du om <filename>/user/local/bin</filename> finns i din miljövariabel PATH köra ditt program varifrån du vill.

source: Clean project
sv: Töm projekt

source: The program is installed, so you can clean the build directory running <userinput>make clean</userinput>. It removes all object files and the program but not the makefiles.
sv: Programmet är installerat, så du kan tömma byggkatalogen genom att köra <userinput>make clean</userinput>. Det tar bort alla objektfiler och programmet, men inte makefilerna.

source: You can still run the program installed in <filename>/user/local/bin</filename>.
sv: Du kan fortfarande köra programmet som installerats i <filename>/user/local/bin</filename>.

source: To remove the installed program, run <userinput>make uninstall</userinput>. Like for the installation, you need to use have the writing right in the directory or use <application>su</application> or <application>sudo</application>.
sv: För att ta bort det installerade programmet, kör <userinput>make uninstall</userinput>. Som för installationen behöver du skrivrättigheter i katalogen eller använda <application>su</application> eller <application>sudo</application>.

source: Generate project
sv: Generera projekt

source: Running <userinput>aclocal</userinput>, <userinput>automake</userinput> and <userinput>autoconf</userinput> one by one is fine for a tutorial to understand exactly what's happen. But, for a real work, it's a bit tedious especially because there are other tools those could be needed like <userinput>autoheader</userinput>, <userinput>autopoint</userinput> or <userinput>libtoolize</userinput>. After creating the project, the makefiles generated by <application>configure</application> should take care of regenerating <filename>configure</filename> and all <filename>Makefile.in</filename>. Anyway, this lets a room for improvement and there are even two responses to this:
sv: Att köra <userinput>aclocal</userinput>, <userinput>automake</userinput> och <userinput>autoconf</userinput> en efter en är acceptabelt för en handledning för att förstå exakt vad som händer. Men det är lite långdraget för verkligt arbete, särskilt då det skulle kunna behövas andra verktyg så som <userinput>autoheader</userinput>, <userinput>autopoint</userinput> eller <userinput>libtoolize</userinput>. Efter att ha skapat projektet, bör makefilerna som skapats av <application>configure</application> ta hand om att generera <filename>configure</filename> och hela <filename>Makefile.in</filename> på nytt. Detta lämnar i vilket fall rum för förbättring och det finns till och med två svar på detta:

source: It is another tool part of the <application>Autoconf</application> package which is running all scripts in the right order. To start a new project, you can just run <userinput>autoreconf --install</userinput> and it will call all necessary commands.
sv: Det är ett annat verktyg som är en del av <application>Autoconf</application>-paketet och kör alla skript i rätt ordning. För att starta ett nytt projekt kan du helt enkelt köra <userinput>autoreconf --install</userinput> så kommer det anropa alla nödvändiga kommandon.

source: It is a script not part of <application>Autotools</application>, that it doing the same thing. There is one named <filename>gnome-autogen.sh</filename> which comes with GNOME common development package but other project can write their own ones.
sv: Det är ett skript som inte är en del av <application>Autotools</application>, som gör samma sak. Det finns ett med namnet <filename>gnome-autogen.sh</filename> som kommer med GNOME:s gemensamma utvecklingspaket, men andra projekt kan skriva sina egna.

source: Creating a project with <application>Anjuta</application> need just a few clicks but then we will take a look at the created files.
sv: Att skapa ett projekt med <application>Anjuta</application> tar bara några få klick, men vi kommer sedan ta en titt på de skapade filerna.

source: Create a new project
sv: Skapa ett nytt projekt

source: Click on <menuchoice><guisubmenu>File</guisubmenu><guisubmenu>New</guisubmenu> <guimenuitem>Project</guimenuitem></menuchoice>. The new project assistant appears.
sv: Klicka på <menuchoice><guisubmenu>Arkiv</guisubmenu><guisubmenu>Ny</guisubmenu> <guimenuitem>Projekt</guimenuitem></menuchoice>. Assistenten för nya projekt visas.

source: Click on <guibutton>Forward</guibutton>. The project selection page appears:
sv: Klicka på <guibutton>Framåt</guibutton>. Projektvalssidan visas:

source: Project selection page
sv: Projektvalssida

source: Select <guilabel>Generic (minimal)</guilabel> project in the <guilabel>C</guilabel> page.
sv: Välj projektet <guilabel>Allmänt (minimalt)</guilabel> på <guilabel>C</guilabel>-sidan.

source: Click on <guibutton>Forward</guibutton>.
sv: Klicka på <guibutton>Framåt</guibutton>.

source: Project basic information page
sv: Sida med grundläggande information för projekt

source: Change <guilabel>Project Name</guilabel> to <userinput>tutprog</userinput>, the project name should contains only alpha numeric characters or underscore. Fill the remaining field.
sv: Ändra <guilabel>Projektnamn</guilabel> till <userinput>tutprog</userinput>, porojektnamnet ska bara innehålla alfanumeriska tecken eller understreck. Fyll i det kvarvarande fältet.

source: Click on <guilabel>Forward</guilabel>.
sv: Klicka på <guilabel>Framåt</guilabel>.

source: Project options page
sv: Sida med projektalternativ

source: Click on <guilabel>Destination</guilabel> and create a new directory named tutprog for your new project. You need to avoid space in the directory name. Then, keep all other options to their default value to get a minimal project.
sv: Klicka på <guilabel>Mål</guilabel> och skapa en ny katalog med namnet tutprog för ditt nya projekt. Du måste undvika blanksteg i katalognamnet. Låt alla andra alternativ behålla sina standardvärden för ett minimalt projekt.

source: Project summary page
sv: Sida med projektsammanfattning

source: This is the final page of the assistant, check that everything is right.
sv: Detta är assistentens sista sida, kontrollera att allt stämmer.

source: Click on <guibutton>Forward</guibutton>. <application>Anjuta</application> will create all needed files and directories, in the message window, you will see the following:
sv: Klicka på <guibutton>Framåt</guibutton>. <application>Anjuta</application> kommer skapa alla behövda filer och kataloger, i meddelandefönstret kommer du se följande:

source: Project creation messages
sv: Meddelanden för projektskapande

source: Then, autogen.sh is called and run the configure script. Finally <application>Anjuta</application> open the new project. You can directly build the project, as the main source contains a few lines of C and configure has been run.
sv: Sedan anropas autogen.sh och kör konfigurationsskriptet. <application>Anjuta</application> öppnar slutligen det nya projektet. Du kan bygga projektet direkt, då huvudkällan innehåller några få rader C och configure har körts.

source: Looking at configure.ac
sv: En titt på configure.ac

source: <application>Anjuta</application> minimal configure.ac:
sv: Minimal configure.ac från <application>Anjuta</application>:

source: It is still quite simple with a bit more macros. Let's look at all unknown ones:
sv: Den är fortfarande rätt enkel med några fler makron. Låt oss ta en titt på de okända:

source: It is not a macros, just the marker to start a comment in <application>M4</application>, the language used to write <filename>configure.ac</filename>. It is like '#' is scripts or '//' in C++.
sv: Det är inte ett makro, bara markören för att starta en kommentar i <application>M4</application>, språket som används för att skriva <filename>configure.ac</filename>. Det är som ”#” i skript eller ”//” i C++.

source: The AC_INIT macro uses the new form with package and version but AM_INIT_AUTOMAKE keeps the old one. It is not needed anymore.
sv: AC_INIT-makrot använder den nya formen med paket och version men AM_INIT_AUTOMAKE behåller den gamla. Det behövs inte längre.

source: This tells <application>Autoconf</application> to pass all defines in a file named <filename>config.h</filename> instead of using several -Dxxxx flags on the command line (see <xref linkend="create-autotools-build"/>). It is easier when there are lots of them. A file named <filename>config.h.in</filename> is created automatically from the <filename>configure.ac</filename> using <application>autoheader</application>. Then <filename>config.h</filename> is created automatically like makefiles by <application>configure</application>. So it is painless for the developer.
sv: Detta säger till <application>Autoconf</application> att skicka alla definitioner i en fil med namnet <filename>config.h</filename> istället för flera flaggor -Dxxxx på kommandoraden (se <xref linkend="create-autotools-build"/>). Det är lättare då det finns många av dem. En fil med namnet <filename>config.h.in</filename> skapas automatiskt från <filename>configure.ac</filename> med <application>autoheader</application>. Sedan skapas <filename>config.h</filename> automatiskt som makefiler av <application>configure</application>. Så det är utan ansträngning för utvecklaren.

source: This is the old form of the AC_OUTPUT, where you specify all output files instead of using AC_CONFIG_FILES.
sv: Detta är den gamla formen för AC_OUTPUT, där du anger alla utmatningsfiler istället för att använda AC_CONFIG_FILES.

source: Looking at Makefile.am
sv: En titt på Makefile.am

source: <application>Anjuta</application> minimal Makefile.am:
sv: Minimal Makefile.am från <application>Anjuta</application>:

source: Not much things in the <filename>Makefile.am</filename> neither:
sv: Inte mycket i <filename>Makefile.am</filename> heller:

source: It is used to give additional flags to the C preprocessor. Here it defines an additional PACKAGE_DATA_DIR constant set by <application>configure</application>
sv: Används för att ge ytterligare flaggor till C-preprocessorn. Här definierar det en ytterligare PACKAGE_DATA_DIR-konstant som ställs in av <application>configure</application>

source: It defines some additional flags for the C compiler: all warning and add debugging information that we have already seen at the beginning of this tutorial (see <xref linkend="build-gcc"/>)
sv: Det definierar några ytterligare flaggor för C-kompilatorn: all varnings- och felsökningsinformation som vi redan sett i början av denna handledning (se <xref linkend="build-gcc"/>)

source: It adds a places where you can put additional linker options for the tutprog program.
sv: Det lägger till en plats där du kan lägga ytterligare länkaralternativ för programmet tutprog.

source: It adds a places where you can put additional libraries for the tutprog program.
sv: Det lägger till en plats där du kan lägga ytterligare bibliotek för programmet tutprog.

source: Adding a library
sv: Lägga till ett bibliotek

source: This chapter explains how to add a new library to a project. It starts with <application>Autotools</application> before looking at <application>Anjuta</application>.
sv: Detta kapitel förklarar hur du lägger till ett nytt bibliotek till ett projekt. Det startar med <application>Autotools</application> innan det tar en titt på <application>Anjuta</application>.

source: Adding a new library in a autotools project could be more or less easy depending on how the library is packaged. To take an example, imagine that we want to read an xml file using <application>libxml2</application> (see its <ulink type="http" url="www.xmlsoft.org">homepage at www.xmlsoft.org</ulink>)
sv: Att lägga till ett nytt bibliotek i ett autotools-projekt kan vara mer eller mindre lätt beroende på hur biblioteket paketeras. För att ta ett exempel, anta att vi vill läsa en xml-fil med <application>libxml2</application> (se dess <ulink type="http" url="www.xmlsoft.org">webbplats på www.xmlsoft.org</ulink>)

source: Open the old tutorial project and replace <filename>main.c</filename> by the following.
sv: Öppna det gamla handledningsprojektet och ersätt <filename>main.c</filename> med följande.

source: main.c using <application>libxml2</application>:
sv: main.c som använder <application>libxml2</application>:
