Repository: GNOME/anjuta
Catalog: manuals/anjuta-build-tutorial/*/*.po
Languages: sv

# _
source: translator-credits
sv: Erik Sköldås <erik.skoldas@tele2.se>, 2019 Anders Jonsson <anders.jonsson@norsjovallen.se>, 2021

source: Anjuta build tutorial
sv: Bygghandledning för Anjuta

source: Permission is granted to copy, distribute and/or modify this document under the terms of the <citetitle>GNU Free Documentation License</citetitle>, Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You may obtain a copy of the <citetitle>GNU Free Documentation License</citetitle> from the Free Software Foundation by visiting <ulink type="http" url="http://www.fsf.org">their Web site</ulink> or by writing to: Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
sv: Tillstånd att kopiera, distribuera och/eller modifiera detta dokument ges under villkoren i <citetitle>GNU Free Documentation License</citetitle>, version 1.1 eller senare, utgivet av Free Software Foundation utan standardavsnitt och omslagstexter. Du kan få en kopia av <citetitle>GNU Free Documentation License</citetitle> från Free Software Foundation genom att besöka <ulink type="http" url="http://www.fsf.org">deras webbplats</ulink> eller genom att skriva till: Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and those trademarks are made aware to the members of the GNOME Documentation Project, the names have been printed in caps or initial caps.
sv: Många av namnen som används av företag för att skilja på deras produkter och tjänster är registrerade varumärken. I de fall dessa namn förekommer i GNOME-dokumentation - och medlemmarna i GNOME-dokumentationsprojektet är medvetna om dessa varumärken - är de skrivna med versaler eller med inledande versal.

source: This is version 0.2 of Anjuta build tutorial
sv: Det här är version 0.2 av Anjutas bygghandledning

source: Introduction
sv: Introduktion

source: If you come from the Windows world, when you first launched <application>Anjuta</application>, you can told yourself : "Hey, that looks like MS Visual C++, as I know it pretty well, understanding <application>Anjuta</application> will be a piece of cake.". <application>Anjuta</application> looks like <application>Microsoft Visual Studio</application> or <application>Borland's C++ Builder</application>. but it has some significative differences essentially in its build system.
sv: Om du kommer från Windows-världen, sa du kanske så här till dig själv när du första gången startade <application>Anjuta</application>: ”Vänta nu, det ser ut som MS Visual C++ som jag känner till ganska bra, att sätta mig in i <application>Anjuta</application> kommer inte vara några problem.”. <application>Anjuta</application> ser ut som <application>Microsoft Visual Studio</application> eller <application>Borlands C++Builder</application>. Men det har några signifikanta skillnader, i huvudsak i sitt byggsystem.

source: If you are starting programming directly on GNU/Linux, you have probably already heard of the <application>Autotools</application>. They are a major and probably a bit intimidating part of the development environment.
sv: Om du börjar programmera direkt i GNU/Linux så har du antagligen redan hört talas om <application>Autotools</application>. De är en viktig och förmodligen lite skrämmande del i utvecklingsmiljön.

source: The goal of <application>Anjuta</application> is to make it easier to use the already existing development tools. <application>Anjuta</application> main build system uses the standard Linux build system: <application>Autotools</application>. This tutorial is an updated version of the <application>Anjuta</application> advanced tutorial from Olivier Pinçon. It explains how the build system is working without <application>Anjuta</application> and how to use it within <application>Anjuta</application>. It assumes that you have only a basic understanding of C or C++ and have been written using <application>Anjuta 2.6 (September 2008)</application>.
sv: Målet med <application>Anjuta</application> är att göra det lättare att använda de befintliga utvecklingsverktygen. <application>Anjuta</application>s huvudbyggsystem använder Linux standardbyggsystem: <application>Autotools</application>. Denna handledning är en uppdaterad version av Olivier Pinçons avancerade handledning för <application>Anjuta</application>. Den förklarar hur byggsystemet fungerar utan <application>Anjuta</application> och hur man använder det i <application>Anjuta</application>. Den förutsätter att du endast har en grundläggande förståelse för C eller C++. Handledningen är skriven för <application>Anjuta 2.6 (september 2008)</application>.

source: Fill a bug in <ulink url="http://bugzilla.gnome.org/enter_bug.cgi?product=anjuta"> <application>Anjuta</application> bugzilla database</ulink>.
sv: Fylla i en felrapport på <ulink url="http://bugzilla.gnome.org/enter_bug.cgi?product=anjuta"> <application>Anjuta</application>s bugzilla-databas</ulink>.

source: Send a message to <application>Anjuta</application> developer mailing list <email>anjuta-devel@lists.sourceforge.net</email>
sv: Skicka ett meddelande till sändlistan för <application>Anjuta</application>-utvecklare <email>anjuta-devel@lists.sourceforge.net</email>

source: Join <application>Anjuta</application> IRC channel <ulink url="irc://irc.gnome.org/anjuta">#anjuta on irc.gnome.org</ulink>
sv: Använda <application>Anjuta</application>s IRC-kanal <ulink url="irc://irc.gnome.org/anjuta">#anjuta på irc.gnome.org</ulink>

source: If you find errors, need more explanations or have any idea for improvements on this tutorial or <application>Anjuta</application> in general, you can: <_:itemizedlist-1/>
sv: Om du hittar fel, behöver ytterligare förklaringar eller har förslag på förbättringar av denna handledning eller <application>Anjuta</application> i allmänhet så kan du: <_:itemizedlist-1/>

source: Building a project
sv: Bygga ett projekt

source: This chapter explains how to build a program starting from the most basic tool: the compiler. This order is important to understand how is it working because each tool adds a new layer on top of the previous ones.
sv: Detta kapitel förklarar hur man bygger ett program med det mest grundläggande verktyget: kompilatorn. Denna ordning är viktig att förstå hur det fungerar eftersom varje verktyg lägger till ett nytt lager ovanpå de tidigare.

source: Using <application>GCC</application>
sv: Med <application>GCC</application>

source: Here is a typical command to generate an executable from C source files using <application>GCC</application>:
sv: Här är ett typiskt kommando för att skapa en körbar fil från C-källkodsfiler med <application>GCC</application>:

source: This command tells <application>GCC</application> to compile the source files main.c and aux.c, and produce a binary called 'tut_prog' (this stands for 'tutorial program'). The various switches have the following meaning :
sv: Detta kommando instruerar <application>GCC</application> att kompilera källfilerna main.c och aux.c, och skapa en binär fil med namnet ”tut_prog” (detta står för ”tutorial program”, ett handledningsprogram). De olika flaggorna har följande betydelse:

source: tells <application>GCC</application> to include debug information into the binary.
sv: instruerar <application>GCC</application> att inkludera felsökningsinformation i den binära filen.

source: Warning all : print every warning. This switch is used by the C compiler only.
sv: Varning alla: matar ut alla varningar. Denna flagga används endast av C-kompilatorn.

source: <parameter>-Idir <replaceable>dir</replaceable></parameter>
sv: <parameter>-Idir <replaceable>kat</replaceable></parameter>

source: Look for included header files (like in #include &lt;myheader.h&gt;) in directory <replaceable>dir</replaceable>. This switch is used by the C preprocessor only.
sv: Leta efter rubrikfiler att inkludera (som i #include &lt;myheader.h&gt;) i katalogen <replaceable>kat</replaceable>. Denna flagga används endast av C-preprocessorn.

source: Link to library <replaceable>lib</replaceable>; here <application>libxml2</application>, used by the linker.
sv: Länk till biblioteket <replaceable>lib</replaceable>; här <application>libxml2</application>, som används av länkaren.

source: In fact, <application>GCC</application> does not do the compilation itself. It gets all arguments from the user and calls other programs passing them the needed arguments with some default one to do the four stages involved in the compilation.
sv: Faktum är att <application>GCC</application> inte gör själva kompileringen. Det utvärderar användarens alla argument och anropar andra program och överför till dem de nödvändiga argumenten tillsammans med olika förinställningar för att slutföra de fyra stegen i kompileringen.

source: <application>GCC</application> compilation stage
sv: Kompilationssteg för <application>GCC</application>

source: Each C source file goes through the preprocessor, named <application>cpp</application>. In this stage, all include files and macros are expanded to get preprocessed C source code. The resulting file .i is rarely generated but it could be interesting to see how complex macros are expanded. You can do this by calling <application>cpp</application> directly or using the <userinput>-E</userinput> switch of <application>GCC</application>. The later option is better as it allows to run the preprocessor with all default options.
sv: Varje C-källfil passerar genom preprocessorn, med namnet <application>cpp</application>. I detta steg utvidgas alla filer och makron för att få preprocessad C-källkod. Den resulterande filen .i genereras sällan men kan vara intressant för att se hur komplexa makron utvidgas. Du kan göra detta genom att anropa <application>cpp</application> direkt eller använda flaggan <userinput>-E</userinput> för <application>GCC</application>. Det senare alternativet är bättre eftersom det gör det möjligt att köra preprocessorn med alla standardalternativ.

source: Compiler
sv: Kompilator

source: In this stage each file is compiled into assembler code. The compiler depends on the language of the source file, C here. It is a complex program because there is not a one to one correspondence between C instructions and assembler instructions. By example, requesting the fastest or the smallest program will generate different sequences of assembler instructions. The assembler is the language of your computer, the most common one is called x86. The output is a, human readable, assembler source file ending with '.s'. Like the preprocessor output, the assembler code is not normally written on the hard disk. You can stop the compilation at this stage to look at it by running <application>GCC</application> with the <userinput>-S</userinput> switch.
sv: I detta steg kompileras varje fil till assemblerkod. Den kompilator som används beror på språket som används i källkoden, i detta fall C. Det är ett komplext program eftersom det inte finns en direkt motsvarighet mellan C-instruktioner och assemblerinstruktioner. Till exempel kommer en begäran om det snabbaste eller det minsta programmet att generera olika sekvenser av assemblerinstruktioner. Assembler är språket i din dator, den vanligaste kallas x86. Utdata är en läsbar assemblerkällfil som slutar med ”.s”. Precis som preprocessorns utdata, skrivs inte assemblerkoden normalt på hårddisken. Du kan stoppa kompileringen i detta skede för att titta på den genom att köra <application>GCC</application> med flaggan <userinput>-S</userinput>.

source: In this stage each file is assembled: the assembler code is transformed to an object file with .o extension. It is much easier than the compilation as each assembler instruction corresponds to an unique code. The object file contains additional information for debugging or linking the program. The object file is a binary format, called ELF on recent Linux machine, you need to use special program to look in it like <application>objdump</application>. It is possible to write directly assembler code and assemble it using the assembler ,<application>as</application>, or <application>GCC</application> if your source file has a .s extension. These object files are commonly written on your hard disk because it depends only of theirs corresponding C source file (with all files included). If you modify only one source file, you need to regenerate only the corresponding object file. You can stop at this stage, without linking by using <userinput>-c</userinput> switch with <application>GCC</application>.
sv: I detta steg assembleras varje fil: assemblerkoden omvandlas till en objektfil med filändelsen .o. Det är mycket lättare än kompileringen eftersom varje assembler-instruktion motsvarar en unik kod. Objektfilen innehåller ytterligare information för felsökning eller länkning av programmet. Objektfilen har ett binärt format som kallas ELF på datorer med nyare versioner av Linux, för att granska en sådan fil krävs ett speciellt program som <application>objdump</application>. Det är möjligt att skriva assemblerkoden direkt och assemblera den med hjälp av assemblern, <application>as</application>, eller <application>GCC</application> om källfilen har filändelsen <filename>.s</filename>. Dessa objektfiler skrivs vanligtvis till din hårddisk eftersom de endast är beroende av deras motsvarande C-källfil (med alla filer inkluderade). Om du endast ändrar en källfil behöver du bara regenerera motsvarande objektfil. Du kan avsluta på detta steg utan länkning genom att använda flaggan <userinput>-c</userinput> med <application>GCC</application>.

source: Linker
sv: Länkare

source: This stage is used to combine all the object files and libraries into one executable file. The result is a binary file in a format close to the object file, on Linux it is even the same format.
sv: Det här steget används för att kombinera alla objektfiler och bibliotek till en körbar fil. Resultatet är en binär fil i ett format som liknar objektfilen, i Linux är det till och med samma format.

source: Using <application>make</application>
sv: Med <application>make</application>

source: When a program is composed of lots of sources files, it is much faster to keep the object files and recompile each source files only when needed. This can be automated using <application>make</application>. It executes a program written in a makefile, normally named <filename>Makefile</filename>. A sample makefile for the previous tutorial program could be :
sv: När ett program består av massor av källfiler är det mycket snabbare att behålla objektfilerna och endast kompilera om varje källfil bara när det behövs. Detta kan automatiseras med <application>make</application>. Den kör ett program skrivet i en makefil som vanligen heter <filename>Makefile</filename>. Ett exempel på makefil för det föregående handledningsprogrammet kan vara:

source: A simple Makefile file
sv: En enkel Makefile-fil

source: CC=gcc # the C compiler is gcc CFLAGS=-g -Wall -I/usr/include/libxml2 LIBS=-lxml2 tut_prog: main.o aux.o # what we need to have 'tut_prog'... $(CC) $(LIBS) main.o aux.o -o tut_prog # ...and how to get it from the ingredients. main.o: main.c $(CC) -c $(CFLAGS) main.c aux.o: aux.c $(CC) -c $(CFLAGS) aux.c
sv: CC=gcc # C-kompilatorn är gcc CFLAGS=-g -Wall -I/usr/include/libxml2 LIBS=-lxml2 tut_prog: main.o aux.o # vad vi behöver för 'tut_prog'... $(CC) $(LIBS) main.o aux.o -o tut_prog # ...och hur man får det från delarna. main.o: main.c $(CC) -c $(CFLAGS) main.c aux.o: aux.c $(CC) -c $(CFLAGS) aux.c

source: Makefiles are a kind of program but instead of writing what should be done sequentially to get the result, you define some rules and <application>make</application> uses these rules in whatever order to achieve the result.
sv: Make-filer är ett slags skriptprogram, men istället för en skriftlig sekvens av vad som ska göras för att få resultatet, definierar du vissa regler. Därefter använder <application>make</application> dessa regler i någon ordning för att uppnå önskat resultat.

source: Variables
sv: Variabler

source: Like in any programming language, you can define variables in a make file. All variables contains a string or a list of strings separated by whitespace. A variable is defined using the following syntax: <replaceable>name</replaceable>=<replaceable>value</replaceable>. You can get its value by writing $(<replaceable>name</replaceable>) or ${<replaceable>name</replaceable>}. In the sample above, three variables are defined CC, CFLAGS and LIBS.
sv: Liksom i alla programmeringsspråk kan du definiera variabler i en makefil. Alla variabler innehåller en sträng eller en lista med strängar separerade med blanksteg. En variabel definieras med följande syntax: <replaceable>namn</replaceable>=<replaceable>värde</replaceable>. Du kan få dess värde genom att skriva $(<replaceable>namn</replaceable>) eller ${<replaceable>namn</replaceable>}. I exemplet ovan är tre variabler definierade CC, CFLAGS och LIBS.

source: Program for compiling C programs, default 'cc'
sv: Program för att kompilera C-program, standard ”cc”

source: Program for compiling C++ programs, default 'g++'
sv: Program för att kompilera C++-program, standard ”g++”

source: Program for running C preprocessor, default '$(CC) -E'
sv: Program för att köra C-preprocessor, standard ”$(CC) -E”

source: Program for running Fortran compiler, default 'f77'
sv: Program för att köra Fortran-kompilator, standard ”f77”

source: Command to remove a file, default 'rm -f'
sv: Kommando för att ta bort en fil, standard ”rm -f”

source: Extra flags for the C compiler
sv: Extra flaggor för C-kompilatorn

source: Extra flags for the C++ compiler
sv: Extra flaggor för C++-kompilatorn

source: Extra flags for the C preprocessor
sv: Extra flaggor för C-preprocessorn

source: Extra flags for the Fortran compiler
sv: Extra flaggor för Fortran-kompilatorn

source: Extra flags for the linker
sv: Extra flaggor för länkaren

source: Variables can be redefined when calling <application>make</application> in the command line or using values from environment. Moreover <application>make</application> includes some default rules using predefined variables. Here is a list of the most common ones: <_:variablelist-1/>
sv: Variabler kan omdefinieras vid anrop av <application>make</application> på kommandoraden eller användning av värden från miljön. Dessutom innehåller <application>make</application> några standardregler med fördefinierade variabler. Här är en lista över de vanligaste: <_:variablelist-1/>

source: Rules
sv: Regler

source: The basic syntax for make rules is:
sv: Den grundläggande syntaxen för make-regler är:

source: <replaceable>target</replaceable>: <replaceable>prerequisites</replaceable> <replaceable>commands</replaceable> <replaceable>...</replaceable>
sv: <replaceable>mål</replaceable>: <replaceable>förutsättningar</replaceable> <replaceable>kommandon</replaceable> <replaceable>…</replaceable>

source: The <replaceable>target</replaceable> and the <replaceable>prerequisites</replaceable> are normally files but they could be actions. The rule is interpreted as in order to make the target or update it if it is older than its prerequisites, you need to make all prerequisites and then run all commands.
sv: <replaceable>Målet</replaceable> och <replaceable>förutsättningarna</replaceable> är vanligen filer men de kan vara åtgärder. Regeln tolkas som att för att skapa målet eller uppdatera det om det är äldre än förutsättningarna, så behöver du göra alla förutsättningarna och sedan utföra alla kommandon.

source: <application>make</application> starts with the first target of the makefile or the one given in the command line and looks for a rule. If this rules has no prerequisites, the associated commands are run and that's all. Else before running the commands, for each prerequisite, <application>make</application> looks for a rule having it as target and repeats the same process.
sv: <application>make</application> börjar med det första målet för makefilen eller det som anges i kommandoraden och letar efter en regel. Om dessa regler inte har några förutsättningar körs de tillhörande kommandona och det är allt. Annars kommer innan kommandona körs, för varje förutsättning, <application>make</application> leta efter en regel att ha som mål och upprepar den processen.

source: Search a rule with tut_prog as target Found with prerequisites main.o aux.o Search a rule with main.o as target Found with prequisite main.c Search a rule with main.c as target Not found (main.c is a source file) If main.o does not exist or is older than main.c Compile main.c, do not link (-c switch) Search a rule with aux.o as target Found with prequisite aux.c Search a rule with aux.c as target Not found (aux.c is a source file) If aux.o does not exist or is older than aux.c Compile aux.c, do not link (-c switch) If tut_prog is older than main.o or aux.o Link main.o, aux.o and libxml2
sv: Sök en regel med tut_prog som mål Hittades med förutsättningar main.o aux.o Sök en regel med main.o som mål Hittades med förutsättning main.c Sök en regel med main.c som mål Hittades inte (main.c är en källfil) Om main.o inte finns eller är äldre än main.c Kompilera main.c, länka inte (flaggan -c) Sök en regel med aux.o som mål Hittades med förutsättning aux.c Sök en regel med aux.c som mål Hittades inte (aux.c är en källfil) Om aux.o inte finns eller är äldre än aux.c Kompilera aux.c, länka inte (flaggan -c) Om tut_prog är äldre än main.o eller aux.o Länka main.o, aux.o och libxml2

source: In the sample above, if you run <userinput>make</userinput> or <userinput>make tut_prog</userinput>. <application>make</application> does the following: <_:programlisting-1/>
sv: I exemplet ovan, om du kör <userinput>make</userinput> eller <userinput>make tut_prog</userinput>. Gör <application>make</application> följande: <_:programlisting-1/>

source: Like for variables, several target names are commonly defined:
sv: Som med variabler definieras vanligtvis flertalet målnamn:

source: Do everything
sv: Gör allt

source: Perform some self test after building the program
sv: Utför lite självtest efter att programmet har byggts

source: Delete all files created by <application>make</application>
sv: Radera alla filer som skapats av <application>make</application>

source: Delete more files than clean, could delete the Makefile itself
sv: Tar bort fler filer än clean, kan ta bort själva makefilen

source: Create a distribution package, a compressed tarball by example
sv: Skapa ett distributionspaket, till exempel ett komprimerat tar-arkiv

source: Install target created by <application>make</application>, need to be run as root to install in system directories
sv: Installera mål skapat av <application>make</application>, måste köras som root för att installera det i systemkataloger

source: Remove files installed by <application>make</application>
sv: Ta bort filer installerade med <application>make</application>
